{"_id":"bbd86a70-be6b-11e7-adcc-4d581267522b","name":"Ralph Blades","resume_email":"kingslom247@gmail.com","location":"los angeles","title":"Budtener/Sales Rep/Harvest/Grower","jobCategory":"Sales","references":"true","coverLetter":"Dear Supervisor,\r\n\r\n    Hi my name is Ralph Blades, I am writing this letter to apply for the position of cannabis assistant manager/Budtender. I do have good experience in dealing with products, I have great knowledge on overall businesses that may be of your interest. \r\n  \r\n    I worked at Dispensary for about three years. Started at Holistic Healing Collective at 18 years old, as the bud handler then later on i did bud tending as well. I Engaged with customers in a sincere and friendly manner. Like I said I was mainly in the back Weighing out Cannabis breaking down pounds/ Less then a 1:30Hr. I would sometimes have to trim the weed before packaging it. Rolled up joints at least 75 joints a day. I even managed cannabis supplies inventories, including flower, disposable oil pens, vape pens, wax, along side with other cannabis products. While doing all that I helped out patients with their needs, I built relationships with customers to increase likelihood of repeat business. Also completed all cleaning, stocking and organizing tasks in assigned sales area to make it more efficiently. \r\n\r\n   When I moved to LA I worked at Daddy's Collective from 4 to 5 Months. I had communicated information on the cannabis product to sales activities and promotions. Was responsible for building and maintaining rapport within store personnel to effectively meet company and client objectives. I maintained store shelf standards and inventory, including rotation of products. Worked with customers to find which cannabis they want, including indica and sativa strains they prefer to have in the club. Talked to Cancer patients to find out what vape pens, CBD edibles, Oils and etc. to create solutions and ensure a smooth sales process. I will work to find new sales leads, through business directories, client referrals, etc.     \r\n\r\n     Moved back to the bay area Earlier this year, but moving back to LA. I am confident that, I am a perfect candidate for this position you are requiring, so I would like it very much to have an opportunity to further discuss with you regarding your offer.\r\n\r\nSincerely,\r\nRalph Blades","experience":"I worked at Dispensary for about three years. Started at Holistic Healing Collective at 18 years old, as the bud handler then later on i did bud tending as well. I Engaged with customers in a sincere and friendly manner. Like I said I was mainly in the back Weighing out Cannabis breaking down pounds/ Less then a 1:30Hr. I would sometimes have to trim the weed before packaging it. Rolled up joints at least 75 joints a day. I even managed cannabis supplies inventories, including flower, disposable oil pens, vape pens, wax, along side with other cannabis products. While doing all that I helped out patients with their needs, I built relationships with customers to increase likelihood of repeat business. Also completed all cleaning, stocking and organizing tasks in assigned sales area to make it more efficiently. \r\n\r\n   When I moved to LA I worked at Daddy's Collective from 4 to 5 Months. I had communicated information on the cannabis product to sales activities and promotions. Was responsible for building and maintaining rapport within store personnel to effectively meet company and client objectives. I maintained store shelf standards and inventory, including rotation of products. Worked with customers to find which cannabis they want, including indica and sativa strains they prefer to have in the club. Talked to Cancer patients to find out what vape pens, CBD edibles, Oils and etc. to create solutions and ensure a smooth sales process. I will work to find new sales leads, through business directories, client referrals, etc.","additionalInfo":"","contact":"kingslom247@gmail.com","date":"2017-10-31T18:45:58.397Z"}