{"_id":"42540be0-ec07-11e7-9181-0ba658dd01e7","name":"Niagera Hodges","poster_email":"hodgesniagera@yahoo.com","location":"Gardena Ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>I have a large amount of customer service experience, I work as a nurse in a psych facility part time and my availability will be also part time / negotiable. I work well with people, very dependable, have my own means of transportation, very positive and bubbly attitude with a great smile even with my braces lol . I'm the lady who gets the job done , in a team player!</p>","experience":"<p>Niagera Angel Hodges</p><p>Gardena, CA</p><p>hodgesniagera@yahoo.com</p><p>(323) 4039746</p><p><span style=\"color: rgb(102, 102, 102); background-color: rgb(255, 255, 254);\">Work Experience</span></p><p><br></p><p><br></p><p><strong>LVN</strong></p><p>KEDREN COMMUNITY MENTAL HEALTH - Los Angeles, CA</p><p>October 2017 to Present</p><p>Giving a caseload of patients and provide direct care to  patients, which includes facilitating social and emotional needs, supervising medication schedules and evaluating patient progress. I may also collaborate with a variety of interdisciplinary professionals to determine and provide the best possible care for the patients. Educating the patients' family about the conditions and how to create a supportive environment for the patients to return to for long-term care and recovery are also common duties.</p><p><br></p><p>As many patients are hospitalized because they are a danger to themselves and others, I’m solely  responsible for maintaining a safe environment through the use of monitoring devices and restraining techniques where deemed necessary. Providing social support for patients by creating and encouraging patients to take advantage of opportunities such as support groups, social activities and other therapeutic measures, as well as participating with patients where appropriate. </p><p><br></p><p><strong>LVN Nurse</strong></p><p>Junior Blind of America - Los Angeles, CA</p><p>May 2017 to October 2017</p><p>Children's Shelter- The Children’s Shelter puts children first by providing a safe, trauma-focused place for children in crisis whether the need is for immediate shelter, residential treatment, foster or adoptive homes. We work to strengthen families in order to break the cycle of child abuse and offer specialized mental health services for children affected by maltreatment.Medical distribution and healthcare management of residents. Make written and verbal reports/ recommendations to the Director of Nursing concerning the operation of the nursing unit/shift. Monitor residents to assure that personnel are properly administering prescribed treatment. Chart nurse's progress in an informative and descriptive manner that reflects the care provided as well as the resident's response to the care. Maintain compliance with regulatory agencies. </p><p><br></p><p><strong>LVN</strong></p><p>Kindred Healthcare - West Covina, CA</p><p>November 2016 to March 2017</p><p>Head to toe assessment, endorse and receive reports from interdisciplinary team,vital signs, med pass, wound dressing, receiving and transcribing orders, refilling prescriptions, admission and discharge screenings on patients,reporting changes in condition and incident reports, g tube care and feedings, Foley and straight catherization, I &amp; O ,  diabetic care including accuchecks and insulin meds and injections, IM and Sub Q injections, bladder scans, computerized charting via Protouch, med dispensed via Pyxis, assisting RNs with blood transfusions, patient and family teaching </p><p><br></p><p><strong>LVN Charge Nurse</strong></p><p>Seacrest Convalescent Hospital - San Pedro, CA</p><p>July 2016 to November 2016</p><p>Charge nurse for 37 + patients at a post- acute care unit.Duties include med pass, treatments, g tube/ngt care, insertions, feedings, and medication administration, supervise CNAs, inservicing CNAs and LVNs, transcribing orders, following doctors' orders,skilled nursing computerized charting via point click care, maintaining safety to patients, giving quality care with dignity and respect, diabetic care, accuchecks and insulin injections, hospice care, insertion of Foley catheters and in and out catherization, intake and output measurements,colostomy care, head to toe assessment vital signs, pre/post dialysis assessment, immunization injections, dispensing psychotropic/ controlled substance medications, admitting and discharging of patients, stool and specimen collections,making appointments, refilling prescriptions, change of condition / incident reports, and patient and family teaching. </p><p><br></p><p><strong>LVN</strong></p><p>Harbor Healthcare System - Bellflower, CA</p><p>March 2015 to July 2016</p><p>Head to toe assessing, post op care, vital signs, assisting RNs with care plans, g-tube care, feedings, and medication administering, tracheotomy care with suctioning, pediatric care; immunizations, epi-pen administering, epilepsy care and med administering, oxygen given via nasal cannula, Foley catheterization, monitor I&amp; O output, collecting stool and urine specimens, removing IVs , administration of breathing treatments via nebulizer and trach, diabetic care; accuchecks, podiatry care, insulin injections, assistance with dieting and exercising, circulation promotion, wound care, Assistance with daily activities, patient teaching. </p><p><br></p><p><strong>LVN</strong></p><p>Spirit Home Health Los Angeles - Los Angeles, CA</p><p>February 2014 to March 2015</p><p>Total patient care including complete head to toe assessments, recording vital signs, tracheotomy care and suctioning, g tube care, feedings, and administering meds via g tube, administering breathing treatments and medications via nebulizers, accuchecks, insulin injections, computerized charting </p><p><br></p><p><strong>Bus Operator</strong></p><p>Metropolitan Transportation Authority - Carson, CA</p><p>January 2008 to August 2014</p><p>Operates public transit buses, collects fares, transports passengers, perform safety inspection of buses equipment </p><p><br></p><p><strong>Patient Care Technician</strong></p><p>Long Beach Dialysis Center - Long Beach, CA</p><p>September 2003 to July 2004</p><p>Set up hem dialysis machine, vital signs, record weight, connects hem dialysis machine to access in patient's forearm or catheter site to start blood circulating through dialyzer, calculates fluid removal, monitor adverse reaction and dialysis machine for malfunction </p><p><a href=\"https://overview.mail.yahoo.com/mobile/?.src=Android\" target=\"_blank\">Sent from Yahoo Mail on Android</a></p>","additionalInfo":"","contact":"3234039746","date":"2017-12-28T19:42:38.416Z"}