{"_id":"6df02930-d70a-11e7-b491-f5bcdd8c8c37","name":"Jamie Baker","email":"bca18c772d5f711cd421c2b255bf6c2d","location":"Vancouver, WA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>Dear Hiring Manager,</p><p><br></p><p>\tI am very interested in you Budtender/Retail Sales position. I Feel I would make a great addition to your team! First and foremost, out of every dispensary I have been to (Many!) you always carry the highest quality cannabis products. The Staff is always helpful, knowledgeable, kind and compassionate. It is always a relaxed and professional experience visiting your dispensary. I love the laid back and clean atmosphere.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I am knowledgeable about the products you sell as I already have a lot of experience when it comes to cannabis (be it strains, practical application of products, edibles and their effects, etc.). I am a very fast learner and will have no problem learning about any and all of the wonderful additional cannabis products you offer. I will also provide the same knowledgeable, kind and professional demeanor for clientele as your current team of professionals. In addition to these skills, I also have over 13 years of customer service experience that is a skill in which cannot be taught but rather must be learned first hand. I love helping others and by being a part of your team feel that is exactly what I would be doing.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I am a strong advocate for marijuana, even being part of the 2016 OR Cannabis Cup as a sales Representative and promoter in addition to serving over 1,100 customers at New Vansterdam Cannabis Market on 4/20/2017 (plus the 21<sup>st</sup>-the 22<sup>nd</sup> as we celebrated with an entire weekend of sales). I believe in cannabis being incorporated into a healthy and happy lifestyle and am excited to watch the cannabis community grow. Cannabis has virtually cured my chronic body pain issues and aided me in losing over 150lbs since June of 2016, so I am very passionate when it comes to cannabis and its many uses for a happy, healthy and fun lifestyle.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I am currently available for Full Time work and I would love the opportunity to be a part of your team and that experience. I also am an OLCC Marijuana Worker Permit card-holder (A copy is attached to my resume for your convenience). Thank you so much for your time and consideration. I truly look forward to hearing from you soon!</p><p><br></p><p>Kind Regards,</p><p><br></p><p>Jamie G. Baker</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>","experience":"<p>Employment History:</p><p><br></p><p>Set-N-Me-Free Aloe Vera Company (2006-2007)</p><p>19220 SE Stark St. Portland, OR 97233</p><p>503-666-9661</p><p>Position: Sales Representative</p><p><br></p><p>-Meet and exceed monthly sales quota</p><p>-Make cold calls to promote business and increase sales</p><p>-Maintain Client retention of 50% or higher</p><p>-Provide excellent customer service</p><p>-Product knowledge and applicable use to incorporate into the client’s everyday life</p><p>-Work well independently and as a team</p><p>-Operate cash register</p><p>-Make in store sales</p><p>-Bank deposits</p><p><br></p><p>Dosha Salon Spa NW (2007-2008)</p><p>2281 NW Glisan St. Portland, OR 97210</p><p>503-228-8280</p><p>Position: Licensed Massage Therapist/Sales Representative</p><p><br></p><p>-Maintain Client retention of 60% or higher</p><p>-Provide excellent customer service</p><p>-Promote sales of Aveda products</p><p>-Promote and consistently make upgrades in the treatment room to meet monthly goals</p><p>-Complete 30, 60, 90 and 120 minute massage therapy sessions</p><p>-Stay on time with each client at a quick pace to maintain customer satisfaction</p><p>-Operate spa computer programs</p><p>-Operate cash register</p><p><br></p><p>Hand and Stone Massage and Facial Spa (2011-2014)</p><p>16144 SE Happy Valley TC Dr. #200, Happy Valley, OR 97086</p><p>971-252-4345</p><p>Position: Licensed Massage Therapist/Sales Representative</p><p><br></p><p>-Meet and exceed monthly client retention goal of 75%</p><p>-Meet and exceed monthly upgrade and sales quotas of 30% or higher</p><p>-Provide customer service excellence</p><p>-Excellent product knowledge</p><p>-Provide 30, 60, 90 and 120 minute massage therapy sessions, Hot Stone massage, Pre-Natal Massage and hand and foot treatments, aromatherapy.</p><p>-S.O.A.P. Charting for each individual client to maintain client confidentiality (HIPPA)</p><p>-Bank deposits</p><p>-Operate cash register</p><p>-Answer phone calls, book appointments, general office work</p><p><br></p><p>Elements Massage ( June 2016-Dec. 26<sup>th</sup>, 2016)</p><p>22000 Willamette Dr. #107, West Linn, OR 97068</p><p>503-722-8888</p><p>Manager: Diane Lewis</p><p>Position: Licensed Massage Therapist/Sales</p><p><br></p><p>-Maintain and exceed high client retention and upgrade goals for each month (78% client retention and zero client complaints within first 4 months)</p><p>-In room upgrades (Aromatherapy, Hot Stone Massage, longer sessions).</p><p>-Provide 30, 60, 90, 120 and 170 minute massage therapy sessions customized for each client</p><p>-Maintain 100% Client confidentiality (HIPPA)</p><p>-Employee of the month in Sept. 2016 for excellence in client retention rate and client satisfaction in short time span. 100% client satisfaction rate.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>","additionalInfo":"<p>OLCC Marijuana Worker Permit number: 92Y9Y6</p><p>Expires: 8/29/2022</p><p>References available on request</p>","contact":"jamiebakerlmt@gmail.com","date":"2017-12-02T02:42:25.613Z"}