{"_id":"13b6d3e0-d6d0-11e7-920e-d53b2bdd726d","name":"Caitlin Wheeland","email":"007a509767ec1982f9deb5927566c11c","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>To Whom It May Concern:</p><p><br></p><p>I recently relocated from Chicago to LA to pursue a career in the cannabis industry. As a daily cannabis user for over 8 years, I bring a knowledge and understanding of the product. As a recent transplant, my passion for cannabis continues to grow and it has been inspiring to see all the incredible potential it has for society. Whether it is flower, concentrate, soaks and relief patches, it is a new and exciting time for the cannabis industry and I look forward to being a part of that future.&nbsp;</p><p><br></p><p>Throughout my career I have enjoyed a range of customer service positions and want to bring that knowledge, empathy, and passion to helping patients. I love to meet with people and develop relationships. Relationship building around cannabis brings out a passion in me that I can only describe as inherent to everything I am. It is for these reasons I feel I would be a valuable addition to the team. I have a strong desire to care for people and nothing is more rewarding than a customer leaving satisfied and pleased from the work I executed for them.&nbsp;</p><p><br></p><p>I look forward to hearing from you and learning more about a potential role where I can continue to develop my knowledge and fulfill my passion.</p><p><br></p><p>Thank you,</p><p>Caitlin Wheeland&nbsp;</p><p><br></p><p><br></p><p><br></p>","experience":"<p>Caitlin Wheeland</p><p>12850 Branford St. Pacoima, CA 91331</p><p>Caitlin.wheeland@gmail.com 815-382-7494 (Mobile)</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>EXPERIENCE&nbsp;&nbsp;</p><p>Burbank Arts For All Foundation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Burbank, CA&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;April 2017– Present&nbsp;</p><p>&nbsp;&nbsp;Special Events Manager</p><p>Accountable for non-profit fundraising event management including the creation and adherence to budgets, working with the venue representatives and vendors to ensure successful event operations</p><p>Designed soliciting strategies for sponsorship and in-kind donations to grow multiple corporate partnerships with Disney, Warner Brother’s, and NBCUniversal.</p><p>Maintained organized record of event and donor relationships, and conducting necessary follow-up in a timely manner</p><p>Managed budgets and prepared financial analytic models reporting on a monthly basis to event management leadership</p><p>Maintain high level of customer service and the ability to maintain positive, professional, interpersonal relations with fellow staff, Board members, donors and community&nbsp;</p><p><br></p><p>Automatic Building Controls&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Chicago, IL&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;April 2016– April 2017&nbsp;</p><p>&nbsp;&nbsp;Sales Engineer&nbsp;</p><p>Responsible for preparing and finalizing plans, drawings, and various documentation critical to delivering detailed proposals with current and potential clients&nbsp;</p><p>Worked with cross-functional teams to achieve customer-specific system design and implementation objectives for multiple clients across entire Chicagoland region&nbsp;</p><p>Facilitated weekly client meetings with team of mechanical engineers, contractors, and business stakeholders to identify areas of opportunity and develop action plans to successfully complete project milestones and targets&nbsp;</p><p>Developed post-sales support service programs by meeting with clients to address and establish protocols necessary for system sustainability&nbsp;</p><p>Researched, developed, and facilitated sales presentations to prospective clients in effort to achieve and exceed annual internal business development metrics</p><p>&nbsp;&nbsp;Service Coordinator&nbsp;&nbsp;Chicago, IL&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;May 2014 – April 2016&nbsp;</p><p>Created and promoted positive client relations by leading weekly team meetings to discuss areas of opportunity to drive and achieve business development goals</p><p>Directed daily conference calls with field engineers and service team technicians to discuss client needs, project status and any customer service recovery solutions</p><p>Co-led scheduling and communication process improvement project to streamline business practices between clients and employees leading to increased internal and external client satisfaction</p><p>Analyzed current billing standards to identify and implement improved company-wide policies achieving reduced annual costs by 25%</p><p>Coordinated the dynamic schedules for twelve field engineers by ensuring efficiency across entire Chicagoland region to consistently exceed client needs</p><p>Performed exceptional customer service with proactive response to emergency client requests to maintain and uphold company principles&nbsp;</p><p>The Metro&nbsp;&nbsp;Chicago, IL&nbsp;</p><p>&nbsp;May 2009 – May 2014</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hospitality Manager&nbsp;</p><p>Worked with integrated team of promoters, public relations staff, and production management to design and implement&nbsp;events benefiting different local charities to large global organizations including the Special Olympics</p><p>Executed highest quality experience for Metro guests and customers by demonstrating exceptional client relationship skills with multiple high-profile entertainers and industry management professionals</p><p>Consistently demonstrated an exceptional customer experience for all guests and patrons by responding to various customer service requests in a timely and proactive manner</p><p>Managed the coordination and communication between in-house production manager and band management teams to ensure consistent and successful operations with all clients</p><p>Organized the planning and execution of processes to effectively respond to the requests and objectives of various artists and management executives</p><p>Provided additional assistance to management and maintenance efforts of backstage area and green room operations to accommodate unanticipated needs in timely and professional fashion</p><p>&nbsp;&nbsp;&nbsp;&nbsp;Turnberry Country Club&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Crystal Lake, IL&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;Marketing Assistant and Social Media Coordinator&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Feb. 2012 – Sept. 2012&nbsp;</p><p>Lead project coordinator for social media engagement initiative generating a 65% average increase in traffic across multiple social media platforms including Pinterest, Facebook, and Twitter&nbsp;</p><p>Designed and created weekly newsletters with the head chef, membership sales director, and club director informing current and potential members about upcoming and special events in effort to maintain and realize business goals</p><p>Facilitated in planning of weddings, holiday luncheons, charity benefits, and various member events to ensure exceptional services for all clients and customers</p><p>EDUCATION&nbsp;&nbsp;Illinois State University&nbsp;</p><p>Bachelor of Science in Economics&nbsp;&nbsp;Aug. 2006 – May 2010&nbsp;</p><p>Minor in Business Administration and Sociology&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p><br></p>","additionalInfo":"","contact":"caitlin.wheeland@gmail.com","date":"2017-12-01T19:44:43.495Z"}