{"_id":"9b7d67d0-b9ac-11e7-ae17-3908238d05e5","name":"Cindy Carolina Delgado","resume_email":"Ccdelgado977@gmail.com","location":"Los Angeles","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Hope all is well with you today. I am writing to express my interest in your current opening for a Budtender. Please accept my resume into your consideration, which I have enclosed for your review. Contains additional information of my professional expertise. I look forward to the opportunity to meet with you to discuss the qualifications I would bring to your organization. Thank you.\r\n \r\nSincerely,\r\n\r\nCindy C Delgado","experience":"Cindy Delgado\r\n\r\n\r\n146 South Utah Street\r\nLos Angeles CA 90033\r\n(323) 271-7438\r\nCcdelgado977@gmail.com\r\nEXPERIENCE\r\n7eleven, Las Vegas Nevada—Store Clerk\r\n2014 - 2016\r\nOpen and close cash register, performing task such as counting money, separating charge slips, coupons and vouchers. Balancing cash drawers and making deposits. Accept payments for rent electric or phone bills, load card with cash, print out money orders, additional duties consist of forecasting, ordering, and stocking merchandise throughout the store. Verifying age of customer if they purchase alcohol or cigarettes. Activate fuel pump, prepared food make coffee also sell food and grocery items. Operate car wash, stock stage beverages and products.\r\n\r\nKMQ Imports Inc, Las Vegas Nevada— Retail/Customer Service\r\n2011- 2016\r\nResponsible for marketing and selling store products ( handbags, evening bags, straw bags, hats and wallets) Serving to potential customers, exceeding sales targets. Participate in sales and marketing activities for the purpose of meeting branch sales goals and objects. Data entry,filing paperwork, scanning, printing, and making orders for clients. \r\n\r\nEDUCATION\r\nFree LA High, Inglewood CA — High school Diploma\r\n2007\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nReferences \r\n\r\n\r\n\r\nDiana Zuniga -  Program Manager\r\n(562) 964-8668\r\n\r\nAugustin Herrerra Program Instructor\r\n (617) 334-4937\r\n\r\n\r\nMiguel Rodriguez- Project Director, Latin America & Caribbean\r\nYouthBuild International\r\n(512)751-4677\r\n\r\n\r\nSKILLS\r\nRetail, Customer service representative and administrative support. \r\nLANGUAGES\r\nSpanish/English","additionalInfo":"*Bilingual in spanish\r\n*Customer Relations\r\n*Well organized\r\n*Team player","contact":"please contact me through Email Ccdelgado977@gmail.com or at my cell phone (323)271-7438","date":"2017-10-25T17:47:45.637Z","timestamp":1508953665}