{"_id":"3df46f10-1e4b-11e8-9b51-911143b9faa2","name":"Mark Winter","poster_email":"markwinteris@gmail.com","location":"Ontario, Canada","title":"Sales and Key note speaker","jobCategory":"Sales","references":"true","coverLetter":"<p>Great day Team Trimmerwork, </p><p>My name is Mark J. Winter from Toronto, Ont, Canada.</p><p><br></p><p>It is my goal to connect, educate and help people by sharing my experiences with and the benefits of using prescribed Medical cannabis.</p><p><br></p><p>Three years ago, I began to suffer from chronic hip pain. I was prescribed various pharmaceutical medications that resulted in insomnia, thirty pounds of weight loss and anxiety to name just a few of the worst side effects. My doctor then sent me to a Cannabinoid Clinic where the doctor prescribed Nabilone (a synthetic cannabis). It was not effective at all and caused bouts of extreme drowsiness. Shortly after that I was prescribed cannabis and cannabis oil which began to have the best effect on my pain.</p><p>I'm experiencing great relief from the quality and variety of my medically prescribed cannabis products. All aspects of my life have been enriched. I am back in harmony with my health, home, work and social activities.</p><p><br></p><p>For the past twenty years I've been a sales manager for a textile importer in Toronto, Ontario. Sales training, key account management and trade shows have been a major part of my work. My main focus has been to create brand recognition, client rapport, development and retention.</p><p><br></p><p>For the past thirty five years I've been a student and an Instructor of Martial Arts for knowledge, discipline and skills training. Dealing with chronic pain, training has become an every day need for my optimum health. I have also been teaching Mindfulness and Meditation workshops to institutions, companies and individuals. The workshops over the last two years have been primarily focused on teaching mindfulness for pain and stress management.</p><p><br></p><p>In closing, I believe, with your products and people along with my story and skills set, that we would be able to help many people discover the healing power of Cannabis products.</p><p><br></p><p>Sincerely,</p><p>Mark J Winter&nbsp;</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>","experience":"<p>Mark J Winter</p><p>705.796.7353</p><p>markwinteris@gmail.com</p><p><br></p><p><br></p><p>Objective</p><p><br></p><p>To elevate the information about and positive perception surrounding the medical marijuana industry, creating an enlightened environment where client, community, medical professionals, governments and licensed suppliers needs are met, and exceeded.</p><p><br></p><p>Skill set</p><p>&nbsp;</p><p>• Fearless presenter</p><p>• Engaging speaker</p><p>• Proven to increase sales</p><p>• Skilled mentor and motivator</p><p>• Effective message agent and deal closer</p><p>• Disciplined (35 years martial arts)</p><p>• Experienced relief from pain through the avenue the company promotes</p><p><br></p><p><br></p><p>Work Experience</p><p><br></p><p>National Sales Manager&nbsp;Soletex Fabrics 150 Buttermill Cres., Concord ON</p><p>2001-present</p><p><br></p><p>• Increased sales every year and presently lead the profit generating division</p><p>• Suggested new products that produced a 20% increase in sales</p><p>• Hired, trained and refined sales representatives and sales agents across Canada</p><p>• Developed distribution networks through retail outlets across Canada</p><p>• Designed, conducted and orchestrated trade shows for the design industry</p><p>• Engaged buyers, creating direct communication channels with front-line retailers&nbsp;</p><p>• Enterprising speaker driving company branding and public relations through targeted delivery of company messaging at trade shows, charity affairs and untold networking opportunities</p><p><br></p><p>District Sales Manager&nbsp;Alendel Fabrics Concord ON</p><p>2001-1993</p><p><br></p><p>•&nbsp;Steadily Increased sales every year</p><p>•&nbsp;Hired, trained and mentored sales representatives and sales agents across the country</p><p>•&nbsp;Developed relationships by creating distributors and retail stores across Canada</p><p>•&nbsp;Delegate to Germany buying convention purchasing new products and discovering new&nbsp;&nbsp;&nbsp;trends</p><p>•&nbsp;Advanced client relations and created new opportunities across the country through trade shows</p><p>•&nbsp;Travelled through the Eastern U.S. developing new client accounts</p><p>•&nbsp;Public face of the company through speaking engagements, charity affairs and trade shows</p><p><br></p><p><br></p><p>Sales Representative Alendel Fabrics Concord, ON</p><p>1985 – 1993</p><p><br></p><p>• Expanded territorial sales by 100% when the recession was on, and all others decreased.</p><p>• Opened more accounts with better margin than company average</p><p>• Developed Excellence in Sales training course (CPSA)</p><p>• Public spokesman for the firm via charity fundraising</p><p><br></p><p>Management Training Program Holiday Inn Bramalea ON</p><p>1985-1983</p><p><br></p><p>• Primary entrant in new program encompassing work in all departments of hotel operations</p><p>• Delivered customer focused experience from front desk, housekeeping, restaurant, kitchen and dining room</p><p><br></p><p><br></p><p>Education</p><p>Sheridan College</p><p>1981– 1983</p><p>• Applied Arts Diploma - Hotel and Restaurant Management&nbsp;</p><p><br></p><p><br></p><p>Interests</p><p>• Martial and Healing Arts, and Meditation</p><p>• Chess,</p><p>• Canoeing and kayaking</p><p>• Reading (Contemporary history, biography, philosophy, Eastern religions)</p><p><br></p>","additionalInfo":"<p>Since 1999 I've been a Mindfulness Educator teaching workshops to companies, organizations and individuals.</p><p>*Sales Manager for a Textile importer traveling across Canada.(16 yrs to present)</p><p>*Martial art instructor</p>","contact":"Markwinteris@gmail.com","date":"2018-03-02T18:55:14.992Z","layout":"post"}