{"_id":"6b583b20-c05f-11e7-aa67-3596880d4b81","name":"Acacia Wrack","resume_email":"Acaciawrack@gmail.com","location":"Los Angeles","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Acacia Wrack\r\n206-353-7343\r\nAcaciaWrack@Gmail.com\r\n\r\nDear Potential Employer,\r\n\r\n I am excited to apply for the available position with your organization. I feel as though my skills will be an asset to your team. I am the perfect candidate because I am determined, motivated, and have a unique ability to multitask. I feel I am qualified for several reasons. First I am determined to get the job done each and every time I am on the clock. I was currently working at Seattle Homegoods, I take phone calls at a fast pace while also maintaining accuracy. I do my best to ensure customers get the best service and leave satisfied. I am motivated to come to work on time, every time. I always leave my house two hours before my shift starts in order to ensure I am on time. If employed with your company, I am motivated to make sure that all my duties are completed before I leave and that my work station is clean and organized. I just moved to California on October 29th, I have high work ethic keeps me on my toes and ready to work at a fast pace, and I've had 10 month training from Sanctuary Arts Programmed by the Y.M.C.A up in the U-distract Seattle, WA I have worked with photo shop, illustrator, Paint press, masking screens, Cleaning screens, and also created a design of my own on a shirt that has up sale online. Every day I strive to do my best, Right now i am working on my digital media production and is crafting for new sound and music. I averaged a 3.2 GPA in my class,​​ I am always aware of my surroundings and take on multiple tasks at once,. My ability to jump from one task to another makes me a quick and efficient employee. Because of these reasons and my easy going personality I believe I will be a great addition to your team. I look forward to hearing from you. Please contact me at 206-353-7343 for an interview.\r\n\r\nThank You\r\n\r\nSincerely,\r\nAcacia Wrack","experience":"Homegoods sept 2016 oct 2017","additionalInfo":"","contact":"Acaciawrack@gmail.com","date":"2017-11-03T06:22:51.773Z"}