{"_id":"882ea9d0-b9b8-11e7-ae17-3908238d05e5","name":"Shiloh Summers","resume_email":"Shsummers02@gmail.com","location":"Los Angeles, CA","title":"Budtender, Dispensary Assistant Manager, Manufacturing, Processing.","jobCategory":"Sales","references":"true","coverLetter":"To Whom It May Concern:\r\nOriginally from New England, I graduated college with a bachelors degree in business and economics, and moved out to California where I've spent the past three years working in high-end retail management. I just moved to Los Angeles, and am seeking new opportunities within the cannabis industry. I would like to start, and grow my cannabis career with an established organization. I am both very passionate and knowledgeable about cannabis, and am a firm believer in it's medicinal and economic benefits it provides. \r\n\r\nWhat makes me stand out against other candidates is my work-ethic, motivation, and innovation. As excellent as I am at following procedure and instructions, I do like to go the extra mile, and think of new ways to innovate and improve all aspects of a business. I've utilized this ability with my former employers, and have optimized their business models to become more profitable and efficient. My eagerness to learn and always self-improve also makes for a strong candidate. Lastly, my ability to not only bring the best version of myself to my work everyday, but bring out the best version of my colleagues is another strength I harness. \r\n\r\nI believe I can meet or exceed all expectations or this position. Feel free to contact me at any time.\r\n\r\nSincerely yours,\r\nShiloh Summers","experience":"K. Frank\r\nCurated selection of men’s and women’s contemporary and designer clothing, accessories and footwear representing independent designers from around the world. \r\n\tSales Manager (November 2014-August 2017) Santa Barbara, CA\r\n\t•\tStreamlined business operations by consulting with company representatives and independent designers to solidify specific project completion dates, and ensured customer satisfaction.\r\n\t•\tEfficiently organized and executed daily management tasks, such as maintaining an up-to-date record of inventory, and provided ownership with reports of daily professional activities.\r\n\t•\tPerformed market research to strategically merchandise product specific to client trends and city demographic.\r\n\t•\tGathered and synthesized product sales analytics in order to calculate trends, and establish which marketing strategies and products should be continued priorities. \r\n\t•\tConsistently exceeded monthly sales incentives as the top sales person.\r\n\t•\tDeveloped strong interpersonal relationships with clientele, and produced new customers through their network and referrals, while working as their stylist.\r\n\t•\tManaged all print and social media marketing campaigns to increase brand awareness.\r\n\t•\tRecruited, managed, and developed all part-time associates.\r\n\r\n\tHollister Co.     \r\n\tAssistant Manager/ Manager in Training (July 2014-November 2014) Ventura, CA\r\n\t•\tCompleted intensive nine-week management training course pertaining to business management, marketing, sales, staffing, aesthetics, and asset protection.\t\r\n\t•\tOperated all marketing and merchandising updates utilizing local and corporate strategies developed specifically for target consumer.\r\n        • \tManaged all staffing, training, and development of part-time associates to corporate standards. \r\n        -\tTrained thoroughly in expense management and closely adhering to all state specific labor laws.\r\n        -\tAssisted in all daily operations, achieving sales incentives, and attaining consumer brand loyalty.\r\n\t\r\n\tShoeboxed Australia\r\n\tMarketing Assistant (January 2013-April 2013) Sydney, NSW, Australia\r\n\t•\tConstructed business reports, managed social media marketing, and performed customer service to enhance company sales and increase client base.  \r\n\r\n\tMad River Tents \r\n\tSeasonal Manager (summers, 2012-2013) Campton, NH\r\n\t•\tManaged all hiring, development, and scheduling of employees.\r\n        •  Independently led a team in planning and construction of event structures under strict deadlines.","additionalInfo":"","contact":"Shsummers02@gmail.com  and/or    617-515-2006","date":"2017-10-25T19:13:07.374Z","timestamp":1508958787}