{"_id":"fc4d8d30-bdc4-11e7-b840-6d18dcdaf523","name":"Daniel Meza","resume_email":"simbameza@yahoo.com","location":"Downey","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"I wanted to express my extreme interest in employment as a budtender in response to your ad. I believe that my charisma, sales experience, and intimate knowledge of industry products are perfectly in-line with what you are looking for in an employee. Additionally, my friendly and outgoing personality makes me a perfect fit for the team.  \r\n\r\nI have a lot of experience in the industry as a patient, and I am hoping to be a part of what I believe to be one of the most important movements of the 21st century by way of using my customer service skills to help those in need.\r\n\r\nIf you review my resume, you will see that I am comfortable in high-pressure and fast-paced jobs, and excel at customer service because of my friendly attitude. Finally, my open availability and punctuality make me a prime employee to have on staff for weekends, holidays, and sudden shift changes that need filling. Feel free to contact me at any time. \r\n\r\nThank you for your consideration and time, \r\nSincerely,\r\nM. Daniel Meza","experience":"Event Coordinator (Production) - Miss TEEN USA \r\nDowney, California 90241 \r\nNovember 2013 (One-day event) \r\n\r\nServing as technical production supervisor to the Downey High School advanced drama production team, I was hand-picked to lead the backstage tasks in putting on a 4-hour, fully scripted and timed pageant for Miss Teen USA.\r\n\r\nApparel Associate - Zumiez \r\nDowney, California, 90242\r\nJune 2015 – February 2017\r\n\r\nWorked as an associate for the apparel store at Stonewood Mall for two years where I learned about trendy fashion and how to appeal to customers by approaching them with a warm greeting and engaging their interest in style.\r\n\r\nNews Writer – TalonMarks Newspaper\r\nNorwalk, California 90703\r\nDecember 2015 – December 2016\r\n\r\nWrote for the news team and covered sports events as part of the Cerritos College newspaper, turning heads as one of the most consistent young writers and providing fresh content via multimedia like videos and photos. \r\n\r\n\r\nRadio Program Coordinator - WPMD\r\nCerritos, California 90703\r\nDecember 2015 - December 2016\r\n\r\nBroadcasted at WPMD.Net as a weekly radio host, in charge of two hourly programs in the basketball-themed talk show called “NBA Talk” and a hip-hop themed show named “High Vibes”. Catering to both a global audience on the internet as well as the students of Cerritos College. \r\n\r\nHead Writer - WhatCulture\r\nNew Castle upon Tyne, England\r\nJune  – September 2017\r\n\r\nFormerly the head writer of hip-hop, in charge of in-depth lists and articles that shed light on the genre. Just started, but the position is primarily done from home, leaving room for spare time. \r\n\r\nFreelance Writer – The Gamer \r\nSt. Laurent, Quebec, Canada \r\nAugust 2017\r\n\r\nCurrently writing as a freelance contributor to TheGamer.com where I provide lengthy lists that cover a variety of topics in the world of video games and provide insight to my intimate knowledge of the futuristic medium.","additionalInfo":"Fluent in Spanish, 80 WPM certified typist, well versed in Associated Press style, advanced PC, Mac, and Linux. \r\nA published writer, skilled and knowledgeable in the world of hip-hop music, basketball, video games, professional wrestling, and film. Experienced photographer with an eye for detail. \r\nAdvanced proficiency with editing software programs such as Sony Vegas, Photoshop, Adobe Premiere, Final Cut Pro, and office programs like Excel, Word, PowerPoint, and Outlook.","contact":"(951) 525-9431","date":"2017-10-30T22:52:20.707Z"}