{"_id":"428cee10-baa2-11e7-ab4b-85603fc84630","name":"John Alfaiate","resume_email":"JohnAlfaiate@hotmail.com","location":"Los angeles","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Hi There! Hope your doing good!\r\n \r\nI found your guys Job post and i decided to give it a chance and apply. I'll like to be consider for the position. I have a 3+ years background experience in executive assistance, customer service and sales. I also feel myself like an outgoing person who likes to share a laugh and a good conversation.\r\n \r\nIf you want to check a little bit more about me you can find my persona IG at: @itsalfaiate\r\n \r\nIf you have any questions please let me know\r\n \r\nThank you for your time and consideration,","experience":"J Fitness Active Wear                                                                                                           December 2016 – September 2017\r\nExecutive Assistant                                                                                                                                           Downtown Los Angeles \r\n•\tManage e-commerce website \r\n•\tManage upset customers, conflicts and challenging situations. Also delivered outstanding service, exceed expectations and build long term loyalty.\r\n•\tDirector of social media, product and promotion content.\r\n•\tCoordinate and recruit staff and events, promotions and photoshoots.\r\n•\tSetup and coordinate National Trade Shows.\r\n•\tResearch, approve, and manage ambassadors for social media marketing.\r\n•\tStockroom and wholesale assistance when needed.\r\n•\tGeneral office work.                                                                           \r\nMolly Bracken Showroom                                                                                                             March 2016 – September 2016                  Sales Rep and Customer Service                                                                                                                            Downtown Los Angeles\r\n•\tManaged Trade Show set up.\r\n•\tTraveled Western States seeing accounts on the road and averaged $15K a day in sales.\r\n•\tBuilt strong relationships with Buyers.\r\n•\tManaged customer service team to increase showroom task efficiency, tracked shipments, order entrys and optimized delivery performance.\r\n•\tManaged social media accounts to increase brand recognition.\r\n•\tManaged stockroom and samples.\r\nJonathan K Apparel                                                                                                                         April 2015 – February 2016        Assistant Manager and Buyer                                                                                                                                Downtown, Los Angeles\r\n•\tSales Representative at Off Price Show in Las Vegas\r\n•\tBuyer\r\n•\tMail sales packages, attended sales meeting, sourced new merchandise, organized showroom, dealt with production issues and efficiently edited graphics of incoming merchandise.\r\n•\t Managed web site, social media, schedule meetings, appointments and general ofﬁce work.\r\n Guess                                                                                                                                                October 2014 – April 2015 Sales and Stock Associate                                                                                                                             Beverly Center, Los Angeles\r\n•\tSales Associate \r\n•\tStock Assistant: Organized stock room, processed shipment, charge sends, packaged E-comm orders, replenished sales floor, assisted in sales, cashier, styling and costumer services.","additionalInfo":"","contact":"johnalfaiate@hotmail.com","date":"2017-10-26T23:06:12.628Z"}