{"_id":"bd7fee20-eb48-11e7-a44f-935f90061bb7","name":"Michael Parrish","poster_email":"mikegparrish@ucla.edu","location":"Los Angeles","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>To whom it may concern,</p><p> My name is Michael Gregory Parrish and I am applying for the driver position. </p><p>I am more than familiar with most tenets of the cannabis plant. I possess extensive knowledge in regard to the cultivation, preparation and use of marijuana. Born and raised in San Francisco California, my formative years were spent in the cradle of the medical marijuana industry, and the spiritual home of cannabis culture and use in general. I have long been interested in both the psychoactive properties of tetrahydrocannabinol, and the role that the wonderful plant has played in the long continuum of human society, and have developed an in-depth understanding of the natural and sociological history of the plant. </p><p>Being that I am from Northern California, I have had considerable experience being around, and working for, grow operations of all sorts; from micro, apartment suitable hydroponic setups in Oakland, to massive industrialized grows in Mendocino. I have spent many a harvest in the Emerald Triangle, and am well versed in the cultivation of cannabis from seed to mature plant. I am a speedy and experienced trimmer of flowers and have also aided in the production of THC concentrations, including kief, tinctures, bubble hash, and innumerable varieties of oils. </p><p><br></p><p>I am familiar with all facets of THC use, can easily communicate the medicinal, recreational, and even spiritual aspects of countless strains, and have also honed a sharp understanding of the difference between indica and sativa, both in terms of the physical nature of the different plants themselves, and especially regarding their respective psychoactive attributes. I could easily explain and communicate this knowledge to a curious patient, and could successfully lead a patient to their perfect strain, based on whatever effects they desire. </p><p><br></p><p>I am knowledgeable in regard to the laws concerning the use and cultivation of cannabis, from Proposition 215 and Senate Bill 420, to the Adult Use of Marijuana Act (AUMA), otherwise known as Proposition 64. I am a longtime medical marijuana patient myself, and have first hand experience in regard to the healing properties of this most beloved plant. I have come to feel that marijuana use in an inherent aspect of the human condition, and am relieved that societies views have evolved enough to realize the terrific potential of this gift of a plant. However, I am still weary of draconian views towards marijuana in the federal sphere, and as a longtime member of NORML California, understand that the fight to defend cannabis has really just begun. While admittedly weary of the affects government bureaucracy will have on the California marijuana trade, I am also excited in regard possibilities legalization will bring on the economic front, and would love the opportunity to continue to participate in the “green boom” that is currently taking place, in any role where I may be of the most use. </p><p><br></p><p>Perhaps most importantly, where the position you have available is concerned, is my experience both delivering medical cannabis and working as a supervisor for marijuana delivery start up Ganjarunner, based out of Glendale. As such, I have first-hand experience with all facets of packaging, sorting, and delivering, medication to patients in need. I also know how to successfully supervise and manage a team. I am a self-driven, capable and responsible multi- tasker, who gets the most out of those under my charge. I know that any team is only as good as its leader, and I take pride in this notion. At Ganjarunner I aid in the creation of our driver’s schedules, work directly with distributors, aid in the keeping of our books and assist in the management of both our shipping and delivery based orders. While it can be a juggling act at times, I am always cool under pressure and enjoy the dynamic, fast paced nature, of this sort of position. Perhaps most importantly, I thoroughly enjoy working with our patients, and feel that excellent customer service is the primary attribute for success at any retail or business organization. I have found this to be especially true during my time in the medical marijuana industry. At Ganjarunner I have been made privy to the inner workings of a cannabis dispensary, both as a driver and as a supervisor, and feel the insight that this affords me will be of great service to you. </p><p><br></p><p>Also, I am a college educated individual, with a B.A. in History from UCLA with a M.A. in History from California State University Fullerton. I am a consummate professional who prides himself in all he does and will represent your company well. I also of course have my California Medical Marijuana License and as such can begin working for you immediately. </p><p>Thank you for your time and consideration.&nbsp;</p>","experience":"<p><strong>EDUCATION</strong></p><p>\tCalifornia State University Fullerton</p><p>\tMasters of Arts: History</p><p>\tGPA: 3.82</p><p>\tDegree Conferral Date: 01/2015&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p><br></p><p>\tUniversity of California, Los Angeles</p><p>\tMajor: History</p><p>\tMinor: Scandinavian Studies</p><p>\tGPA: 3.83</p><p>\tDegree Conferral Date: 06/2012</p><p>\t</p><p><strong>AWARDS AND HONORS</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;UCLA College Honors graduate </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;UCLA <em>magna cum laude</em> Latin Honors Recipient </p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;UCLA Dean’s Honors List</p><p><br></p><p><strong>WORK EXPERIENCE </strong></p><p><strong>&nbsp;</strong></p><p>\tGanjarunner: Medical Marijuana Delivery and Shipping:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Driver and Supervisor: 07/2016-Current</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ganjarunner is a medical marijuana shipping and delivery service that provides&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>\tfor patients in the greater Los Angeles metropolitan area. As a driver for&nbsp;&nbsp;Ganjarunner I processed, shipped and delivered orders in timely and expedited manner. I was also responsible for shop work, such as the production of edibles, rolling joints, and cleaning and upkeep. As a supervisor, I am responsible for the scheduling of drivers and keeping the books duringmy shifts. I also oversee the rotation of drivers and general management employees under my charge. Perhaps the most important facet of my supervisorial role in customer service. As supervisor I am responsible for taking orders, dealing with product questions, and making sure all patient needs are considered and taken care of. I also work to maintain our inventory and work directly with our distributors. Furthermore, I maintain the websites blog and assist in the media and marketing aspects of the company, social and otherwise. </p><p>\t</p><p>\tEDGE Studio &amp; Grip:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Copywriter: 07/2012-06/2016</p><p>EDGE Studio &amp; Grip is a multi-use, dual studio space, that facilitates creative expression and creation for a variety of mediums, by offering clients a renovated, expansive, industrial space, that has the distinct advantage of offering a incredible variance of lighting and grip on-site. At EDGE Studio &amp; Grip I was responsible for all written creative content; both in-house and for studio clients. I created copy for the EDGE Studio website, EDGE Studio brochures, and aided in improving the general marketability of the companies’ capabilities. I also crafted copy for a variety of EDGE clients, generally photographers who needed a written narrative to accompany photo-based campaigns, or help with other forms of copy requisite creative content.&nbsp;&nbsp;</p><p><br></p><p>\tDuke Empirical:</p><p>\tTechnician: 07/2005- 09/2008</p><p>Duke Empirical Inc. is a leader in medical device tubing and catheter components manufacturing and design. During my employment, I was primarily responsible for UV adhesion and lumen components of the Duke Aspiration Catheter manufactured for Boston Scientific. I was also trained to manufacture products used in Duke Empirical extrusions and for the CALYPSO project (radiation localization for cancer treatment); all while adhering to F.D.A. safety standards.</p><p>&nbsp;</p><p><br></p>","additionalInfo":"","contact":"mikegparrish@ucla.edu (310) 897-0510","date":"2017-12-27T20:58:51.217Z","timestamp":1514408331}