{"_id":"7f551150-bf80-11e7-9a95-93d98d54c65b","name":"Diane Rivera","resume_email":"Dianer30.dr@gmail.com","location":"los angeles","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"My name is Diane Rivera. I am 21 years old currently seeking a part time job. I believe that I am the best candidate for this position because of my extensive customer service and my ability to adapt to any situation. I have a passion for success and goal oriented demeanor that would push me to accomplish my set tasks. Also, with my personable character I can work well and communicate with others to contribute to team efforts. In all that I do I would strive to advance the company, and I feel that my previous work experience proves that. I am willing to start as soon as needed. I appreciate it. For further information feel free to contact me at (323) 237-0202. Thank you for your time.","experience":"Buddha Co, Los Angeles, CA - Trimmer\r\nOctober 2016- January 2017\r\nPrimary responsible for the efficiency and quality of the plant trimming in preparation for sale.\r\nResponsible for accurately weighing and recording trim weights\r\nOriginal Green Bear, Los Angeles, CA - Budtender\r\nJune 2016- October 2016\r\nBecame informed on the variety of products and brands available for patients\r\nHeavily populated dispensary with long shifts while keeping a positive attitude\r\nPolish + Paint,  2530 S Figueroa st Los Angeles, CA  - Receptionist\r\nOctober 2015- May 2016\r\nGrew as an individual by learning and providing great customer service on a daily basis.\r\nGained personal knowledge on keeping composure under pressure, situation resolving, remaining professional and also accommodating customers with payment procedure.\r\nGreen Stop Collective, Huntington Park, CA - Budtender\r\nApril 2015- June 2015\r\nExperienced in dealing with patients and helping fulfill their medical needs\r\nDifferentiate types of strains and explain their effects\r\nMr. Nice Guy, Los Angeles, CA - Budtender\r\nSeptember 2015- October 2015\r\nObtained much knowledge on the right terminology of cannabis to be able to explain \r\nBesides affiliating with patients, also provided maintenance around the dispensary","additionalInfo":"Experience with Microsoft Office -Word\r\nPrioritizing and organizational skills\r\nExcellent problem solving and communication skills, with a focus on customer service\r\nFamiliarity with Point Of Sales software\r\nMental math skills\r\nAble to work with little to no supervision\r\nBilingual (Spanish/English)","contact":"Dianer30.dr@gmail.com","date":"2017-11-02T03:47:07.717Z"}