{"_id":"eccaedd0-bd8d-11e7-b840-6d18dcdaf523","name":"Michael Morton","resume_email":"Sean5788@gmail.com","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"My name is Michael Morton and I saw your job posting on Craigslist. I’ve attached my resume in pdf format as well as in the body of this email. I think I would be a great fit for your cannabis company as I am very detail oriented and check my work 2-3 times before completion, while also having experience with handling cash transactions in more than one business setting. In these different settings I learned to interact with different clientele of different business settings and cultural backgrounds, which helped me learn to read different situations that may arise and handle them accordingly to appease both customers and the business. I am a fast learner and have a real passion to learn the business behind medical/recreational marijuana and the future ahead for the industry. I would feel content at the end of each day knowing I helped further a patients knowledge of a cannabis strain or broaden their different options on consuming their flowers, oils, shatters, wax, crumble, or edibles. My goal is to treat your dispensary as an extension of myself putting it forth in the best light. \r\n\r\nMICHAEL S. MORTON\r\n Sean5788@gmail.com","experience":"RESUME\r\n\r\nMICHAEL S. MORTON\r\n Sean5788@gmail.com\r\n\r\nExperience\r\n\r\nUber Technologies, 2016-present\r\nIndependent Contractor\r\n- Receives requests to pick up items from various businesses and deliver them to customers, sometimes multiple.\r\n- Aware of time management.\r\n- Daily/Weekly sale goals.\r\n- Positive relations with employees from many different businesses, as well as customers.\r\n- Maximize profitability by putting myself in different areas at prime hours.\r\n- Balance money for quarterly taxes.\r\n\r\nRed Hot Video, Venice, CA 2009-2012\r\nSales Associate\r\n- Cashier and Customer Service Representative.\r\n- Assisted customers with account inquiries and merchandise.\r\n- Opening and closing procedures; balancing cash register and setting alarm system. \r\n- Inventory count of movies and products weekly.\r\n- Oversaw movie title system.\r\n- General Cleaning.\r\n\r\nTimeless Treasures Thrift,\r\nCulver City,CA 2008-2009\r\nSales Associate\r\n- Cashier and Customer Service Representative.\r\n- Assisted in store donations and wrote tax deduction slips for donating customers.\r\n- Assisted in inventory control and placing items on sales floor.\r\n- Assisted in instructing volunteers of tasks for the day. \r\n- Assisted manager in closing duties.\r\n\r\nMervyns, Westchester, CA\r\n2006-2008\r\nSales Associate/Men’s Department Cashier\r\n- Cashier and Customer Service Representative.\r\n- Unloading and processing of merchandise from trucks that came at multiple times during the day.  \r\n - Assisted other departments in team and individual efforts. \r\n- Assisted customers with items to vehicle when needed.\r\n\r\nSmart & Final, Inglewood, CA\r\n2006\r\nStore Clerk\r\n- Restocked shelves and returned items frequently during shift.\r\n- All janitorial work from sweeping, mopping, taking out trash, cleaning glass doors and windows.\r\n- Cleaning freezer.\r\n- Disposing of perishable items.\r\n\r\n\r\nSkills\r\nWord, PowerPoint, Photoshop, Adobe Illustrator, Adobe InDesign, 70-100 w.p.m","additionalInfo":"","contact":"Sean5788@gmail.com","date":"2017-10-30T16:18:12.658Z"}