{"_id":"f3a002a0-b958-11e7-894a-d15bf7809318","name":"Christine Clayton","email":"18f6f4cfabf494f6234d795a99356337","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"My name is Christine, and I would be interested in working as a Budtender. I am currently a freelancer in Television Production, so my schedule is pretty flexible (I create my own schedule), and am looking for steady work to supplement.  \r\n\r\nI have never worked in the cannabis industry, but I have customer service and pitching experience. I worked at Starbucks for 2 years and was a receptionist at Emerson College. I also worked on the daytime talk show, The Doctors, which gave me strong pithing experience. A large portion of my job was trying to get brands and PR companies to provide over thousands of dollars worth of products for audience giveaways or monetary donations for guests/fundraisers and doctors to provide surgeries and other medical procedures free of cost in exchange for exposure on our show.\r\n\r\nAlthough I have never worked in the cannabis industry, I am a quick learner, self-starter, have a super outgoing personality and a general knowledge about weed. I eventually would like to grow in the cannabis industry career-wise, so I think this would be an amazing place for me to start.","experience":"I went to Emerson College, where I majored Television Production and minored in dance.  During my last semester at Emerson, I studied at our Los Angeles campus and interned for the Doctor's TV Show.  I moved to LA officially in June of 2015 and was hired on as a Production Assistant for the Doctor's that August, where my main role was a researcher, but also carried out other PA/office tasks.  The following season, I was promoted to Associate Producer, where I was able to develop and pitch segment ideas and book guests.\r\n\r\nI wanted to broaden my experience in production, so I started freelancing in May of 2017.  Since then I have worked as a Production Assistant MTV's Safeword and Lip Sync Battle Shorties, where I gained more experience as a set PA.  On Lip Sync, I carried out whatever tasks that were asked of me, \r\nwhich were mostly taking care of lunch orders, going on runs, picking up gear/equipment, and helping to manage paperwork and releases.  Both of those jobs lasted about 2 months.","additionalInfo":"","contact":"creneclayton@gmail.com","date":"2017-10-25T07:48:55.719Z","timestamp":1508917735}