{"_id":"a688e950-c32b-11e7-a068-4bb54bc96aa1","name":"Brenda Castellanos","resume_email":"Brenda.castellanos@gmail.com","location":"Montebello, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Dear Hiring Manager,\r\n\r\nI write in response to your ad. As a highly competent Accounts Receivable Representative and Project Management Coordinator. I would bring a dedicated, reliable, and driven attitude to this role.  \t\r\n\r\nUpon reviewing my resume you will find, that I am goal-oriented, enthusiastic, and determined to concur and endure obstacles I come across in my current position I maintain an exceeding functional work environment while delivering exceptional customer service for AltaMed Health Services. I feel qualified to apply for the position available and I am confident that I will be a valuable asset to you and your team. \r\n\r\nIt would be a pleasure to meet with you to discuss this position and my qualifications in more detail. Please feel free to call or email me in the information provided above to arrange such a meeting.\r\n\r\nThank you for your consideration. \r\n\r\nSincerely, \r\n\r\nBrenda Castellanos","experience":"Accounts Representative III\t\t\t\t Promotion August 2017 – Current \r\nAccounts Representative II \t\t\t\t\tPromotion – August 2015\r\nAccounts Representative I \t\t\t\t\tChange of Status- August 2014\r\nCHDP Billing Specialist\t\t\t\t\tFebruary 2013\r\nAR III -Verifies validity of account discrepancies by obtaining and investigating information customer service departments, and from customers. Resolves valid or authorized deductions by entering adjusting entries. Resolves invalid or unauthorized deductions by following pending deductions procedures. Resolves collections by examining customer payment plans from various aligned medical payer such as Medi-Cal, Medicaid, and Managed Care as well as Commercial payers. Summarizes receivables by maintaining invoice accounts. Manages monthly \"Aging Reports\" to validate payment processes and workflows capability. Protects organization's value by keeping information confidential. Updates job knowledge by participating in educational opportunities, such as Medi-Cal seminars and webinars. Generates and submits timely health insurance billing claims and/or patient statements. Includes follow up on unpaid claims and re-submission of unpaid claim documents.  Resolve disputes in contested billing and initiate collection of patient co-payments, deductibles and open balance amounts through telephone contact, letters. Review and resolve payment denials and claim rejections for specific payer groups; research explanation of benefits and re-submit within 48 hours of receipt. Verification of insurance eligibility and benefits as needed. Payment posting of all patient, and insurance. Make line item adjustments, as directed, for all zero pays and denials. Analyze balancing report to ensure accurate posting. Close batches in system at end of day. Member of the Contract Review Committee, which is responsible for the negotiation and management of contracts with health insurance plans and the evaluation of government payment policy. Review contracted and non-contracted health plans to create new payers or insure existing payers in NextGen are following the proper guidelines for maximum payment reimbursement. \r\nProject Coordinator – Help coordinate project management activities, resources, equipment and information. Break projects into doable actions and set time timeframes. Create workflows, project plans, and charters to analyze risks and opportunities. Monitor project progress and handle any issues that arise. Act as the point of contact and communicate project status to all participants. Work with Project Manager to eliminate blockers.\r\nBack Office Receptionist \t\t\t\t\tJune 2011 – July 2012\r\nAnswer phones and operate a switchboard. Route calls to specific people. Answer inquiries about company. Greet visitors warmly and make sure they are comfortable. Call persons waiting for visitor and book them a room to meet in. Gather personal and insurance information. Perform basic bookkeeping, filing, and clerical duties. Worked with Microsoft Programs such as Excel, PowerPoint and Word. Provided patients with Physical Therapy that involves EMS, Ultrasound & Manual Therapy. Billed Medicare, Workers Comp & Private Group Insurances. Assisted the Chiropractor to develop & process X-rays.","additionalInfo":"Customer Service, Answering phones while attending to patients. Multi-tasking.","contact":"Brenda.castellanos@gmail.com","date":"2017-11-06T19:49:50.709Z"}