{"_id":"b1edd670-c54c-11e7-b632-cf088a114575","name":"Nicole calderon","resume_email":"Nicolevcalderon@gmail.com","location":"Alhambra, Ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Hello my name is Nicole Calderon and I am 19 years old. However I prefer to be called Nikie. I started work when I was 16 years old and always excelled with my customer service skills. At my first Job at Pizzafive85/Pie12 I was promoted so shift lead at 16. Throughout all my previous jobs including my current work place at the bank, I have many customers I tend to build relationship with that tend to become my regular customers. I believe I have great people skills that makes people feel more comfortable around me easily. Also, with my banking experience, As well as cashier experience for 3 plus years, I have experience with handling cash, sales, and customer service that I believe would be a great addition to your team. I am a hard worker and a fast learner. For your reference my instagram is @redracer53. I am also currently on Team Topak and assist with planning, hosting, and instructing st road racing track events. Lastly my availability is Mon—Fri any time, and lastly weekends early morning-1 pm","experience":"Pizza 585, Monterey Park— Shift Lead\r\nMay 2015-September 2015\r\nProvided outstanding customer service\r\nProvided support in schedule making and organization using excel skills.\r\nTook inventory and organized lists.\r\nPrepped and prepared ingredients and pizzas.\r\nCashier\r\nHelped interview and train new team members\r\nCafe86, Pasadena— Staff\r\nMarch 2016 - May 2017\r\nPrepared Drinks, sandwiches, and teas for customers\r\nCleaned, and closed store\r\nCashier\r\nDivided tip money among worker\r\nForever 21, Montebello— Sales Associate\r\nNovember 2016 - May 2017\r\nCashier\r\nAble to work at a fast pace and maintain good work.\r\nMeeting Credit Card and Email Goals.\r\nTop employee on obtaining credit cards and emails for two months.\r\nHomeStreet Bank, Pasadena — Customer service representative\r\nMay 2017 - Present\r\nTeller duties such as withdrawals, deposits, and customer service.\r\nClerical duties such as filing, answering phone calls, emails, gathering information for managers, etc.\r\nOpened and closed accounts and provided support in performing audits.","additionalInfo":"Computer Keyboarding Certificate-typing skills, google application skills, and Microsoft word,excel,PowerPoint, and outlook skills.","contact":"Nicolevcalderon@gmail.com","date":"2017-11-09T12:51:25.588Z"}