{"_id":"542d99f0-d8be-11e7-84b8-65f7ac69ee30","name":"Alliya Cunanan","poster_email":"cjayde08@icloud.com","location":"Northridge, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>My name is Alliya Jayde Cunanan, I am 19 years old and looking for a job that I would enjoy and definitely love doing. I’ve had many experiences where I learned that I really loved working in the customer service industry. I love working as a team and with customers to help them with what they are trying to find, or need. I definitely dedicate and commit to any job that is presented. I am the type of individual to keep busy and occupied working rather than sitting around doing nothing. I love to stay active in my work setting. And I most definitely try to show that I try my best and I also have room to expand my knowledge to the job in order to do even better. </p>","experience":"<p>I have had one previous job at McDonalds. I was there for a couple years and was offered the shift manager position within the first 1-2 months working there. My duties as a manager was to make sure customers were happy, food was well prepared, stock the floors, keep cleanliness of the store, make sure the crew is given their breaks at the correct times, dropped the deposits, counted safe, and inputted the transfers in and out of inventory.</p><p><br></p><p><br></p><p>I also previously worked at a MMJ collective. Woodley Care Center. I was there for two months being fully trained at this new shop. My duties as a budtender here was to assist all new/returning patients, stock the shelves, fill jars, check patients in and out, keep the cleanliness, make sure I give the patients their daily deals or even give them the best deal they can receive by upscaling. Unfortunately I had to leave due to the shop being bought by a different owner. </p>","additionalInfo":"<p>I really enjoyed and loved working for this MMJ collective and being in the industry itself. I want to expand with working with an industry like this because I enjoy and love it. I believe people/patients should receive the best customer service all the time. It is our job as the workers/budtenders to assist any customer with any need of theirs. I wish to work at another Collective very soon and hopefully be given the chance to be taught about this industry even further. </p>","contact":"Cjayde08@icloud.com","date":"2017-12-04T06:42:42.969Z","slug":"budtender","tags":["user-generated"]}