{"_id":"14b35e60-bffd-11e7-9a95-93d98d54c65b","name":"Natalia Noriega","resume_email":"natalia.noriega@icloud.com","location":"North Hollywood","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"I am writing to express my interest in the Budtender position as advertised online and have attached my budtender resume and recent photos for your review.\r\n\r\nMy decision to apply for this position was based strictly on the fact that I truly believe in the healing powers of Medical Marijuana and the benefits it offers to patients in need. \r\n\r\nI also have my Bachelors degree in Business / Marketing and experience as a Budtender which has equipped me with a multitude of business and customer service skills. I feel I am the ideal candidate for this position being that I am a professional with good energy who can assist in creating a positive and fun environment for your patients.\r\nOther highlights of my background that may be of interest to you include:\r\nValid Doctor’s Recommendation and CA Driver’s License\r\nKnowledge of marijuana strains and gram weights\r\nNaturally tech savvy (PC, MAC, iPad), social media savvy (Instagram, Twitter, FaceBook, Blogging, LinkedIn, etc), and advanced in MS Office, Outlook, Adobe Suite, & QuickBooks\r\nAccustomed to interfacing and liaising with high-end clients and maintaining the highest level of confidentiality and discretion.\r\nFlexible hours, reliable transportation, and extremely punctual and reliable\r\nLocated in North Hollywood\r\nAmazing references from my corporate positions (L’Oreal and HCT Group - separate resume)\r\nAlthough my accompanying resume illustrates my background well, I feel that a personal interview would better demonstrate my knowledge and abilities.\r\n\r\nThank you for your review and consideration.\r\n\r\nSincerely,\r\nNatalia Noriega","experience":"EXPERIENCE\r\nSTRAIN BALBOA CAREGIVERS | JAN 2016 – MAY 2016 \r\nBudtender\r\n•\tAnswered questions about cannabis strains, their effects and made recommendations when requested.\r\n\r\n•\tDelivered exceptional, friendly, and fast service.\r\n\r\n•\tAccurately recorded orders and served each patient in a timely manner\r\n\r\n•\tResearched the linage of the strains as well as new strains that were coming to the market\r\n\r\n•\tManaged closing duties, including cleaning, taking inventory, restocking items and reconciliation of the cash drawer.\r\n\r\n•\tPromoted a work environment that is positive, customer-service oriented, and compliant with established policies and procedures\r\n\r\n\r\nTHE GOODLIFE MEDICAL DISPENSARY| SEPT 2012 – FEB 2013 \r\nBudtender\r\n•\tVerified and registered patients\r\n\r\n•\tGuided patients through menu selections while demonstrating thorough knowledge of each cannabis strain\r\n\r\n•\tAppropriately suggested additional items to customers to increase sales.\r\n\r\n•\tRegularly checked on patients to ensure satisfaction \r\n\r\n•\tConsistently adhered to quality expectations and standards. \r\n\r\n•\tEnsured Patient Lounge was always clean, neat and stocked\r\n\r\n•\tRoutinely cleaned table linens, table settings, smoking equipment, windows, counters, floors, storage areas, and service refrigerators.\r\n\r\n\r\nEDUCATION\r\nSAN DIEGO STATE UNIVERSITY\r\nBachelor of Science, Business Administration — Marketing","additionalInfo":"","contact":"Please contact me at natalia.noriega@icloud.com","date":"2017-11-02T18:38:55.704Z"}