{"_id":"44e243e0-b99e-11e7-ae17-3908238d05e5","name":"Isaiah Villaolivo","resume_email":"villaolivo.isaiah@gmail.com","location":"Los Angeles","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"My name is Isaiah and I’m a freshman at Pasadena City College, planning on major in communications and liberal arts.\r\n\r\nI realized you are looking for a self-starter with the ability to multitask while staying organized and being efficient. I’m highly interested in this opportunity.\r\n\r\nI am enthusiastic, reliable and willing to learn. My last year in high school I was part of the water polo team and I regularly take part in the community service and charity events with different kinds of people. I learned how to collaborate with others and work effectively in a team in order to accomplish a common goal. \r\n\r\nAn organized, detail oriented, and conscientious self-starter, able to strategize and prioritize effectively to accomplish multiple tasks and stay calm under pressure. \r\n\r\nI have enclosed my resume and can supply references. Thank you for taking the time to review my application and consider me as a candidate. I look forward to hearing from you soon and the opportunity to discuss how I can contribute to your team.","experience":"THE STOCKING FRAME – Los Angeles, California, May 2017- Present \r\nFood Runner/Busser\r\n•\tMaintained high standards of customer service during high-volume, fast-paced operations.\r\n•\tCommunicated clearly and positively with coworkers and management\r\n•\tBuilt loyal clientele through friendly interactions and consistent appreciation\r\n•\tCross-trained and coordinated scheduling with team members to ensure seamless service\r\n•\tMaintained sanitation, health, and safety standards in work areas\r\n•\tKnowledge of all the ingredient details of every dish in the menu\r\n•\tDelivered food to guest quickly and efficiently\r\n•\tBuilt and maintained relationships with regular customers by learning and remembering preferences","additionalInfo":"","contact":"Please email me at villaolivo.isaiah@gmail.com or call me at 626.660.8283","date":"2017-10-25T16:05:07.460Z","timestamp":1508947507}