{"_id":"375fb2c0-c4b6-11e7-a796-f9370fc17991","name":"Shawn Thomas","resume_email":"Shawn18thomas@gmail.com","location":"West Hollywood","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Good Afternoon,\r\n\r\nMy name is Shawn Thomas, I live in West Hollywood, CA and am highly interested in the budtender and/or harverster for you.\r\nI have always been fascinated with marijuana and the amazing effects it has towards sleep, anxiety, cancer, and numerous other problems mankind suffers from. I am extremely familiar with the strands of marijuana and what a customer looks for when looking for the perfect strain to envelope their problems. \r\nMy work demeanor is something I personally hold to the highest standards possible. Professionalism, courage, level-headed, and a positive can-do attitude are just some of the aspects I can bring to the shop and the company.\r\nI have plenty of experience trimming new batches, measuring to exact standards, and customer interaction.\r\nMarijuana has continuously helped me with my social anxiety, insomnia, and eating habits.\r\nThis is a job I have craved for a long time and have learned various techniques and processes in order to become one of the best budtenders for the shop iI work for. I would love to be a part of your family, but only if you need a loyal and punctual team player to join the team.\r\nI hope you can see me as an asset for the months, hopefully years, to come.\r\n\r\nThank you for your time,\r\nShawn Thomas\r\nShawn18thomas@gmail.com\r\n310.533.7652","experience":"-Independent Contractor (Movies) - Art Department - May 2010-Current\r\n-Graphic Designer - May 2010 - Current\r\n-Paper or Plastik Cafe - April 2016 - June 2017\r\n-Youth Center on Highland - January 2016 - April 2016","additionalInfo":"Artist, Painter, Draw, Design, Graphic Design, Jokes, Mathematical and Creative problem solving","contact":"Call or text me at anytime at 310.533.7652 or email me at shawn18thomas@gmail.com","date":"2017-11-08T18:54:15.505Z"}