{"_id":"fac99f50-c0c4-11e7-aa67-3596880d4b81","name":"Vicky Barboza A.","resume_email":"mostartistik@gmail.com","location":"Los Angeles, CA (Koreatown)","title":"Bud tender","jobCategory":"Sales","references":"true","coverLetter":"Hello, I am Vicky Barboza A, I currently reside in Korea-town, Los Angeles. I am 23 years young and I'm interested in a Harvesting or Bud-tending position. I have no experience in this field particularly. However curiosity got the best of this cat and I am willing to learn and be a proud hark worker for your business. Am a fast learner, and have great eye-to-hand coordination. I like to work fast and be as efficient as I can and I build rapport with clients and co-workers. Please look into my resume to see my work ethic. Thank you for your time.​","experience":"May 2017 - September 2017\r\nOptimum Synergy Enterprise/ Innovative Lending Group LA / Exit Real Estate Group    -      Personal Assistant \r\n*Prioritizing workloads\r\n*Managing databases  (for Real Estate & loan officers)\r\n*Taking messages, making calls, and handling daily correspondence \r\n*Responsible for typing, filing, taking inventory, writing and handing checks.\r\n*Provide administrative support on a one-to-one base, handle a team of 25 associates both real estate agents and loan officers\r\n\r\nAugust 2016 - May 2017 \r\nThe Springs, Los Angeles CA          - \tLine Cook & Expodiser\r\n*Prepare ingredients  in anticipation for service \r\n*Acknowledge health code regulations and keep stations clean and well presentable \r\n*Great visual learner and able to take constructive criticism.\r\n\r\nAugust 2015 - September 2015\r\nDeYoung Museum and Cafe, San Francisco  - Busser & Cashier\r\n*Responsible with counting my register with appropriate money to begin and end with. \r\n*Work in a fast paced team and kept pristine communication to keep the team moving.","additionalInfo":"Work well under pressure and fast pace environment\r\nExercises rapport towards customers to maintain loyal customers\r\nAble to give and take constructive criticism \r\nPunctual, great time management skills\r\nComputer literate \r\nProficient in Photoshop CS6 \r\nProficient in EXCEL and Docs","contact":"Please contact me via e-mail at mostartistik@gmail.com or cell no 213.618.9930","date":"2017-11-03T18:29:51.589Z"}