{"_id":"bb172300-d6e5-11e7-b491-f5bcdd8c8c37","name":"Adam Barker","email":"mada.rekrab@gmail.com","location":"Portland, OR","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>Dear Hiring Manager,</p><p><br></p><p>I&nbsp;have experience working in a marijuana processing warehouse in north Portland. I have see hundreds of strains come through and have developed knowledge of plant anatomy, terpene content, CBD/THC, drying processes, trimming, oil/extracts, etc. I was also involved in intake from farms, organizing and separating strains, and taking inventory. I also have over 3 years experience working with various POS systems in retail and food service. I'm 28, personable, and social media savvy, so I think I would make a great asset to your growing business. My availability is open, and I'm willing to accommodate whatever schedule you'd like. I'm very interested in budtending, but I'm willing to fill in for whatever you need and do a bit of everything. I'm always eager to learn more.&nbsp;I can be reached my return email or call/text&nbsp;<a href=\"tel:(386)%20314-3587\" target=\"_blank\" style=\"color: rgb(17, 85, 204);\">(386) 314 -3587</a>.</p><p><br></p><p>Thanks for your consideration,</p><p><br></p><p>Adam Barker</p><p>386-314-3587</p><p>mada.rekrab@gmail.com</p><p>303 SE 8th Avenue,</p><p>Portland, OR 97214</p>","experience":"<p><strong>Cut &amp; Dry Cannabis Trimming, Portland, OR  June 2017 - present (2 weeks put in)</strong></p><ul><li><em>&nbsp;Quality Control Lead/Trimmer</em></li></ul><p>Duties included: maintaining scales and weighing out product, handing out weighed buckets to trimmers,</p><p>updating forms to ensure proper weight and prevent weight loss, entering individual weights into Excel</p><p>spreadsheets separated by trim, stick, small and big buds, inspecting trim quality from trimmers, trimming</p><p>or bucking cannabis efficiently to meet quota, general cleaning, performing intake when accepting from</p><p>farms or moving between different crews, making sure to always keep sterile environment and keep strains/</p><p>farms separated, identifying problem areas such as mold, mildew, etc, hang-drying</p><p><br></p><p><strong>Bon Appétit Management Company at Google HQ, Fremont, Seattle, WA  2015 - 2017</strong></p><ul><li><em>&nbsp;-Micro-Kitchen Attendant/Barista/Food Service</em></li></ul><p>Duties included: Restocking snacks and beverages for Google employees, taking inventory and placing</p><p>new orders when supplies are low, meeting with product suppliers, filling/fixing coffee machines, taking</p><p>requests from employees, food prep and baking, cleaning/bussing, restocking various items, assisting with</p><p>catering events, serving espresso/food at the employee cafe</p><p><br></p><p><strong>Crossroads Trading Company , Seattle, WA 2013 - 2015</strong></p><ul><li><em>&nbsp;-Sales Associate/Cashier/Buyer</em></li></ul><p>Duties included: Operating cash register and using unique POS system to handle transactions, taking</p><p>accurate register accounts, appraising value of trade-ins and buying, assisting customers with dressing</p><p>room, cleaning, locking up at end of shift, tidying store and organizing clothing based on types</p>","additionalInfo":"<p>I also have delivery driving, maintenance, and professional house cleaning experience. I have my OLCC marijuana worker's permit and can send to you whenever you need. </p>","contact":"mada.rekrab@gmail.com","date":"2017-12-01T22:19:43.759Z"}