{"_id":"041b23e0-d6bd-11e7-920e-d53b2bdd726d","name":"Monica Sanchez","email":"03bb23828ff8ff84622d1f56017c8f68","location":"Long Beach CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>I want to prove myself above and beyond. I have some work experience and I am a real asset. I want to use my skills to grow and expand for the company. I can succeed in a stimulating and challenging environment, as long as I know what to do I can easily over-come any obstacle. I am very hard working with a lot of perseverance and dedication. I am highly motivated and would enjoy the opportunity to prove it. I’m professional, productive, and punctual. I'm energetic, bubbly, and believe in giving the best customer service 100% of the time.</p>","experience":"<p><br></p><p><strong>California Gang(Budtender/Receptionist/Packager/Trimmer/Baker)</strong></p><p><em>10/20/2015-3/12/17</em></p><p>I would help with any and all tasks. Maintain the dispensary, making sure everything is cleaned constantly. Greet each patient and serve the patients with an upbeat attitude at all times. Help patients with any questions or concerns. My role would constantly change due to the working demand. From each given day I could be the budtender, then the receptionist, trimmer, packager, and baker when needed. It all depends under the circumstances. I’m great at doing many different things at once. Help with delivery runs to ensure quality on time, every time.&nbsp;</p><p><br></p><p><br></p><p><br></p><p><strong>Shop Airlines(Manhattan Beach)</strong></p><p>11/7/16- <em>6/19/17</em></p><p>Duties: Inspector/Locater; Pick items, inspect items, and pack items to ensure no damages. The items are sent to warehouse then after inspected, they are to be sent to Japan. Must work in a fast but steady pace. Locate and weigh items to be shipped out. Help bundle items to be sent out to Japan. Help find packages when they get lost.&nbsp;</p><p><br></p><p><br></p><p><br></p><p><strong>Nova(Carson, CA)</strong></p><p>6/21/17-11/25/17</p><p>Duties: Checker; Check the pallets that are going to be shipped out. Make sure all numbers match, and count all boxes on each pallet if applicable. Write down warehouse numbers, with pallet number and the date and time. Sign off the paper once fully counted for. Help identify pallets along with labeling all such pallets that belong together. Help sort each pallet according to warehouse numbers. Sweep and clean up after oil spills from the Forklifts. Help seal the trucks to leave when needed.</p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>","additionalInfo":"","contact":"562-986-3766","date":"2017-12-01T17:28:16.842Z"}