{"_id":"bc303cd0-ba99-11e7-ab4b-85603fc84630","name":"Jullian Blankenship","resume_email":"jullian.blankenship@icloud.com","location":"Los Angeles","title":"Budtender, trimmer, stock","jobCategory":"Sales","references":"true","coverLetter":"Hello, name is Jullian Blankenship and I'm 30 years of age. New to the Los Angeles area and eager to start work. Being able to work in an industry that I regularly have as a part of my life seems to make sense. I am a big people person, learning and understanding others is always interesting and fun and always can make time pass so nice. Hobbies if mine are running, working out, catching up on my guilty pleasure shows, dancing , hanging with my beagle and when time can be made chillin with my bf. I feel I can be a total fit because I love to learn, I'm responsible, respectful and understand right from wrong and seeing the bigger picture. I don't like negative in positive so if being neutral is the key that is me to a T.","experience":".Kitson- Newport Beach. Fashion island - positions I've held : sales, customer service, key holder. Duties would include, open and closing of store, floating cash registers in morning and at end of night, answering phone calls, inventory, handling customer complaints, merchandising, sales. Worked for the company for 2-3 years total until company went bankrupt as of December 2015.\r\n\r\n.H&H- San Diego, Orange County - positions I've held: sales, customer service, stock associate, when I left the company last I was just promoted to my own department for merchandising and learning the company more to eventually workout into a role of supervisor or merchandiser. Duties: sales, cashier, customer service, stock, merchandising, float drawers in am, closing and cleaning departments at end of night. Inventory. Worked for the company back in San Diego when I was 20-(22-23) when I then moved to Orange County.","additionalInfo":"I have over 10 years of customer service and sales experience.","contact":"Jullian.blankenship@icloud.com","date":"2017-10-26T22:05:11.132Z"}