{"_id":"91514910-b95d-11e7-894a-d15bf7809318","name":"Eduardo Bautista","email":"b144fc65802e541a5e1c64dd43a40b63","location":"Montebello CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Dear, To who it may concern,\r\n\r\n\r\nI was recently informed about a open job position. After inquiring about the job description I am confident that I am perfect for the position as my experience and abilities precisely match your requirements. \r\n\r\nWithout sounding boastful I feel that I am an exceptional manager who comes to you with a very fun, loving, unique and distinctive personality from other applicants. I have 6years in retail management experience at a high volume corporate store by the name of G by Guess (assistant manager), Co-Manager (Store manager in training) at Forever 21, Floating Area manager with the company Shoe Palace & currently at a family owned business by the name of GsLove. \r\n\r\nI have the ability to plan and organize on a daily basis, and posse’s extensive knowledge of the retail industry. I have an obsessive focus on customers that means I can keep delivering new idea, new looks and new reasons for them to keep coming back. All of this coupled with my proven ability to drive sales, motivate and encourage the sales team, continuous tracking of sales and achieving daily sales goals. I've done 8 new store openings merchandised and implemented the company's standards for each new location. Also traveled to different store within the region to set up company visual standards and prompts. Which I believe has prepared me for a position in your store.\r\n\r\nI would greatly welcome the chance of an interview, where we would be able to discuss in greater detail the value and strength I can bring to your already successful company. \r\n\r\nI thank you for your time and look forward to hearing from you\r\n\r\n \r\nSincerely,\r\n\r\n \r\nEduardo Bautista","experience":"Sales manager from 2011-Present \r\n\r\nG by Guess - Loss Prevention Operations manager \r\nForever 21- Co-Manager \r\nShoe Palace- Store Manager/Area Floating  Manager \r\nGstage- General Area Manager","additionalInfo":"","contact":"Eduardobautista0627@gmail.com","date":"2017-10-25T08:21:58.329Z","timestamp":1508919718}