{"_id":"a5462590-d6b2-11e7-920e-d53b2bdd726d","name":"Christopher","email":"e62c90d9748c9d0f63f9f6ec2b86e576","location":"Los Angeles, Ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>Dear ,</p><p><br></p><p>I was excited to see your listing for the position of Bud Tender with Trimmer Work. Although I do not posses direct experience in the field I believe that my five years of inventory, customer service experience,  and my passion for your products make me an ideal candidate for this role. You specify that you’re looking for a Bud Tender with  high energy and enthusiasm, great listening &amp; problem solving skills, and also able to follow directions well. I feel that I am more than capable of providing those skills and would like to be given an opportunity to prove that.</p><p><br></p><iframe class=\"ql-video\" frameborder=\"0\" allowfullscreen=\"true\" src=\"https://tpc.googlesyndication.com/safeframe/1-0-14/html/container.html\" height=\"1\" width=\"3\"></iframe><p>I am currently looking for a challenging position that will utilize the skills that I have acquired over the years working in Customer Service. I am a fast learner, and flexible, while always maintaining the good cheer that you’d want from the first person visitors see when they interact with the company.</p><p>I have attached my resume, and will contact you within  the next week to see if we might arrange a time to speak.</p><p>Thank you so much for your time and consideration.</p><p>Best,</p><p>Christopher Crumsey</p>","experience":"<p><strong>Food4Less</strong></p><p><strong>Lead Customer Service Specialist/Warehouse Operations</strong></p><p>2010-2017</p><ul><li>Process customer financial transactions as a cashier</li><li>Stock products for customer consumption</li><li>Maintain Back office/Warehouse crew</li><li>Back up supervisor in case head manager is not present to lead</li><li>Lead several other crew members to come up with effective work plan</li><li>Order product for the store to maximize sales depending on seasons and holidays</li><li><br></li></ul><p><strong>Wells Fargo</strong></p><p>2011-2012</p><p><strong>Teller/Sales Operations</strong></p><ul><li>Management Experience Maintaining positive environment for customers</li><li>Cash handling experience</li><li>Upsell different types of products the company had to offer customers.</li></ul><p><br></p><p><strong>Home Depot</strong></p><p>2009-2010</p><p><strong>Cashier</strong></p><ul><li>Attain credit for the store by selling home depot credit cards</li><li>Answer customer questions based on the products and departments</li><li>Process customer financial transactions as a cashier&nbsp;</li></ul><p><br></p><p><br></p><p><br></p><p><br></p>","additionalInfo":"","contact":"crumseychris@yahoo.com","date":"2017-12-01T16:14:03.422Z"}