{"_id":"f3dd4e30-b962-11e7-894a-d15bf7809318","name":"Bhodi Idolyantes","email":"04074ac2e4e061eb0ba2db5073148092","location":"Pasadena","title":"Sales / Marketing","jobCategory":"Sales","references":"true","coverLetter":"Rob here, I have been in marijuana sales and distribution since my college days in 2001 to the present where I have done wholesale distribution and supplied people from all abroad. With a clean record. (Background check and I will pass with flying colors) I have experience in corporate structure to mom and pop businesses. I worked at a collective awhile back as a budtender and eventually became a manager with experience in complete day to day operations, cash handling and team leader. I also have a degree in graphic design and very savvy in marketing strategies. I am looking for a career in the legal world of the cannabis industry. Can you help? Because I can sure help you.","experience":"Sales /Marketing\r\nTwelve Bar, West Hollywood California, United States\r\nJuly 2008 - March 2010\r\n• Built relationships with artist, media, and other brands \r\n• Created media awareness for the brand through social media and hands on street marketing\r\n• Opened 60 store accounts for the brand\r\n• Organized sales rep meetings for Magic and Project trade shows\r\n• Assisted the Creative Director in production and design of Twelve Bar collections\r\n\r\nSales / Marketing\r\nArchrival, Los Angeles California, United States\r\nApril 2010 - January 2012\r\n• Created marketing campaigns with other brands to build cross promotion\r\n• Collaborated with Black Scale in 2012 with a small capsule collection\r\n• Opened accounts with Skate shops and Men’s apparel boutiques\r\n• Organized events to launch brand collections \r\n \r\nManager\r\nCloud 9 collective, Los Angeles California, United States\r\nFebruary 2012 - December 2012\r\n• Managed daily operations\r\n• Customer Service \r\n• Handled all vendor relations and buyer experience\r\n• Created marketing strategies and monthly promotional ads\r\n\r\nManager\r\nCloud 9 collective, Los Angeles California, United States\r\nFebruary 2012 - December 2013\r\n• Managed daily operations\r\n• Customer Service \r\n• Handled all vendor relations and buyer experience\r\n• Created marketing strategies and monthly promotional ads\r\n\r\nSales / Marketing\r\nLBS customs, City of Industry, California, Unites States\r\nJanuary 2013-March 2017\r\n• Managed daily operations\r\n• Customer Service \r\n• Created marketing strategies and monthly promotional ads","additionalInfo":"Adobe premiere \r\nAdobe illustrator \r\nWord\r\nAssociates in Graphic Design degree\r\nGolf\r\nSnowboard","contact":"Idol.r26@gmail.com","date":"2017-10-25T09:00:31.172Z","timestamp":1508922031}