{"_id":"477237d0-b941-11e7-894a-d15bf7809318","name":"Sophia C","email":"bef565a43c285f5cbd74f9f29070e532","location":"Los Angeles ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"I provide exceptional customer service.","experience":"Sophia Camacho\r\nLos Angeles ca. 90018\r\nitzsophie16@aol.com (562) 612-8904\r\n \r\nObjective: \r\nTo obtain employment either in retail/sales, food services, clerical or strong customer service based positions. I would like to obtain a position that utilizes and further develops each of my skills and will allow me to work my way up into a position of more responsibility. My communication skills are excellent and I enjoy getting to know various kinds of people. I will make it a point to familiarize myself to know all aspects of the business, I look forward to the challenge of learning new skills and becoming a valuable asset to the company.\r\n \r\nEducation:\r\nLos Angeles City College, 2014\r\nLong Beach School for Adults, 2011\r\n \r\nPrevious Work Experience:\r\nDolby Theater, Guest Services, Los Angeles,  Ca. 2014\r\n-I currently work here part-time. I work various events. From simple meetings to conferences, to red carpet premieres to award shows. I'm a ticket taker, usher, and various other duties that are strongly customer service based. My pay rate is $12/hr. \r\n\r\nEbisu, Funding Dept., Los Angeles, Ca 2015-2017\r\n-This is a loan company with 3 separate companies and I work for all of them. A week after being hired as a customer service representative, I was placed in the Funding Department. I am responsible for many important duties: I process applications for returning customers. I manage and discuss accounts. I set up pay offs, and update the system and speak directly with the bank to verify vital information. I talk to customers about their options and what is best for their individual needs. My pay rate is $11/hr (plus daily overtime).\r\n\r\nEarthbar, Barista/Cashier, Glendale, Ca. 2015\r\n-I made smoothies in a timely manner and provided exceptional customer service. I also worked the register and suggested  tinctures and supplements to customers. I was the top seller. My pay rate was $9.50/hr\r\n \r\nLucky Brand, Sales Associate, Hollywood, Ca 2014\r\n-I sold high-end clothing, shoes and accessories. I assisted in shipping/receiving. I provided exceptional customer service while building our clients wardrobe and suggesting products based on their individual preferences and needs. My pay rate was $10.50/hr. \r\n \r\nEnergy Source, Marketing/Customer Service,\r\nLos Angeles, Ca. 2013\r\n-I assisted in helping educate current customers on different plan options to lower their bills by switching to a lower priced supplier. My pay rate was $11/hr. \r\n\r\nSkills/Characteristics:\r\nI am a friendly, determined and motivated individual. When learning new things I will perform them to the best of my ability. I am persistent, hard working, detail oriented and reliable. I enjoy working alone as well with others. I have basic knowledge of computers and office type duties. I have the ability to motivate others. I contribute immensely to a positive environment. I also have my food handlers card. \r\n \r\nReferences:\r\nShona Myers \r\n(House Manager- Dolby Theatre)\r\n(323) 308-6332\r\nKenia Chacon \r\n(General Manager-Earthbar) \r\n(213) 675-1850","additionalInfo":"","contact":"Itzsophie16@aol.com","date":"2017-10-25T04:59:28.475Z"}