{"_id":"ae291b30-bdd6-11e7-b840-6d18dcdaf523","name":"Paul Kielty","resume_email":"psulkielty@aol.com","location":"Los Angelos","title":"Butender/Grower/ Trimmer","jobCategory":"Sales","references":"true","coverLetter":"Aloha\r\nI am very interested in coming to work for your collective. I have just recently relocated back to California from Hawaii to be closer to family. I am very excited to live in a state where Marijuana is legal and easily accessible. \r\nI have been a daily user for the past 20 years. Due to the fact that I have anxiety and had a severe surfing accident when I was younger and found the medicinal benefits of cannabis more effective than pharmaceutical drugs to manage my pain and anxiety issues. \r\nI have had  a quite a lot of  experience with growing, trimming, cloning, harvesting, distributing and quality control. I held a medical card in the state of Hawaii yet only recently did the legislature pass the bill for there to be medical dispensaries. So I cannot provide you with a reference for a traditional dispensary. I would be happy provide you with the name of the grower that I worked with on the big island.\r\nI am a very hard worker, I am always on time, and I have great customer services skills, and work well with all types of people. I have great listening and communication skills, I take direction well, and can follow directions, I work well with little or no supervision, and I am a quick learner and am the type of person that can jump right in. I have a strong work ethic and am a very loyal and dependable person. I am able to manage stressful situations and people with tact and ease.   I have worked with an array of clientele who require special assistance. \r\nI have a clean traffic abstract as well can pass a back round check. I have never had issues with the law.  My schedule is completely wide open and I am very flexible with scheduling and able to work all shifts.\r\nI would very much like the opportunity to schedule an interview so I can discuss in more detail why I feel like I would be a great fit for the position. Please let me know what else you might need. \r\n\r\nLooking forward to hearing back, thank you for your time and consideration.","experience":"Worked with special needs population both behavioral and medical (5 years in the field)\r\nSales  and Customer service 2 years\r\nWorked in the industry on a private grow operation on the Big Island for 4 years.","additionalInfo":"Im CPI CPR and First Aid certified, I am fluent with computers, I hold a Medical Marijuana Card","contact":"808-284-7723","date":"2017-10-31T00:59:00.533Z"}