{"_id":"6e580ff0-ba04-11e7-ae17-3908238d05e5","name":"Alisa","resume_email":"avinogray@gmail.com","location":"North hollywood, ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Hi, My name is Alisa Vinogray. I have been working in the weed industry for six years and I absolutely love it. I've worked as a receptionist for a medical marijuana doctor, I worked as a budtender, and I've also worked as a trimmer. I love working with people and am a great team player!","experience":"Receptionist/ Budtender                                                                                04/2016- Current\r\nUniversal Collective                                                                               Los Angeles, CA 90068\r\n3625 Cahuenga Blvd. W.                                                                 \r\n(323)850-1847\r\nMaintained a clean environment. In depth knowledge about marijuana, great customer service skills and marketing skills.\r\nReceptionist\r\nOrganic Medirex Consultations, LLC                                                            08/2015- 01/2016\r\n11335 W Magnolia Blvd 2D                                                       North Hollywood, CA 91601\r\n(818) 505-8805\r\nScheduled and confirmed patient appointments. Organized and maintained a clean, efficient, and confidential work area. Entered all patient information into computer database and file confidentially. Provided secretarial services such as copying, faxing, and filing. Tracked inventory of office and medical supplies, and placed orders when necessary. Called or emailed to confirm patient appointments. Updated patient records and ensured confidentiality\r\nReceptionist/Budtender\r\nNorth Hollywood Care Givers\r\n14770 Calvert Street                                                                                 02/2015--07/2015\r\n(818)902-2155                                                                                    Van Nuys, CA 91411\r\nCash handling experience. Performed duties as a receptionist. Worked in a very fast pace environment. Knowledge on the product that’s being sold.\r\nReceptionist/Budtender\r\nOrganic Life Collective                                                                             10/2014-02/2015\r\n7618 Louise Ave.                                                                          Lake Balboa, CA 91406","additionalInfo":"","contact":"8184418770","date":"2017-10-26T04:16:25.530Z","timestamp":1508991385}