{"_id":"4e8f5b90-d65d-11e7-920e-d53b2bdd726d","name":"Bridget Dominguez","email":"68af9e599b2a47b5190f2725b80809c4","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>Bridget Dominguez</p><p>3153 Grand Ave.</p><p>Walnut Park, CA 90255</p><p>(424) 645- 9475</p><p>b.dominguez17@yahoo.com</p><p>Dear hiring manager or employee,</p><p>I am writing to you in hopes to joining the crew/team. The position requirements and my skills are a perfect match.</p><p>I am a very strong, reliable worker for your crew. I try my best to meet the requirements and I never fail. I have exceptional work experience that has honed many skilled within my-self for an individual my age. I have gone to worlds end to show that I have the working spirit.</p><p>As you’ll see on my enclosed resume, I have the experience, and track record for which you are searching. In addition, I am motivated and enthusiastic, and would appreciate the opportunity to contribute to your crew success.</p><p>I can promise that meeting with me will not be a waste of your time and I will make myself available at your convenience, during or outside of normal business hours.</p><p>Sincerely,</p><p>Bridget Dominguez</p>","experience":"<p>Bridget Dominguez&nbsp;</p><p><br></p><p>Tele-Sales Dep. Supervisor - Skyline Security Management&nbsp;</p><p><br></p><p>Walnut Park, CA&nbsp;</p><p><br></p><p>b.dominguez17@yahoo.com&nbsp;</p><p><br></p><p>(424)645-9475&nbsp;</p><p><br></p><p>Seeking a full time job with a company offering growth potential and who is looking for a dedicated, hardworking,&nbsp;</p><p>detail oriented team player.&nbsp;</p><p>Willing to relocate: Anywhere&nbsp;</p><p>Authorized to work in the US for any employer&nbsp;</p><p><br></p><p><br></p><p>Work Experience&nbsp;</p><p><br></p><p>Tele-Sales Dep. Supervisor&nbsp;</p><p><br></p><p>Skyline Security Management -Downey, CA&nbsp;</p><p>July 2016 to November 2017&nbsp;</p><p><br></p><p>• Performed statistical analysis for each individual agent providing coaching to insure adherence to statement of&nbsp;</p><p>work.&nbsp;</p><p>• Developed process efficiencies to improve quality, moving my team's performance from 90% to 96.25%&nbsp;</p><p>• Manage, process, and review timesheets, payroll, and daily attendance of Call Center employees.&nbsp;</p><p>• Monitored and evaluated CSR performance to assure quality service, professionalism and courtesy, and identify&nbsp;</p><p>actions that can improve call quality and customer satisfaction.&nbsp;</p><p>Cooperate Administrator&nbsp;</p><p><br></p><p>Skyline Security Management -Downey, CA&nbsp;</p><p>May 2015 to July 2016&nbsp;</p><p><br></p><p>• Maintains customer confidence by keeping service information confidential.&nbsp;</p><p>• Documented service and installation actions by completing forms, reports, logs, and records.&nbsp;</p><p>• Maintains report with customers by examining complaints; identifying solutions; suggesting improved methods and&nbsp;</p><p>techniques; recommending system improvements.&nbsp;</p><p>• Perform daily system and collection balancing.&nbsp;</p><p>Service Dept. Greeter&nbsp;</p><p><br></p><p>Nissan of Van Nuys -Van Nuys, CA&nbsp;</p><p>August 2014 to May 2015&nbsp;</p><p><br></p><p>• Effectively took care of relevant paperwork.&nbsp;</p><p>• Kept up to date on changes in pricing, special programs, different deals, and campaigns.&nbsp;</p><p>• Advised customers regarding payment options, as well as the best recommendation for vehicles.&nbsp;</p><p>• Wrote effective customer proposals - Prepared sales contracts, proposals and presentations.&nbsp;</p><p>Education&nbsp;</p><p><br></p><p>Business&nbsp;</p><p><br></p><p>East Los Angeles College -South Gate, CA&nbsp;</p><p><br></p><p><br></p><p>2014 to 2016&nbsp;</p><p><br></p><p>Skills&nbsp;</p><p><br></p><p>40 wpm (Less than 1 year), filing (Less than 1 year), Receptionist (Less than 1 year), scanning (Less than 1 year),&nbsp;</p><p>Switchboard (Less than 1 year)&nbsp;</p><p><br></p><p>Additional Information&nbsp;</p><p><br></p><p>• Excellent communication and interpersonal skills&nbsp;</p><p>• Microsoft office skills (Word, excel, access, power point, )&nbsp;</p><p>• Some knowledge of QuickBooks&nbsp;</p><p>• Computer skills (Type 40 wpm, Office equipment, filing, scanning)&nbsp;</p><p>• Receptionist (Switchboard)&nbsp;</p><p><br></p>","additionalInfo":"","contact":"b.dominguez17@yahoo.com","date":"2017-12-01T06:03:10.061Z"}