{"_id":"e918de00-eb0e-11e7-a44f-935f90061bb7","name":"Rachel Caponera","poster_email":"rachel.caponera@gmail.com","location":"Portland OR","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>Hello!</p><p><br></p><p>My name is Rachel Caponera,  Originally From the Bay Area; All of my work experience will be located in California. Even though I don't have any dispensary experience I can say I have an abundant in customer service/ retail. I feel my range of jobs has helped me build the confidence in trying a new field of retail and customer service! I am a quick learner and excited to learn more about dispensaries and different products in a whole, but would like to use my experience to help your company grow financially in my own way. I do have my work permit as well for Oregon, can email upon request. Thank you for taking the time and looking over my application as a possible candidate for the open position!</p><p><br></p><p>Take care,</p><p>Rachel C</p>","experience":"<p><strong>.:Rachel Caponera:.</strong></p><p><a href=\"tel:510-%20422-7218\" target=\"_blank\"><strong>510- 422-7218</strong></a></p><p><a href=\"mailto:rachel.caponera@gmail.com\" target=\"_blank\"><u>rachel.caponera@gmail.com</u></a></p><p><br></p><p><br></p><p><br></p><p><strong>QUALIFICATIONS</strong></p><p>·Extended customer service experience</p><p>·Excellent communication and people skills</p><p>·Manager on duty</p><p>·Quality over the phone etiquette</p><p>·Highly experienced in MS Office</p><p>·Flexible/Open hours</p><p>·Ability to multi task</p><p>·Key holder</p><p><br></p><p><br></p><p><strong>WORK EXPERIENCE</strong></p><p><br></p><p><br></p><p><strong>Task Rabbit</strong>, San Francisco/East Bay CA (Alameda, Berkeley, Danville, Oakland, Walnut Creek)- October 2015/October 2017; Assisting clients with the task they are requesting through the Task Rabbit platform. Tasks include, delivery, laundry, light cleaning, errands such as pick up for customers groceries, painting interior walls.</p><p><br></p><p><strong>L'Occitane en Provence,&nbsp;&nbsp;</strong>San Francisco CA- April 2017/ August 2017; Manager on Duty/ Beauty Advisor, Opening manager duties such as, set day plans and goals, check store emails, tell other beauty advisor about the day and goals, greet guests, assist guest with questions on the L'Occitane product, advise guests and measure their skin type, sign up memberships with the VIP program, closing manager duties such as, check goals, check emails, clean store, close registers, start new day plan for the next day, lock up shop, bag check.&nbsp;</p><p><br></p><p><strong>Legion of Honor&nbsp;and DeYoung Fine Arts Museums</strong>,&nbsp;San Francisco CA- October 2016/ January 2017; Sales Associate, greeting guest, provide as much information as possible to guests about the museums and San Francisco Bay area History, Membership Sales, Assist guest through the stores if needed.</p><p><br></p><p><strong>USS Hornet Museum</strong>, Alameda CA- March 2016/ October 2016; Sales Associate and Admissions desk, greeting guest, providing any answers to questions guests may have about the museum, admission and sales. Customer service and sales in Museum store, for product and membership sales. POS trained.</p><p><br></p><p><strong>FOX Rent a Car</strong>, Oakland CA- July 2015/December 2015; Rental Agent, Greet guest, assist any of their needs with the company vehicles, adjust and/or exchange contracts.</p><p><br></p><p><strong>Executive Hotel Vintage Court</strong>, San Francisco CA- February 2015/ June 2015; front desk guest services, greet guest, assign/edit room reservations, assist with any of the guests needs with their stay at the hotel.</p><p><br></p><p><strong>Cotton basics</strong>, San Francisco- April 2014/December 2014; clothing boutique, key holder, POS trained, opening and closing the day/register, greeting guests, cleaning the floor and fitting rooms.</p><p><br></p><p><strong>Chicha Bistro</strong>, Alameda- July 2013/August 2014; cashier, hostess, serving guests and placing orders, placing phone orders, managing/updating menu files, greeting guests.</p><p><br></p><p><strong>VOLUNTEER EXPERIENCE</strong></p><p>Oakland Museum of California- 2014 Gold Rush Docent, Tour guide for elementary school field trips presenting information in the history gallery</p><p><br></p><p>Reading Partners SF; Tutoring and assisting elementary school children with obtaining more reading skills</p><p>Santa Rosa Humane Society &amp; SPCA- Santa Rosa, CA; Cleaning cages and feeding animals, walking dogs, socializing cats, assisting at the help desk</p><p><br></p><p><br></p><p><strong>EDUCATION&nbsp;</strong>- Bay Area School of Enterprise 2007- 2011</p>","additionalInfo":"","contact":"rachel.caponera@gmail.com","date":"2017-12-27T14:04:53.523Z"}