{"_id":"b36a76e0-bb31-11e7-b26f-fbe946111632","name":"Tianna Wainwright","resume_email":"Tiannareneew@Gmail.com","location":"Los Angeles, ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Hello, my name is Tianna and I believe I would be a great asset to your company. I have a lot of knowledge in the Marijuana industry with 4+ years of experience. I’ve held various different positions:  Inventory specialist, budtending, shift leading and  managing. I’ve worked with small independant dispensaries, to larger franchise shops.  I'm very self-motivated, goal oriented and am always striving to be the best. I am always looking to grow within the company and give 110% to my job.  I also believe that I bring a positive energy along in any situation that I involve myself in. Below I have listed my most relevant positions and I hope that you’ll consider me when making your decision. Thank you and I'll look forward to hearing from you soon.","experience":"H.O.C, Inglewood — Manager \r\nDecember 2016 - July 2017\r\n\r\nManaged a team of 15+  in a retail environment\r\nTrained new volunteers \r\nMaintained operational efficiency with proactive oversight and corrections \r\nSet sales goals and ensured staff met set quotas\r\nImplemented policies and made sure store was running up to company standard. \r\nPerformed inventory twice a week to calculate store retention.\r\nCash handling upwards of 25k daily\r\nPayroll, paying vendors and intake of all new product \r\nRecruitment of new volunteers \r\n\r\nMost Wanted Collective, South Central — Budtender \r\nOctober 2014- October 2016\r\n\r\nWorked 50 hours a weeks\r\nMade deliveries to celebrity clientele\r\nServed patients and provided thorough product knowledge based on specific needs\r\nMaintained a clean environment \r\nBlunt and joint rolling\r\n\r\nKush n’ Wax Connection, East La — Inventory Specialist\r\nJune 2013 - July 2014\r\n\r\nKept log of all product in and out take \r\nRolled blunts, joints, cones etc\r\nProvided bud tenders with all necessary products \r\nJarred up all concentrates and flower straight from the pound\r\nKept log of every pound and ounce of wax straight from the vendor \r\nNightly and morning inventory count of all products in the shop \r\nWashing and sanitary maintenance for all smoking supplies","additionalInfo":"","contact":"You can contact me via phone: (626) 461-2026 or email: tiannareneew@gmail.com","date":"2017-10-27T16:13:00.122Z","timestamp":1509120780}