{"_id":"4857c4e0-bf2b-11e7-9c26-335bfbd926db","name":"Luis Serna","resume_email":"spdd49@gmail.com","location":"Riverside, Ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"My name is Luis Serna and I am looking to get my foot in the MMJ Industry. I feel that I would be a great addition to your team because I have years of retail and management experience. I have a military background and have worked 1 year for myself when I was unable to find work myself. Whether if it is in a BJJ competition or driving results for a business I love to work with a passion. I work with a passion because it allows me to connect with all around me with good vibes, great relations and amazing customer service treating everyone like family.","experience":"LandCare, Riverside - Landscape Crew Member\r\nMarch 2017- PRESENT\r\nMaintains grounds of industrial, commercial, and public property and\r\nperforms other installation and enhancement activities.\r\n\r\nAdvanced Car Stereo - Store Manager\r\nJanuary 2013 - February 2017\r\nIn a driven retail sales environment great customer service and\r\ncustomer satisfaction was priority within the establishment.\r\nsupervising, training, monitoring the financial aspect of the store,\r\nhiring, loss prevention, advertising, online marketing, inventory\r\nmanagement, website data entry, and having overall store operations\r\nproductive and efficient.\r\n\r\nAmerican Detail - Owner\r\nJanuary 2012 - October 2012\r\nA mobile detailing company providing car washing and premium\r\ndetailing services to clients.\r\n\r\nIntel Analyst- USAR\r\n35F Intelligence Analyst for the United States Army Reserve. Duties\r\nalong with being a soldier first are to prepare all intelligence products to\r\nsupport combat commander. Information security (INFOSEC), analyzing\r\ninformation holdings to determine changes in enemy capabilities,\r\nvulnerabilities and probable courses of action.","additionalInfo":"Proficient computer\r\nknowledge and software such\r\nas Excel, Word, and\r\nPowerpoint.\r\n70 accurate WPM typing speed\r\nImmaculate customer service \r\nLoss Prevention\r\nRetail Sales\r\nDriving Results\r\nInventory Management\r\nLeading by Example","contact":"spdd49@gmail.com","date":"2017-11-01T17:37:07.953Z"}