{"_id":"35f073f0-e637-11e7-b3ff-335e77101dd7","name":"Shalin Miller","poster_email":"Nowliving2010@yahoo.com","location":"Portland, Oregon","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>My name is Shalin, and out of everything that I am, I'm most avidly known for being a family man, and an student of the marijuana plant. Its healing and meditational properties has always astounded me at a young age; and I knew that it would always be a part of my life. Before anything else, I was a faithful smoker, and then I started trimming for a big farm in Estacada. After working there for 2 months, and cutting an average of at least a pound a day, I started trimming for a personal grower; that I met on the Estacada farm. This allowed me to gain the experience, and the money, I needed so that I was able to earn and pay for my Oregon Marijuana Workers Permit. Shortly after that I began my budtender journey at Happy Leaf dispensary, and learned more about Cannabis then I ever thought possible. Even though it was the greatest job I ever had, management was a little unstable, and I knew that I wasn't being fully utilized. I felt my dedication to the company was completely unnoticed, and for being the highest seller for 3 months straight, it really hurt; and also at the time my grandmother asked me to return to be her caregiver, because she was getting ill again. So I talked to the manager, and after our conversation, I put in my two week notice, and have been taking care of her ever since. Recently my grandmother has started to regain her health, and I got way more help with her now; so I wanted to regain my position in the dispensary business, somewhere else, somewhere I can show fully flourish, as a experienced budtender.</p>","experience":"<h3><br></h3><h3>Skills</h3><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I can type at least 60wpm</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Caregiving and first aid experience</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I can trim a pound of bud and a half in a 9hour period</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Have firsthand knowledge of anything to do with cannabis, and worked in almost every field available to me that has to do with marijuana</p><p>•Customer-oriented</p><p>Quick learner, organized multi-tasker, Able to lift [75+] pounds, Friendly and helpful, Late-night shift availability, Payment processing, Inventory management, Good with numbers and math, Fast and efficient service worker, Accustomed to shift work, Restaurant operations, Dedicated team player, Multi-tasking ability, Computer proficiency, Good telephone etiquette.</p><h2><strong><em><u>    experienced budtender, grower, caregiver, &amp; trimmer | Nowliving2010@yahoo.com</u></em></strong></h2><h2><strong><em><u> (971)804-6185</u></em></strong></h2><ul><li>  Budtender • happy leaf •February 2017 - June 2017</li></ul><p>My responsibility was to open shop at 8 am. Then it was to stock all the products that was going to be available for that evening. Then we did a swift cleaning of the shop before we opened the doors to the public. Then after the shop was opened, I signed into my bio-tracker profile and then I proceeded to help patients. I had the responsibility to learn about all the products in the shop extensively. &nbsp;I efficiently learned about everything that had to do with the dispensary, and proceeded to be the highest seller for 3 of the 5 months that I was there. I know how differentiate between quality and defective products; and how to test and exchange oil cartridges. I frequently made bank runs to make change or get more money for the shop. Next was the closing of the shop procedures. I completed nightly inventories numerous of times, cleaned the whole building, and safely secured the dispensary before I went home and did it all again the next day.</p><h4><br></h4><ul><li>Caregiving • Personal •September 2007– Current</li></ul><p>I am responsible for my grandmother’s primary care, case management, and medication management. I evaluate her care needs, prioritized treatment, and maintained patient flow. I also authorized and transported drug refills, and provided detailed prescription information to pharmacies. I take the job to assess her and document her medical histories.</p><h3><br></h3><h3><strong><em><u>Education</u></em></strong></h3><h4>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ged • November 2007 • Oregon coast community college</h4><h4>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Marijuana worker permit </h4><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>CPR and First Aid</strong></p><p><br></p><h3>&nbsp;</h3><p>  </p>","additionalInfo":"<p>My name is Shalin, and out of everything that I am, I'm most avidly known for being a family man, and an student of the marijuana plant. Its healing and meditational properties has always astounded me at a young age; and I knew that it would always be a part of my life. Before anything else, I was a faithful smoker, and then I started trimming for a big farm in Estacada. After working there for 2 months, and cutting an average of at least a pound a day, I started trimming for a personal grower; that I met on the Estacada farm. This allowed me to gain the experience, and the money, I needed so that I was able to earn and pay for my Oregon Marijuana Workers Permit. Shortly after that I began my budtender journey at Happy Leaf dispensary, and learned more about Cannabis then I ever thought possible. Even though it was the greatest job I ever had, management was a little unstable, and I knew that I wasn't being fully utilized. I felt my dedication to the company was completely unnoticed, and for being the highest seller for 3 months straight, it really hurt; and also at the time my grandmother asked me to return to be her caregiver, because she was getting ill again. So I talked to the manager, and after our conversation, I put in my two week notice, and have been taking care of her ever since. Recently my grandmother has started to regain her health, and I got way more help with her now; so I wanted to regain my position in the dispensary business, somewhere else, somewhere I can show fully flourish, as a experienced budtender.</p>","contact":"nowliving2010@yahoo.com","date":"2017-12-21T10:10:46.505Z"}