{"_id":"0d78f630-d648-11e7-920e-d53b2bdd726d","name":"Tyree Pitts","email":"2513469b28fba52d22fef96206bb159f","location":"Los Angeles","title":"Budtender","jobCategory":"Grow","references":"true","coverLetter":"<p>&nbsp;I enjoy&nbsp;gardening&nbsp;as&nbsp;it&nbsp;is&nbsp;the&nbsp;best&nbsp;way&nbsp;for&nbsp;humans&nbsp;to&nbsp;get&nbsp;proper&nbsp;food&nbsp;and&nbsp;nutrition.&nbsp;The&nbsp;process helps&nbsp;me&nbsp;establish&nbsp;an&nbsp;efficient&nbsp;process&nbsp;and&nbsp;routine,&nbsp;which&nbsp;keeps&nbsp;me&nbsp;organized&nbsp;daily.</p><p><span style=\"color: rgb(0, 0, 0);\">My knowledge about strains is good from being a Long time patient myself but mostly from my own experience working with cannabis plants. I have a great sense of compassion for all walks of life and would be honored to serve the medical marijuana community. Helping patients with diseases and various ailments find products/strains that improve the quality of their daily life is something I know I could be great at. Helping others has been a lifelong practice for me and I feel strongly about cannabis’ healing capabilities. In addition to these things, I have great organizational skills and am extremely punctual. Operating my own small grow and working up north has helped me understand the passion and discipline this business requires, and I would like to be able to carry these tools to a dispensary. A majority of my previous work experience has been farming with cannabis plants and a various vegetables and herbs . I had a couple brief customer service jobs when I was living on the east coast so I know I would be comfortable greeting/conversing with patients and following the tasks given by management. I have basic computer skills.&nbsp;</span></p>","experience":"<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>Lady&nbsp;Jade’s</p><p>Farmer</p><p>I&nbsp;was&nbsp;head&nbsp;farmer/consultant.&nbsp;My&nbsp;duties&nbsp;included&nbsp;properly&nbsp;tending&nbsp;to&nbsp;each&nbsp;plant&nbsp;and&nbsp;making sure&nbsp;the&nbsp;grounds&nbsp;were&nbsp;well&nbsp;kept.&nbsp;It&nbsp;was&nbsp;my&nbsp;responsibility&nbsp;to&nbsp;assure&nbsp;there&nbsp;was&nbsp;sufficient&nbsp;water and&nbsp;supplies&nbsp;each&nbsp;week.&nbsp;I&nbsp;also&nbsp;found&nbsp;and&nbsp;trained&nbsp;additional&nbsp;workers&nbsp;upon&nbsp;arriving.</p><p>community &nbsp;Grown&nbsp;Agriculture&nbsp;Products&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>&nbsp;&nbsp;Los&nbsp;Angeles,&nbsp;California Owner/Herbalist&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;October&nbsp;2017- I&nbsp;created&nbsp;supplements&nbsp;to&nbsp;nourish&nbsp;and&nbsp;feed&nbsp;microbiology&nbsp;in&nbsp;both&nbsp;the&nbsp;soil&nbsp;and&nbsp;human&nbsp;body. Also worked with living soil practing organic methods </p><p><br></p>","additionalInfo":"","contact":"Tyreenafees@gmail.com","date":"2017-12-01T03:31:01.407Z"}