{"_id":"b2235e60-c0b7-11e7-aa67-3596880d4b81","name":"Zach Heitmann","resume_email":"Zachheitmann@gmail.com","location":"Los Angeles","title":"Part of the crew","jobCategory":"Sales","references":"true","coverLetter":"Dear Director of Human Resources: \r\n\r\nI am confident that my significant career is a perfect match for your needs and I am ready to deliver immediate and long lasting results with he company. With five years of experience in the cannabis industry, I have extensive experience in all areas from production (flower and soil to oil extraction), packaging and sales. Prior to moving to California, I was producing small grow operations\r\nand decided to come out to Los Angeles and pursue my passion in a more legal manner. I spent my first year working inside of a storefront called GCC off of Van Nuys. During my time at GCC, I learned different techniques and skills inside the grow opp and I worked as a a Budtender. In my free time, I crafted the art of making extractions and branded myself, which resulted in the creation of my own extraction company \"Pirate Extracts\". I was able to sell my Extracts to various dispensaries, which showcases my ability as both a salesman and an entrepreneur. Due to my current living situation, I, unfortunately, can no longer make extractions, because I no longer have a lab area to work in. In the meantime I have been helping friends set up some operations throughout Nevada and now am back in LA. I am currently looking for a company to hire me and make me part of their team because I truly have a passion for the Cannabis Industry and I don't want to let my passion and skill set go to waste. \r\n\r\nSincerely interested in furthering exploring this opportunity, hopefully we can sit down where we can discuss your needs and my background in detail. Until then, thank you for your consideration.\r\nSincerely, \r\nZachary Heitmann","experience":"Zachary L. Heitmann\r\n914 S. Wooster Street, Los Angeles, CA 90035  • zachheitmann@gmail.com • 239-682-7395  \r\n\r\n— Professional Experience —\r\nPirate Extracts – Los Angeles, CA Extract Artist, 1/2014 to Present\r\nInstagram: pirate_extracts  Create batches of numerous concentrates and edibles starting from soil to oil. Experience working with grow environment through production process. Prepare products to be packaged and distributed. Work on in-shop demos as well as all sales through Los Angeles, San Fernando Valley, and the Inland Empire. Devise marketing strategy for the Company. Create and maintain all social media outlets for Company, most notably the Instagram account. \r\n\r\nGreen Cross Collective – Los Angeles, CA \r\nBudtender/Back of the House, 1/2013 to 5/2015\r\n\r\nWorked behind storefront counter and took patient orders. Informed patients about different types of strains and the\r\neffects of each strain. Collaborated with patients to make informed decisions about their purchases. Checked patients\r\nDoctor Recommendation and Identification cards and helped with check in. Assisted in the back room by helping trim \r\nand maintain plants. Watered and examined PH levels of plants. Monitored temperature and humidity levels and \r\nchecked for any potential problems that needed tending to. Trimmed final flower for packaging. \r\n\r\n— Relevant Skills —\r\nHighly experienced in production and sales \r\nExtremely knowledgeable about strains of marijuana and their physical/mental effects    \r\nEfficient with social media, i.e. Facebook, Twitter, Snapchat, Instagram, Google+\r\n\r\n— Educational Background —\r\nAssociates of Arts, Marketing\r\nLos Angeles Valley College, 2017","additionalInfo":"I have been working behind the scenes as well as on the front line for the past five years and have obtained or source for knowledge and let's go get it attitude Who would be a great asset to the company.","contact":"Zachheitmann@gmail.com","date":"2017-11-03T16:54:46.266Z"}