{"_id":"1e0f1e40-c0cf-11e7-aa67-3596880d4b81","name":"Ceasar guerrero","resume_email":"Ceasar.guerrero@gmail.com","location":"Van nuys ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"Hello my name is ceasar, im a dedicated hardworking individual who has always had an interest in cannabis since childhood. Iv always done my best to read and learn about cannabis. Iv even grown my own plant and made shatter before. What makes me standout above the rest is that i have 7 years of retail and customer service experience. Iv always had great customer service skill and like to give each person that comes in an unforgettable experience so that they will come back again. Hopefully i can hear from you soon.","experience":"Dollar Tree |Cashier/Stock\r\nBell Gardens, CA, June 2013 – October 2013\r\nHandled front cash register, while giving customers a great checking out experience. Also recovered stores sales floor quickly and efficiently while keeping a smile. Learned to multi-task with great quality and speed to keep up with store demands.\r\n\r\nWSS Shoe Warehouse |Sales Associate\r\nSouth Gate, CA, November 2013 – July 2014\r\nQuickly and effectively helped grab shoes in back stock for customers with a positive attitude. Learned how to communicate with all types of customers in a professional friendly manner. Also cleaned up sales floor at the end of closing shifts for next sales day.\r\nMarshalls |Sales Associate\r\nBell Gardens, CA, August 2014 – February 2015\r\nOrganized and laid out new merchandise onto the sales floor while assisting all customers who needed help throughout the store. Also learned to work in a fast paced environment with great quality service.\r\nGraphic Trends Warehouse | Shipping/Packaging\r\nParamount, CA, June 2015 – September 2015\r\nProduced shipment packages while following all safety procedures for next day loading. Also helped on loading docks to ship boxes. Cut material to help produce more products and assembling stands. Learned how to think creatively with a positive attitude.\r\nMacys beverly center -sales associate \r\nBeverly hills, CA agaust 2016 - currently employed \r\nGive each customer outstanding service and provide a personal touch in order to ensure returning business. Mantaining a clean and neat work environment threwout the day.","additionalInfo":"","contact":"Ceasar.guerrero@gmail.com","date":"2017-11-03T19:42:25.772Z"}