{"_id":"6e9c18d0-d787-11e7-b491-f5bcdd8c8c37","name":"Aliah Peoples","email":"Aliahdishae@gmail.com","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>My name is Aliah Peoples and I am seeking a full time position with a reputable company who prides themselves on the conduct of good business. I am goal oriented, customer focused, and driven towards results. I can effectively communicate with all personality types. I am a self started and have a very strong work ethic. I am dedicated to excellence, and would love an opportunity to work for the best company in the world! </p>","experience":"<p>WSS&nbsp;| 1600 W 7th street, Los Angeles Ca&nbsp;</p><p>Current employer</p><p>Asset Protection</p><p><br></p><p>Greeting guests, providing top quality customer service, guarding entrances/exits, reducing store pilferage, preventing physical harm to myself and other guests and or employees by disengaging and diffusing situations in a quick nd professional manner. Quickly Detecting suspicious activity/suspicious behavior and or indicators, memorizing detail regarding&nbsp;robberies and or incidents of theft for LAPD booking, making apprhensions on minors &amp; or adults. Sending out paperwork regarding inventory and daily loss, and weekly pilferage. Handling exchanges, maintaining a clean welcome friendly workplace. Providing an extra hand to fellow floor workers. Maintaining the fitting room assisting customers with any other sizes in fitting.Remaining detail oriented and focused throughout the shift to detect internal theft from employees and or external theft from a guest.&nbsp;</p><p><br></p><p>Forever 21 Logistics | 3880 N mission Rd, Los Angeles Ca</p><p><br></p><p>Inventory specialist/Auditor&nbsp;</p><p><br></p><p>Rotating Inventory merchandise, creating Lpns, locations. Fixing and finding problems handlings singles and quantities. Rebagging all ripped, damaged clothing. Editing, deleting, and tracking/locating inventory of active,lost, and invalid cartons containing merchandise. Replacing damaged/missing skus. Responsible for auditing and editing submitting daily inventory RSR/PSR/ STS reports.Returns, returning merch to proper location and cartons and retrieving any damaged/ lost/ invalid pieces.&nbsp;</p><p><br></p><p><br></p><p>Dickeys barbecue pit | 9035 reseda blvd, Northridge Ca&nbsp;</p><p><br></p><p>Server|Cashier</p><p><br></p><p>Cashier Customer service, Taking and running orders, bussing tables.prepping and rubbing meats ( pulled pork, brisket, ribs, chicken, sausage etc) Temping poultry and slow cooked meat products. Portions, selling product, prepping vegetables and pantry sides, Maintaining clean salsa bar, Cashier stations, prep stations, beverage area and restaurant tables booths, and bathrooms. Handling cash, credit, and debit transactions. Counting out drawers, ordering produce, stock.Organizing large catering orders.</p><p><br></p><p>Chuck E Cheese |9601 Fairway Drive, Roseville, CA&nbsp;</p><p>Cashier/ Party Host&nbsp;&nbsp;</p><p><br></p><p>Assisted guest in a proactive quick manner. Handled payments and transactions. Process credit card and check payments. Perform the duties of customer service representative when required, Assist in stocking shelves, rotating merchandise and marking prices. Guiding guests to their tables. Hosted party events, bussed tables and ran orders. Handled and served food and beverages.&nbsp;</p><p><br></p><p>Sola Salon Hair Solutions&nbsp;| 1850 Sierra Gardens Dr Roseville, Ca</p><p>Cashier/Salon Assistant&nbsp;</p><p>&nbsp;Handled customer service, took orders in person and over the phone. Received and disburse transactions involving credit, debit, and validating checks. Planning and organizing events, such as birthday parties, business events, and social gatherings. Working together as a team, behaving professionally, providing great service to the guests. Able to analyze situations, problem solve, exercise sound judgment and make effective decisions. Positive attitude, friendly and upbeat personality. Good interpersonal skills, including professionalism in dealing with team members, the public.</p><p><br></p><p><br></p><p><br></p><p>SKILLS</p><p>Interpersonal Communication</p><p>Outstanding Customer Service</p><p>Fast Learner</p><p>Multi-tasking Skills</p><p>Strong work ethic&nbsp;</p><p><br></p>","additionalInfo":"<ul><li>WSS</li></ul><p>          July2017/current employer</p><ul><li>Forever 21 Logistics Sep2016/June/2017</li><li>Dickey’s BBQ</li></ul><p>            May2016/Nov2016</p><ul><li>Chuck E Cheese </li></ul><p>            2013/2015</p>","contact":"Aliahdishae@gmail.com","date":"2017-12-02T17:37:13.829Z"}