{"_id":"3c972e40-d6a8-11e7-920e-d53b2bdd726d","name":"John Koster","email":"9eab045600dde4a9136aede22ebda097","location":"Portland, OR","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>Dear Recruitment Representative:</p><p><br></p><p>Thank you very much for the opportunity to submit this letter and the accompanying resume for your consideration regarding the budtender position advertised on Craigslist.&nbsp;I am an experienced professional seeking to parlay my customer service experience into a career in the fast-growing cannabis industry, and I think your business looks like a wonderful place to start.</p><p><br></p><p>As my resume shows, I began my service career at Starbucks, gaining valuable experience and training from an industry leader of customer experience standards.&nbsp;I learned that serving and anticipating the needs of a customer are strengths of mine, and gained experience on a state-of-the-art point of sale system and all of the administrative tasks that are needed to run a busy storefront.&nbsp;My career turned towards the legal field for a few years, but retained my connection to the customer and meticulous attention to detail as a client relationship liaison.&nbsp;Eventually I returned to the service field again as a beer promoter, which involved direct interaction, connection, education and assistance.&nbsp;My work required knowledge and adherence to strict laws and regulations governing the service of alcohol to the public.&nbsp;I have already familiarized myself with the regulations of the cannabis industry, by obtaining by OLCC Marijuana Worker Permit.&nbsp;I am eager to get back to making connections and ensuring the best customer impressions and experiences. </p><p><br></p><p>I have spent a few years working in the legal field as a patent paralegal and client relationship liaison, which has provided me with a few skills that I think will be useful for this position.&nbsp;Most importantly, I’ve learned to communicate effectively across diverse audiences and a range of technical, legal and corporate topics with ease.&nbsp;I’ve also honed many organizational and professional habits that I think could benefit the background administration of the storefront.&nbsp;I’m very proficient with computer applications, communication systems, and have learned to support activities with the aid of spreadsheets, databases and other collaboration tools.</p><p><br></p><p>For me, one of the most important aspects of excellent customer service is the ability to make and maintain a connection while the customer explores options and suggestions to make the best decision.&nbsp;My volunteer experience and my recent participation as a team member in a sailing race across the Atlantic Ocean have taught me how to connect and collaborate with absolutely anyone, regardless of age, background, interest or attitude.&nbsp;They also demonstrate my ability to self-motivate outside of my comfort zone, and to expand my horizons to meet new challenges as they arise.</p><p><br></p><p>I think I’d make a great addition to your team, and I look forward to learning more about the position.&nbsp;Many thanks for your kind consideration!</p><p><br></p><p>Warm regards,</p><p>Jake Koster</p>","experience":"<ul><li>\"Beer Explorer\" (Promoter) - All About Beer, March 2017-August 2017</li><li>Barista - Starbucks Coffee Co., October 2003-August 2006</li><li>Patent Paralegal/Client Relationship Liaison - LeClairRyan/SKGF - October 2010 - August 2017</li></ul>","additionalInfo":"<ul><li>Established and led a national organization for students and professionals in the health fields. (June 2013 - July 2017)</li><li>Participated as a crew member in a sailing race across the Atlantic Ocean. (August 2017 - October 2017)</li></ul>","contact":"jake.koster@gmail.com","date":"2017-12-01T14:59:32.155Z"}