{"_id":"a9dabe50-e075-11e7-8a64-79051c54fa43","name":"Roxana Jimenez","poster_email":"r.jimenez1@lafilm.edu","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>To Whom It May Concern,</p><p>I am a hard-working and determined professional seeking an opportunity to</p><p>succeed in a dynamic company such as yours. I am confident that my</p><p>knowledge, ability and experience allow me to deliver successful results for</p><p>any company in a range of administrative positions</p><p>Please allow me to highlight my key skills:</p><p>- Able to effectively manage my time through careful planning and</p><p>organization of work activities</p><p>-An aptitude for identifying and resolving problems efficiently</p><p>-Excellent communication skills that result in positive interpersonal</p><p>relationships</p><p>-A track record of meeting deadlines and producing accurate work of a</p><p>high standard</p><p>-Proven ability to make sound decisions based on valid information</p><p>-The capacity to learn and apply new information quickly and accurately</p><p>I am convinced that I can be an asset in any position requiring hard work,</p><p>enthusiasm and reliability and I look forward to hearing from you in the near</p><p>future.</p><p>Thank you for your time and consideration. Sincerely, Roxana Jimenez</p><p>Sincerely,</p><p>Roxana Jimenez</p>","experience":"<p>Los Angeles County Registrar-Recorder Office, Los Angeles, CA</p><p>Presidential Election Poll Worker Nov 2016</p><p>-Assist inspection team members in polling booth location selection and other logistical matters.-Provide</p><p>assistance with voter registration paperwork and sign-in.-Assist new voters at polling table as necessary.</p><p>Pacific Park, Santa Monica, CA</p><p>Food and Beverage Attendant (Seasonal) 07.2016-09.2016</p><p>- To maintain up to date knowledge on the current services that are being offered and make sure that</p><p>this information is conveyed to the customers in an effective way - Accomplishes customer service and</p><p>organization mission by completing related results as needed. - Greet customers as they arrive in the</p><p>store and provide them with information regarding products and/or services - Respond to customers’</p><p>complaints and take necessary actions resolve their issues -Take payment in exchange of items sold -</p><p>Responsible for taking money in the form of cash, check, or credit card from patrons in exchange for</p><p>food or services. - Scans items, provides change, balances drawer, and processes card transactions</p><p>National Research Group, Los Angeles, CA</p><p>Screening Staff 5.2016–12.16</p><p>- Variety of tasks which include audience check-in and seating, handing out and collecting</p><p>questionnaires and filmmaker/studio executive customer service</p><p>Smashburger: L.A. Live, Los Angeles, CA</p><p>Guest Service Associate/ Cashier (Seasonal) 01.2016-06.2016</p><p>– To maintain up to date knowledge on the current services that are being offered and make sure that</p><p>this information is conveyed to the customers in an effective way - Accomplishes customer service and</p><p>organization mission by completing related results as needed. - Greet customers as they arrive in the</p><p>store and provide them with information regarding products and/or services - Respond to customers’</p><p>complaints and take necessary actions resolve their issues - Take payment in exchange of items sold -</p><p>Responsible for taking money in the form of cash, check, or credit card from patrons in exchange for</p><p>food or services. Scans items, provides change, balances drawer, and processes card transactions.</p><p>Cirque Du Soleil Presents KURIOS L.A. Dodger Stadium, CA</p><p>Food and Beverage Attendant 11.15–2.16</p><p>– Responsible for taking money in the form of cash, check, or credit card from patrons in exchange for</p><p>food or services. - Scans items, provides change, balances drawer, and processes card transactions. -</p><p>Work with customer service manager to ensure proper customer service is being delivered.</p><p>ROSS Stores, Los Angeles, CA</p><p>Retail Associate (Seasonal) 03.2015-06.2015</p><p>- Greeted customers and determined their needs and wants - Discussed type, quality and number of</p><p>merchandise required for purchase - Recommended merchandise based on individual requirements -</p><p>Provided advice to clients regarding particular products or services - Explained the use and advantage of</p><p>merchandise to customers</p>","additionalInfo":"","contact":"2139094927","date":"2017-12-14T02:22:42.789Z"}