{"_id":"1b69ece0-d6de-11e7-920e-d53b2bdd726d","name":"Anthony Alexander Ordonez","email":"bc3169c936699eb1d61990a12055efa9","location":"Los Angeles, CA.","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>I feel that I'm a top candidate because of my previous work experience which required attention to detail, and being as fast and efficient as possible. I'm a quick learner. Don't mind getting dirty. Eager for overtime hours. I'm a team player, and I can work with minimal to know supervision when taught what to do.  I've done sales and warehouse positions. </p>","experience":"<p>Feb-2015-​ ​Nov-2017</p><p>VALFRE - Los Angeles, Ca</p><p>Stock Manager</p><p>Responsible for all the inventory for the online store, receiving and shipping custom orders and wholesale</p><p>orders, managed receiving inventory and quality checking, and much more.</p><p>Sept​ ​2011-​ ​Aug-2014</p><p><br></p><p>Verizon Wireless Los Angeles, Ca</p><p>Sales Representative</p><p>Handled wireless phone and contract set ups and plan adjustments, light data entry and dealt with heavy</p><p>customer service concerns, all while establishing a strong clientele base to exceed sales goals.</p><p>May​ ​2010​ ​-​ ​Feb​ ​2011</p><p><br></p><p>Urban Showroom- California Mart, Downtown Los Angeles</p><p>Showroom Assistant</p><p>Inputting new clients into the system, making appointments while answering a heavy phone line, processed</p><p>daily shipments while assisting the sales rep and handled light bookkeeping.</p><p>November​ ​2008-​ ​March​ ​2010</p><p><br></p><p>Pro International Security Team Glendale, Ca</p><p>Security Guard</p><p>Provided excellent customer service at all times while making sure the perimeter was safe and secure.</p><p>References</p><p>Available upon request</p>","additionalInfo":"<p>I'm familiar with the process that's required of the position. Feel free to contact me at anytime 424-285-9988 Anthony. </p>","contact":"Thatsao87@gmail.com","date":"2017-12-01T21:25:09.329Z"}