{"_id":"b4250670-c196-11e7-9e46-b5bbe069e7d2","name":"Kamie Potter","resume_email":"kamiekablammy@gmail.com","location":"Long Beach","title":"Delivery, Budtender, Trimmer","jobCategory":"Other","references":"true","coverLetter":"Hi there! My name is Kamie and I’m very interested in working in the booming cannabis industry. I'm mostly interested in delivery, but I can do anything. I’m happy and bubbly, always five minutes early, I stay calm and positive under pressure, and I’m an honest hard worker. I have a workable knowledge of cannabis. I am familiar with different strains, weight amounts and conversions, rolling joints, the process of dabbing, portable vaporizing, and proper dosage with edibles. I’ve been a part of indoor and outdoor grow operations and I have spent around a bajillion hours trimming.","experience":"Delivery Driver, LA Café, Los Angeles CA            April 2015 - July 2017\r\n\r\nEnsuring customers received their food in a timely manner, defensive driving, long hours behind the wheel, resolving any conflicts as they arose, and ensuring customer satisfaction, helping keep the restaurant clean, serving, handling money and closing checks, and assisted in expediting.\r\n\r\n \r\n\r\nCo-Manager, Divine Yoga Studio, New Orleans LA         March 2013 - April 2015\r\n\r\nI was responsible for holding people accountable, keeping the space spotless, coordinating the daily schedule, and creating a positive and welcoming environment for guests.\r\n\r\n \r\n\r\nServer, Ninja New York, New York NY                  September 2011- December 2012\r\n\r\nJob duties consisted of carrying heavy trays, expediting, and serving food to customers at ninja fast speed. Performing, maintaining character and providing entertainment for guests was a key part of my job in an experiential dining setting.\r\n\r\n \r\n\r\nServer, The Stand, Laguna Beach CA                            February 2009 - July 2011\r\n\r\n     Job duties consisted of cooperative teamwork, customer service, and cash handling in a fast paced environment.","additionalInfo":"I have my current Doctors Rec. A valid CA DL and insurance and registration on my motorcycle. I'm a super fast learner, and I can balance stuff on my nose.","contact":"Phone or email  (928) 254-9644","date":"2017-11-04T19:31:07.399Z"}