{"_id":"5a1ad130-e46b-11e7-8b3a-bb1b96b9aa20","name":"Je Chatman","poster_email":"J.gxdly@gmail.com","location":"Los Angeles, CA","title":"Driver/Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p>JÈ CHATMAN</p><p>LONG BEACH, CA</p><p>T 310.621.5001 IG @11x9</p><p>sir@shotbysir.com www.shotbysir.com</p><p>&nbsp;Medical Marijuana Dispensary</p><p>Los Angeles, CA Long Beach, CA</p><p>Dear Dispensary Hiring Professionals</p><p>Good Morning! My name is Jé and I am applying for the budtender and or delivery driver position(s). I am experienced, and very knowledgeable. I’ve previously worked as both a budtender/assistant manager and delivery driver. I am punctual, hard-working, quick to learn, and even quicker to troubleshoot any obstacles i may come across. I hold a valid doctor’s recommendation and California Driver’s License. Lastly, I am a female haha. Thank you for your time and consideration!</p><p>Sincerely yours, Jè Chatman</p>","experience":"<p><br></p><p>Driver, Kushfly: Los Angeles, CA – 2016-2017</p><p>Check orders for completion, deliver orders to patients in a timely manner, and with the utmost level of customer service. Process payments with the mobile POS System. Contact management or receptionists if any corrections arise with orders.</p><p>Delivery Driver, Fast and Friendly: Long Beach, CA – 2015-2015</p><p>Responsibilities including checking orders for completion, efficiently navigating to each delivery location, holding highest customer service etiquette when dealing with patients, processing payments through the mobile POS systems.</p><p>Operations Manager, Donor Services Group LLC: Hollywood, CA – 2013-2015</p><p>Constant management of the dialed system, creation of campaigns in SQL coding, monitoring of call length on call floor, management of speed during call block.</p><p>Budtender/Receptionist, Medman40: Downtown LA, CA – 2013-2014</p><p>Responsibilities included key holding, opening and closing of the location, training new hires, WeedMaps daily update, profit/loss reporting, creation of daily menu art, label creation, occasional trimming, inventory control, and occasional hiring.</p><p><br></p>","additionalInfo":"<p>JÈ CHATMAN</p><p>Long Beach, CA Los Angeles, CA</p><p>T 310.309.7214 IG @11x9</p><p>j.gxdly@gmail.com http://sir.haus</p><p>&nbsp;Profile</p><p>Experience</p><p>Creative professional with extensive experience in both customer service and call center environments. Seeking a position within a stable company that allows for growth, utilization of current talents, and acquisition of new skill sets. Currently with open availability, and the ability to start immediately</p>","contact":"J.gxdly@gmail.com","date":"2017-12-19T03:18:58.712Z","timestamp":1513653538}