{"_id":"0d389c10-ba60-11e7-ab4b-85603fc84630","name":"Anna","resume_email":"annaraujo310@gmail.com","location":"Compton, Ca","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"To whoever this may concern, \r\n  My name is Anna I am 20 years old and I've been in the industry since I was 18 years old. I first budtender at my local shop, I would go all the time so they hired me. Within a month, I was giving a raise and I was promoted to assistant manager due to my hard work. Ever since then, I was open to learning and listening so I stayed with that company for a year, then the shop closed down due to raids. The second company I joined, I was with them for a year too. I worked about 5 different shops of theirs, even worked new positions, such as receptionist and cashier. I've always had love for this industry since I was a teen. If I didn't do this is in a shop, it be doing it on my own time. It's a lifestyle. I love helping out the patients who have concerns of their well being and come look into cannabis for the remedy. I have a solid amount of knowledge on most cannabis products, down to the different types of strains of cannabis. I love making money in a comfortable, happy environment so by me being myself; the hungry motivated person I am, I know we can make some money that can benefit both you and I. So how about we get this started?","experience":"• The Blvd, Compton CA - worked here for 1 year. (Assistant manager)\r\n• The Green Heaven, Watts CA. - 4 months (closed down due to raids)\r\n• Starbuds 20 cap, South Central - i worked here for 4 months. I was transferred from here from the Green Heaven.\r\n• Lab 30 - worked here for 5 months, cashier and receptions. I was transferred here from starbuds, which is the same company. Eventually got closed down due to raids.\r\n• 710 Clubhouse, Compton CA. (24 hour shop) assistant manager, but also got shut down due to raids.\r\n• The Loud House, Compton CA. _ 2 months. I was the only budtender here so I handled all patients alone for 14 hours (10 am - 12 am) also got raided.\r\n• Western Collection- 2 months. I was also the only budtender here so I would handle the shop alone all day until my boss came only at nights to help me close and do inventory. Hours where from 10 am - 10 pm.","additionalInfo":"I speak English and Spanish. \r\nI have manager skills. \r\nI have some computer skills, Microsoft word and excel. \r\nMarijuana Recommendation.","contact":"annaraujo310@gmail.com","date":"2017-10-26T15:12:16.362Z"}