{"_id":"34449700-bb69-11e7-b26f-fbe946111632","name":"Katherine Esquivel","resume_email":"Katherineesquivel7@gmail.com","location":"Glendale","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"I am excited to apply for the bud-tender position. I'd love to bring my dedication along with my five year experience to your company. It makes me thrilled to know that more are supportive of the MMJ industry as i have always believed it holds a bigger purpose with the direction THC/CBD research is moving. My commitment to customer satisfaction  has been \r\nextremely beneficial when dealing with patients in sales, it helped me realize the most important factor is the patient. Thus I take their needs personally\r\n\r\nand always help them find the right strain and dosage for their condition. I like to treat them as such not just a client in business. I excel in the role of dealing with upset \r\n\r\npatients; I like to rapidly solve problems to prevent the loss of key accounts. In addition to exemplary customer service, administrative tasks are my strong suit.  I comprehend\r\n\r\nthe quality and timeliness of reports, attention to detail, and I always like to demonstrate a POSITIVE team-player attitude. I am knowledgeable about every cannabis strain\r\n\r\nbenefits as well as effects; its method of ingestion and when each method should be employed. In my opinion, cannabis is better than medicine, I know all the disorders that it\r\n\r\ncan help with, as it acts as a relaxant, anti-inflammatory, antipsychotic, expectorant and it works for sedation. Furthermore, salesmanship is a strong quality I possess which \r\n\r\nis important when it comes to promoting your collective's specials, discounts, etc. \r\n\r\nThank you in advance for your time.","experience":"THE FOUNTAIN SHOPPE, Hollywood CA                                                                                                                                 1/2012 \r\n \r\n·         Performed duties of a receptionist and helped out patients.\r\n \r\n SUPER GREEN BEAR, 817 olive street LA, CA                                                                                    6/2012\r\n\r\n (213) 744-9465\r\n \r\n·         Duties of a budtender and promoted dispensaries deals\r\n\r\n\r\n G FARMACY, 330 wall st. LA, CA                                                                                                7/2012 - 12/2012\r\n \r\n·         Duties of a bud-tender.\r\n\r\n\r\nMENDOCINO WELLNESS CENTER, 21502 Sherman Way Canoga Park, CA                                    12/2012-9/2013\r\n(818) 340-0003\r\n\r\n \r\n\r\n·         Receptionist\r\n\r\n·         Trimmer/ cannabis care\r\n\r\n\r\n COMPASSIONATE PATIENT RESOURCES, 19237 1/2 Ventura Blvd Tarzana, CA            10/2013- 4/1/2014 \r\n (818) 996-4277\r\n\r\n \r\n\r\n·         Receptionist\r\n\r\n·         Budtender\r\n\r\n·         Watched cameras\r\n\r\n \r\n\r\nHide quoted text\r\nCANOGA CANNABIS COLLECTIVE,20935 Vanowen St #101 Canoga Park, CA                    4/8/2014 – 12/1/2014\r\n\r\n \r\n\r\n·         Receptionist/ Budtender\r\n\r\n·         Prepared daily financial transactions and expense reports\r\n\r\n·         Promoted and implemented marketing/social networking ideas\r\n\r\n·         Managed Weedmaps account\r\n\r\n·         Trained new volunteers\r\n\r\n\r\n\r\nCOMMON ROOTS, 21350 Nordhoff St. Chatsworth, CA 91311                     12/2015-2/2015    \r\n\r\nCannabis consultant \r\nMade sure show floor was up to the dispensary's standards.\r\nCreated Photoshop menus.\r\nUpdated Weedmaps.\r\nLight cleaning.\r\nMarketing to college students.\r\nHide quoted text","additionalInfo":"SKILLS\r\n·         POS System, MMJ Menu and 420 Software efficient.\r\n\r\n·         Hard working and energetic with excellent communication skills.\r\n\r\n·         Able to read, write and speak Spanish.\r\n\r\n·         Remarkable ability to analyze and solve problems.\r\n\r\n·         Excellent memory.\r\n\r\n·         Responsible and punctual.\r\n\r\n·         Able to work independently.\r\n\r\n·         Cash handling experience.\r\n\r\n.         Efficient in Microsoft (Word, Excel, PowerPoint) Illustrator","contact":"Katherineesquivel7@gmail.com","date":"2017-10-27T22:50:18.578Z","timestamp":1509144618}