{"_id":"b62352a0-b9ef-11e7-ae17-3908238d05e5","name":"Anna Vetvitskaya","resume_email":"vetvitskaya2015@gmail.com","location":"Los Angeles, CA","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"I am very interested in becoming a part of your team. Your facility would gain an individual who is dependable, motivated, and personable. My many experiences ensure that I am an individual who knows how to accomplish tasks and work in a team dynamic. In my prior job, I worked as a Financial & Predictive Analyst, which required that I complete tasks on schedule.\r\n\r\nI would appreciate the opportunity to discuss my credentials with you at a mutually convenient time. If you have any questions or would like more information about my qualifications, please feel free to call me at +1 323 244 9757 or email me at vetvitskaya2015@gmail.com. Thank you for your consideration.","experience":"National Labor Relations Board, Field Examiner Extern, Chisinau, Moldova\tSep 2014 –  May 2015\r\n•\tConduct investigations and research related to labor-management relations matters. \r\n•\tComplete legal research, interview witnesses, prepare sworn statements, review and analyze documentary evidence and write reports on investigations of unfair labor practice charges.\r\n•\tManage case files of all unfair labor practice and representation cases. \r\n•\tAssist Compliance Officer with missing discriminate location, backpay calculations and compliance investigations.\r\n•\tProvide Russian language translation assistance. \r\n\r\nEnterprise Rent a Car Company, \t, Chisinau, Moldova                                             Mar 2016 – October 2016\r\n•\tCollaborated with senior financial leaders to diagnose critical business problems and develop empirically based interventions to address them.\r\n•\tPerformed project-based quantitative (descriptive and predictive statistics) and qualitative (literature reviews and competitor analyses) analyses \r\n•\tCompiled comprehensive educational resources for 6 members of the Workforce Predictive Analytics Team to strengthen their knowledge. \r\n•\tDeveloped empirical models to identify the unique combinations of individual factors, expertise and professional experiences contributing to successful general manager (GM) performance.\r\n•\tAdopted economic principles to identify critical labor market skills and adjust compensation based on client demand for these skills.\r\n\r\nEnterprise Rent a Car Company, Sales manager Leadership Development Participant (Analytics Focus), Bucuresti, Romania                 \r\nFeb 2014 – Mar 2016\r\n•\tCollaborated with financial department to design and deploy an external risk assessment measuring the prevalence and impact of 10 financial and management risk factors across the company.. Results used to inform strategic planning and fleet promotion targets for 2016.    \r\n•\tWorked with financial team to design and implement a discount  program piloted in the Fall of 2015 for 55 customers in Romania and Moldova. . \r\n•\tDeveloped an analysis to identify descriptive trends and predictive drivers of group car choice. Results incorporated into Enterprise Rent a Car in Moldova to increase resource investment in promotion programs.","additionalInfo":"","contact":"vetvitskaya2015@gmail.com","date":"2017-10-26T01:48:06.675Z","timestamp":1508982486}