{"_id":"c4509230-ba89-11e7-ab4b-85603fc84630","name":"JESSICA GOMEZ","resume_email":"ms.jessgomez@gmail.com","location":"pacoima","title":"BUDTENDER","jobCategory":"Sales","references":"true","coverLetter":"HELLO MY NAME IS JESSICA, I CAN START OF BY SAYING THE USUAL THAT I WANNA WORK AND SO ON. BUT I CANT SAY MUCH JUST SIMPLY THAT I NEVER HAD WORKED FOR A DISPENSARY BUT FAMILIAR WITH PRODUCTS AND THAT I HAVE GOOD CUSTOMER SERVICE AND THE ONLY WAY TO PROVE MY SELF WORTHY IS IN PERSON BUT I CAN DEFINITELY SAY THAT I COULD BE A GOOD EMPLOYEE AND GIVE GOOD CUSTOMER SERVICE","experience":"JESSICA GOMEZ\r\n\r\n11251 El Dorado St. Pacoima, CA 91331\r\nCell: (818)818-3949\r\nms.jessgomez@gmail\r\nCareer Overview\r\nMy overall goal is to work with this company because I want a career change where there is potential growth within the company and I have the required skills and the drive to fill in the position for customer service. \r\nSkills\t\t\t\t\t\t\t\t\t\t\t   Fluent in Spanish, both in written and oral\t\t                  Cash Handler\r\ncommunication\t\t\t\t\t\t      Receptionist \r\nBasic Computer skills\t                                                                  Quick Learner \r\nCustomer Service, Good Communication skills\r\nSupervisor skills and Leadership skills\r\nWork Experience\t\t\t\t\t\t\t\t      \r\nDependable Dodge － Canoga Park, CA\r\nManaging all cash and credit cards transactions. Closing and Opening repair order and responsible for closed\r\ninvoices each day\r\nService Writer \t\t\t\t\t\t\t\t\t\t April 2017 to July 2017 \t\t\t\t\t\t                             Akey Brakey Repair Shop – Agoura hills’, CA        \t\t\t\t\t\t Log in parts that is needed for repair, enter how much time should be allocated to make the repair and schedule the appropriate technician for the based on the customer repairs                                                                     \r\nFront Desk Receptionist\r\nNovember 2016- March 2017\r\nLa Fitness － Chatsworth, CA\r\nMeet and greet members, providing excellent customer services. Check key tags verifying status in the system and updating credit card payments.\r\nAnswering calls and taking messages while making appointments.\r\nService Cashier / Body Shop Assistant\r\nMarch 2016 to October 2016\t\t\t\t\t\t\t\t\t           Answer calls, close repair and invoices, cash handling and file. Deal with insurace claims\t\r\nAssistant Manager\r\nMarch 2015 to November 2015\r\nPayless Shoes － Woodland Hills, CA\r\nSet goals to team members to up sales and updated promotion changes. Cash Office and handled Inventory.\r\nEducation\t\t\t\t\t\t\t\t\t\t General Education\r\nPolytechnic High School － Sun Valley, CA, USA   High School Diploma\t2007","additionalInfo":"","contact":"818-818-3949","date":"2017-10-26T20:10:52.928Z"}