{"_id":"9dd74540-b9cb-11e7-ae17-3908238d05e5","name":"Edain E. Diaz","resume_email":"ramutoki@gmail.com","location":"Los Angles, CA.","title":"Production Assistant","jobCategory":"Other","references":"true","coverLetter":"Hello, My name is Edain Diaz. I am interested in working in the cannabis industry because I believe cannabis as a commodity carries sufficient strength/force to make total national legalization a reality. For the past year I have worked in the cannabis industry for Sho Products/Rosin Tech. Sho products specializes on heat presses and so call \" solvent-less extraction\". Under this company my  main duties were to assemble and manufacture heat presses and pollen extraction machines ( tumblers). In the past three months, I was responsible for building Sho products' new press the Rosin Roller under the Sho Industries brand. The Rosin Roller's retail price was  $ 7,000, and it was considered to be the new innovation in solvent-less extraction. .  I also helped with shipping and organizing merchandise in the main distribution  warehouse. I worked  trade shows such as High Times' Cannabis Cub, Champs, Emerald Cup, and Chalice.   My responsibilities during the trade shows were to interact and inform costumers about extraction machines and perform  live rosin extraction using heat presses. I also helped with set up and break down of tents and equipment. Due to  Sho Products' small staff  I was able to gain experience in several other  sectors: from costumer service, manufacturing, stocking,  picking and organizing out going orders,taking inventory and shipping orders  using software such as Google Docs, spread sheet, and  shipstation. I also possess Microsoft office knowledge ( mainly word, excel, and power point); not to mention that I am always incline to learn new software when ever the opportunity to do so presents itself. I also consider myself computer savvy.  Because such limited staff, I was expected to do perform different task and prioritize urgent requests. I left my former Job with Rosin Tech because I desire to work on the field. I also desire to learn as much as possible abut the plant and to unlock its potential.  I am open for full-time, part-time, or seasonal work. I am also available to travel if expense and accommodation , negotiable, are provided. Finally I am a long time Martial Arts practitioner(  Jiu Jitsu and wrestling)  which have though me discipline,commitment and self-composure. I hope you give me the opportunity to further discuss details  regarding this employment opportunity. Thank you","experience":"Sho Products/ Rosin Tech : 10/16- 10/17","additionalInfo":"For the last year my Duties/positions in the Cannabis industry were Assembly, manufacturing, extraction, costumer service, warehouse labor, shipping, Trade Show assistance and more.","contact":"ramutoki@gmail.com","date":"2017-10-25T21:29:43.959Z","timestamp":1508966983}