{"_id":"7cb22630-d6c9-11e7-920e-d53b2bdd726d","name":"Helena Duran","email":"17aa36a01dd108915287c70bac887a05","location":"West Covina, Ca","title":"Budtender/Receptionist/Grower/Trimmer/","jobCategory":"Sales","references":"true","coverLetter":"<p>Can provide clones as well (: Looking to start asap.&nbsp;</p><p>My number is(213) 864-0394&nbsp;</p><p>Botany has become the only thing I want to do and can’t wait to learn more.</p><p>Im 19.</p><p>I go to Citrus College in Glendora so i would be available Mon-Thurs. AFTER (1:00 p.m. - Close)</p><p>&nbsp;Then (FrI-Sun - All Day)</p><p>My objective is to to gain a position with a company or institution that offers me an opportunity to apply my knowledge of cannabis and inspires me to enhance my work skills.</p><p>I also wanted to state that the clinic I worked at wasn’t being fair with pay so I left. I am interested in a more busy and professional environment than the last. I did learn a lot by myself being there because I basically ran the shop alone for a few hours and it was only my first day so I’ve definitely worked under pressure.</p><p>I am also interested in doing reception work, I know a lot about Marijuana and would love to work as budtender, I love handling weed! I also work well under pressure, as I’ve learned from previous jobs. I feel I also have the ability and are more than willing to perform these tasks -</p><p>“*ASSISSTANT</p><p>*TRIMMERS (trimmed my plants)</p><p>*MARKETING/ADVERTISING/AND PROMOTERS</p><p>*GROWERS (Currently growing)</p><p>*EXTRACTING (I’d like to learn more)</p><p><br></p>","experience":"<p>I’ve worked other jobs non-related to marijuana so I know how custimers are and how every crowd is different. I also worked at a dispensary in La.</p>","additionalInfo":"<p>Familiar with weight measurements; Oz’s, Half Oz, Quarter, Eighths etc.</p><p>Familiar with Indica’s, Indica Dominant Hybrids, Sativa’s, Sativa Dominant Hybrids.</p><p>Experience with edibles, tinctures, and oils, thc pills, rosin extracts eyc.</p><p>Familiar with the POS System, cash handling, and credit/debit card experience.</p><p>Able to roll blunts, backwoods, etc.</p><p>Able to prescribe the right medicine to patients.</p><p>Knowledge on nutrients growing indoor and outdoor.</p><p>Knowledge on topping, cloning, and transplanting.</p><p>Familiar with concentrates, rigs, any type of glass.</p><p>Bud handling</p><p>Cash handling</p><p>Able to communicate well with others.</p><p><br></p>","contact":"2138640394","date":"2017-12-01T18:57:33.161Z"}