{"_id":"0b9acca0-d6d2-11e7-920e-d53b2bdd726d","name":"Alfred Hardy","email":"613b8d6efdc3b623566dba51d8c3a1c5","location":"Long Beach,CA","title":"Budtender","jobCategory":"Harvest","references":"true","coverLetter":"<p>This is just a few lines to go along with the resume that I am submitting in relation to an entry level position.&nbsp;I'm sure that there has been overwhelming interest in the position that you are seeking to fill. I think that the thing that makes me stand out from the crowd is my life experiences as well as my experiences in life as team player. I gravitate to others easily and comfortably and adapt to situations and to new tasks with moderate ease  I would also like to indicate my enthusiasm and excitement at the opportunity to have a chance to join your team and to stare a new career in the area of professionalism that I feel I will be an asset to you, your company, your clients as well as to myself and the community. If there is anything else that I can do to improve my chances to find employment with your company or to clarify any of my skills, qualifications or anything about myself in general, I will be more than happy to comply.</p>","experience":"<p>Customers service is my comfort zone as far as choices in employment. I started my adult career working as a home health aid that gave the introduction into a long career as a health care provider and well as in a real sense customer service. That is how I got into Respiratory Therapy That is a career that lasted man years and many facilities T/O all of California. I surrendered my professional licenses because I choose to become a part of the MMJ community and the state does not permit a professional licenses to MMJ patients. I'm semi retired since 2014 and have done various and different jobs from Uber to bike mechanic a ton of volunteer work to stay busy and to find my new profession. Fitness trainer is what I am working towards for now and excited about thee upcoming industry that will com with rec marijuana.</p>","additionalInfo":"","contact":"alot59@msn.com","date":"2017-12-01T19:58:48.847Z"}