{"_id":"32b07350-d982-11e7-b1ed-e53bbb450d54","name":"Isaias Valdez","poster_email":"isaiasvaldez@live.com","location":"Portland, OR","title":"Budtender","jobCategory":"Sales","references":"true","coverLetter":"<p><span style=\"color: rgb(68, 68, 68);\">My name is Isaias Valdez, and I’m very interested in applying for a Budtender position.&nbsp;I have over 5 years of Customer Service experience and over 5 years of Cannabis growing/processing experience.&nbsp;I have my marijuana worker permit card, and I'm an OMMP patient cardholder as well.&nbsp;I’m very passionate about the Cannabis culture, and am eager to learn all about the industry.&nbsp;&nbsp;I’ve been a consumer for 13+ years, so I’ve done just about everything from making oil to raising giant plants from cuttings.&nbsp;&nbsp;I know the difference between stain types and can tell you about their effects.&nbsp;My attention to detail, self-starter attitude and proven problem-solving skills make me a valuable asset to any organization.&nbsp;I’m also friendly, loyal, and always willing to help where needed. I have a neat, well-dressed appearance as well.</span></p><p><br></p><p><span style=\"color: rgb(68, 68, 68);\"> I pride myself in my work performance and my company’s reputation in the community. In my past work as a Cashier, I was entrusted with working quickly, efficiently and safely, documenting and delivering accurate data, and being unfailingly polite toward our customers. As a Technical Support Specialist, I continue to adhere to these duties when given a task by my manager to complete, giving helpful advice to a customer, or when dealing with difficult respondents over the phone. I can use my bilingual skills to communicate effectively with Spanish-speaking customers as well.</span></p><p><br></p><p><span style=\"color: rgb(68, 68, 68);\">I've attached a copy of my resume for you to review.&nbsp;Thank you for taking the time to read this. I hope you will consider me for this position. You can reach me at (541) 954-6113 or my e-mail isaiasvaldez@live.com.</span></p><p><span style=\"color: rgb(68, 68, 68);\"> </span></p><p><span style=\"color: rgb(68, 68, 68);\"> </span></p>","experience":"<p>  August 2016-Present&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Burroughs Inc.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Portland, OR</strong></p><p><br></p><p><strong><em>Technical Support Specialist</em></strong></p><p><br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I provide over-the-phone technical support to our field technicians on how to repair ATMs and cash safes across the country.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I also provide technical troubleshooting to customers who are having trouble withdrawing cash from ATMs.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I’m responsible for verifying our technician’s credentials in order to provide them open codes for safes and ATMs.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I’m required to leave detailed notes in our database program about every interaction with our technicians.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I utilize our database system to look up parts inventory and provide part numbers to our field techs.</p><p><br></p><p>April 2016 – May 2017&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Green Zebra Grocery&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Portland, OR</strong></p><p><br></p><p><strong><em>Cashier/Barista</em></strong></p><p><br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As a Green Zebra employee, I was responsible for having knowledge about the items we carried and giving recommendations to customers based on their needs.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Used the cash register POS system to ring up groceries for customers with a friendly and helpful attitude.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Received money from customers and gave them the correct change.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Was responsible for verifying and counting the money in each cash register every morning.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As a Barista I served espresso coffee, bagels and hot tea to customers efficiently.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I worked together with other co-workers to ensure all our customers were being helped and taken care of.</p><p>  </p>","additionalInfo":"<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I am bilingual in Spanish.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I have strong writing and editing skills.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I’m experienced with computer programs such as Word, Outlook, Excel and Google Drive.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I am a goal-oriented self-starter who stays on task with no supervision. </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I can handle multiple tasks while meeting deadlines.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I’m highly organized and detail-oriented.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I utilize problem-solving techniques to overcome obstacles.</p><p>\t   I’m a strong team player and highly motivated individual</p>","contact":"isaiasvaldez@live.com","date":"2017-12-05T06:04:48.159Z","slug":"budtender","tags":[""]}