{"_id":"426e2e70-b27e-11e7-8411-e99c61e7b1a5","companyName":"Rogue Staffing","companyEmail":"eplumley@roguestaffing.com","companyWebsite":"www.roguestaffing.com","jobTitle":"Trimmer","jobCategory":"Harvest","jobDescription":"ROGUE STAFFING IS NOW HIRING Cannabis trimmers and harvest workers that are prepared to start work as soon as possible!! OVER 200 OPEN POSITIONS\r\n\r\nPosition Duties\r\n-Employees must be able to adapt to various strains, styles and types of marijuana they are trimming, adjusting their techniques to maintain a steady pace and quality.\r\n-Efficiently trims and de-fans plants (wet trim).\r\n-Responsible for accurately weighing and recording all wet trim weights.\r\n-Demonstrates accuracy and thoroughness in order to improve and promote quality.\r\n-Works in a timely manner and strives to increase productivity.\r\n-Occasionally required to trim off the stick once plants are dry.\r\n-Responsible for maintaining a team environment.\r\n-Employees must be able to work well with others, as well as independently. \r\n-Employee must be able to follow basic instructions\r\n-Employee must show up on time for work every day ready to work, and must exhibit personal hygiene while processing marijuana flower and all other job duties as assigned.\r\n\r\nSome of the qualifications we are looking for in trimmers include :\r\nTrustworthiness\r\nStrong work ethics \r\nMust be able to lift at least 50lbs and withstand the weather elements, \r\nExperience at a marijuana trimming job and knowledge of the marijuana plant anatomy is a plus\r\nAbility to focus on task for a long period of time\r\nAccuracy and consistency in trimming\r\nAbility to accurately weigh and measure","jobAccommodations":"true","jobLocation":"Medford, Or","jobType":"Part-time","jobApplication":"BEST WAY TO APPLY IS TO VISIT OUR OFFICE LOCATION BETWEEN 9AM-4PM MON-FRI OR CALL 304-673-6387\r\nBE SURE TO BRING TWO FORMS OF IDENTIFICATION AND OLCC PERMIT OR PROOF OF APPLICATION FOR THE OLCC PERMIT\r\n\r\n401 CRATER LAKE AVE, MEDFORD OR 97504\r\nROGUE STAFFING, INC.","jobCompensation":"Pay is $12 - $15 an hour, 40 hours with potential overtime.","date":"2017-10-16T14:28:21.263Z"}