{"_id":"7a6447d0-aeb7-11e7-b706-e1215ec2d68d","companyName":"GreenForce Staffing","companyEmail":"jobs@greenforcestaffing.com","companyWebsite":"http://greenforcestaffing.com/","jobTitle":"Trimmer","jobCategory":"Harvest","jobDescription":"Looking to break into the booming cannabis industry in Oregon? Do you have experience trimming and caring for cannabis? Weed love to hear from you!\r\n\r\nGreenForce is an Oregon based, full-service staffing and temporary employment agency focused on labor solutions for the cannabis industry. We specialize in providing skilled harvesting, cultivation lifecycle, and trimming temporary labor services for licensed Oregon producers. Our founders are business leaders who have come together to utilize their deep and varied experience in the cannabis, beverage, healthcare, staffing, and financial services industries to provide much needed labor solutions to the burgeoning legal cannabis industry.\r\n\r\n We are looking for team players that are passionate about cannabis. Any of these qualities sound like you?\r\n\r\n - Live in Oregon\r\n- Must have begun OLCC Marijuana Worker Permit process*\r\n- Must be organized and maintain a clean work space\r\n- Ability to follow standard operation procedures\r\n- Ability to sit for long periods of time\r\n- Reliable transportation\r\n- Flexible Schedule\r\n\r\n*OLCC permit is required before any placement can occur. It can take 3-5 weeks, so it is strongly recommended that you start the process early. If you do not have one, please apply HERE: http://www.oregon.gov/olcc/marijuana/Pages/mjworkerpermit.aspx\r\n\r\n Applications MUST be submitted via our portal listed here: http://greenforce.crelate.com/portal/job/zhzbctalmyu-444599\r\n\r\nCheck out our website: https://www.greenforcestaffing.com\r\n\r\nFollow us on social media: https://www.facebook.com/GreenforceOregon/\r\n\r\n GreenForce Staffing is an equal opportunity employer. GreenForce Staffing will not discriminate and will take measures to ensure against discrimination in employment, recruitment, advertisements for employment, compensation, termination, upgrading, promotions, and other conditions of employment against any employee or job applicant on the bases of race, creed, color, sexual orientation, national origin, or sex.","jobAccommodations":"false","jobLocation":"Portland, OR Metro Area","jobType":"Part-time","jobApplication":"Please visit https://greenforce.crelate.com/portal for all our job openings.","jobCompensation":"$13+","date":"2017-10-11T19:07:51.822Z"}