[{"_id":"04056f70-aabf-11e7-aa19-e5ac3cfee067","company_name":"The Green Planet","company_email":"employment@thegreenplanet.co","company_website":"","job_title":"Inventory Specialist","job_category":"Other","job_description":"Inventory specialist\r\nInventory Specialist will be responsible for keeping track of product keeping all inventory organized, preparing and packaging product for sales, and making sure inventory is reported correctly. Our current position is in Beaverton. \r\n\r\nRequirements:\r\n*Must have OLCC Marijuana Workers Permit\r\n*Have excellent communication skills\r\n*Have a strong knowledge of and passion for the industry\r\n* Greenbits experience desired, but willing to train if you have POS experience\r\n* 21 years of age\r\n*High School Diploma\r\n*Ensure store cleanliness\r\n*Have strong computer skills\r\n*Reliable Transportation\r\n*Able to work nights (until 10 pm), weekends and holidays (flexible hours/availability, willing to cover shifts)\r\n*Must be reliable and honest, tardiness and absents for shifts is not tolerated\r\n*Must be able to pass a criminal background check\r\n\r\nDuties Include: \r\n• Weighing and distributing product \r\n• Keeping track of product along with promoting product and keeping inventory balanced\r\n• Keeping inventory organized \r\n• Packaging product and preparing for sale.","job_accommodations":"true","job_location":"Beaverton, OR","job_type":"Full-time","job_application":"Please send a resume and qualifications to employment@thegreenplanet.co","job_compensation":"","date":"2017-10-06T17:51:44.451Z"},{"_id":"240568e0-aae0-11e7-aa19-e5ac3cfee067","company_name":"Rogue Staffing, Inc.","company_email":"ahudson@roguestaffing.com","company_website":"http://www.roguestaffing.com","job_title":"trimmer/ harvester","job_category":"Harvest","job_description":"Rogue Staffing, Inc. is looking for trimmers and harvesters who have a positive and professional attitude, anxious to work and reliable. Must have a valid ID and 2nd form of ID and proof of OLCC application email or their OLCC Marijuana Workers Permit.   We host many jobs in the Southern Oregon area, provide benefits and are a W-2 Employer. Apply online at Roguestaffing.com or come down to our office to learn more and apply. All levels are welcome. We are an equal opportunity employer.","job_accommodations":"false","job_location":"Southern Oregon","job_type":"Seasonal","job_application":"visit www.roguestaffing.com or come down to our office 401 Crater Lake Ave Ste 2, Medford, OR 97504","job_compensation":"$13 - $15 and hour","date":"2017-10-06T21:48:51.484Z"},{"_id":"63d51cf0-aea4-11e7-b706-e1215ec2d68d","company_name":"RELEAF SOCIETY LLC","company_email":"releafsociety@gmail.com","company_website":"www.releafsociety.com","job_title":"Harvest Helper/ Trim Team Specialist","job_category":"Harvest","job_description":"Releaf Society LLC is currently hiring for the following positions: \r\n\r\nTrim Team Specialist.\r\nHarvest Helpers\r\n\r\nCompensation: $15-$20/hour \r\nPaid Weekly \r\n\r\nRequirements: \r\nMinimum of (1) year experience of cannabis production preferred.\r\nMarijuana Workers Permit preferred, but not required to start........Go to oregon.gov to apply\r\nReliable transportation to/from the job site\r\nTrimTools (Fiskars/Trim tray)\r\n*Pass background check\r\n\r\nHere's the rundown...8-hour shifts are required, No half days are allowed. All Team Members are expected to be punctual, professional and maintain strong work ethic 100% of the time. No drama allowed.\r\n\r\nWe have accounts all over Oregon so if you need to relocate w/ can help keep you busy. We understand that some of our Team Members have kids/family/prior obligations. As far as scheduling, We are very flexible. You just let us know the days you're available or need off and we will adjust the schedule accordingly. We have plenty of active accounts in the area with many jobs running well into 2018.\r\n\r\nIf you meet all the necessary requirements and would like to join the Releaf Society Team call (541)797-7935. \r\nGo to our website to apply. www.releafsociety.com\r\n\r\n\r\nCheck out our Instagram @releafsocietyllc to see what we have been up to around the state","job_accommodations":"false","job_location":"Oregon","job_type":"Seasonal","job_application":"Go to www.releafsociety.com to apply!","job_compensation":"$15-$20/hour or $120/lb","date":"2017-10-11T16:51:13.552Z"},{"_id":"7a6447d0-aeb7-11e7-b706-e1215ec2d68d","company_name":"GreenForce Staffing","company_email":"jobs@greenforcestaffing.com","company_website":"http://greenforcestaffing.com/","job_title":"Trimmer","job_category":"Harvest","job_description":"Looking to break into the booming cannabis industry in Oregon? Do you have experience trimming and caring for cannabis? Weed love to hear from you!\r\n\r\nGreenForce is an Oregon based, full-service staffing and temporary employment agency focused on labor solutions for the cannabis industry. We specialize in providing skilled harvesting, cultivation lifecycle, and trimming temporary labor services for licensed Oregon producers. Our founders are business leaders who have come together to utilize their deep and varied experience in the cannabis, beverage, healthcare, staffing, and financial services industries to provide much needed labor solutions to the burgeoning legal cannabis industry.\r\n\r\n We are looking for team players that are passionate about cannabis. Any of these qualities sound like you?\r\n\r\n - Live in Oregon\r\n- Must have begun OLCC Marijuana Worker Permit process*\r\n- Must be organized and maintain a clean work space\r\n- Ability to follow standard operation procedures\r\n- Ability to sit for long periods of time\r\n- Reliable transportation\r\n- Flexible Schedule\r\n\r\n*OLCC permit is required before any placement can occur. It can take 3-5 weeks, so it is strongly recommended that you start the process early. If you do not have one, please apply HERE: http://www.oregon.gov/olcc/marijuana/Pages/mjworkerpermit.aspx\r\n\r\n Applications MUST be submitted via our portal listed here: http://greenforce.crelate.com/portal/job/zhzbctalmyu-444599\r\n\r\nCheck out our website: https://www.greenforcestaffing.com\r\n\r\nFollow us on social media: https://www.facebook.com/GreenforceOregon/\r\n\r\n GreenForce Staffing is an equal opportunity employer. GreenForce Staffing will not discriminate and will take measures to ensure against discrimination in employment, recruitment, advertisements for employment, compensation, termination, upgrading, promotions, and other conditions of employment against any employee or job applicant on the bases of race, creed, color, sexual orientation, national origin, or sex.","job_accommodations":"false","job_location":"Portland, OR Metro Area","job_type":"Part-time","job_application":"Please visit https://greenforce.crelate.com/portal for all our job openings.","job_compensation":"$13+","date":"2017-10-11T19:07:51.822Z"},{"_id":"426e2e70-b27e-11e7-8411-e99c61e7b1a5","company_name":"Rogue Staffing","company_email":"eplumley@roguestaffing.com","company_website":"www.roguestaffing.com","job_title":"Trimmer","job_category":"Harvest","job_description":"ROGUE STAFFING IS NOW HIRING Cannabis trimmers and harvest workers that are prepared to start work as soon as possible!! OVER 200 OPEN POSITIONS\r\n\r\nPosition Duties\r\n-Employees must be able to adapt to various strains, styles and types of marijuana they are trimming, adjusting their techniques to maintain a steady pace and quality.\r\n-Efficiently trims and de-fans plants (wet trim).\r\n-Responsible for accurately weighing and recording all wet trim weights.\r\n-Demonstrates accuracy and thoroughness in order to improve and promote quality.\r\n-Works in a timely manner and strives to increase productivity.\r\n-Occasionally required to trim off the stick once plants are dry.\r\n-Responsible for maintaining a team environment.\r\n-Employees must be able to work well with others, as well as independently. \r\n-Employee must be able to follow basic instructions\r\n-Employee must show up on time for work every day ready to work, and must exhibit personal hygiene while processing marijuana flower and all other job duties as assigned.\r\n\r\nSome of the qualifications we are looking for in trimmers include :\r\nTrustworthiness\r\nStrong work ethics \r\nMust be able to lift at least 50lbs and withstand the weather elements, \r\nExperience at a marijuana trimming job and knowledge of the marijuana plant anatomy is a plus\r\nAbility to focus on task for a long period of time\r\nAccuracy and consistency in trimming\r\nAbility to accurately weigh and measure","job_accommodations":"true","job_location":"Medford, Or","job_type":"Part-time","job_application":"BEST WAY TO APPLY IS TO VISIT OUR OFFICE LOCATION BETWEEN 9AM-4PM MON-FRI OR CALL 304-673-6387\r\nBE SURE TO BRING TWO FORMS OF IDENTIFICATION AND OLCC PERMIT OR PROOF OF APPLICATION FOR THE OLCC PERMIT\r\n\r\n401 CRATER LAKE AVE, MEDFORD OR 97504\r\nROGUE STAFFING, INC.","job_compensation":"Pay is $12 - $15 an hour, 40 hours with potential overtime.","date":"2017-10-16T14:28:21.263Z"},{"_id":"e2f8a410-b689-11e7-a694-835a9e127a24","company_name":"Northstar Botanicals","company_email":"northstarinfo88@gmail.com","company_website":"","job_title":"Trimmer","job_category":"Grow","job_description":"a large friendly farm located in Oregon City, Oregon  looking for about 7 experienced trimmers of at least 1+ years of experience.  We have all different types of shifts and level from deleaving jobs to trimming jobs. We are looking for trimmers with  the right attitude.  It could be YOU!","job_accommodations":"false","job_location":"Oregon City, Oregon","job_type":"Full-time","job_application":"Please leave your contact info if you are interested to northstarinfo88@gmail.com","job_compensation":"12-15lbs with bonus","date":"2017-10-21T18:01:39.708Z"},{"_id":"f3c6e490-b9a5-11e7-ae17-3908238d05e5","company_name":"The Cannabis Farm","company_email":"sara@thecannabisfarm.com","company_website":"","job_title":"Trimmer","job_category":"Other","job_description":"OLCC licensed recreational cannabis facility seeking dependable, motivated individuals to join our team. \r\nCurrently seeking experienced trimmers.\r\nPosition may also include : harvesting, and general garden labor. \r\nExperience in working with cannabis and a willingness to learn new techniques is preferred. \r\n\r\nOpportunity for in-house promotion.\r\n\r\nSchedule is Monday through Friday 8:30-5:00 (Over-time offered in the fall)\r\nRequired:\r\n21+ years of age\r\nMust be in the process of obtaining OLCC Marijuana Worker Permit.\r\nReliable transportation\r\n\r\nNO ON-SITE LIVING AVAILABLE","job_accommodations":"true","job_location":"Applegate, OR","job_type":"Full-time","job_application":"If interested, please email a copy of your marijuana worker permit, resume with references, and cover letter to sara@thecannabisfarm.com then call Sara at #541-291-6634.","job_compensation":"$DOE","date":"2017-10-25T17:00:07.297Z","timestamp":1508950807},{"_id":"539f8670-ba90-11e7-ab4b-85603fc84630","company_name":"Mobile Cannabis Solutions","company_email":"mobilecannabissolution@gmail.com","company_website":"mobilecannabissolutions.com","job_title":"Trimmers or Farm Labor","job_category":"Harvest","job_description":"Mobile Cannabis Solutions is a cannabis farm staffing agency looking for RELIABLE full AND part-time employees! \r\nWe offer flexibility and competitive industry pay rates. \r\n\r\nNOW HIRING FARM AND TRIM CREWS NOW! \r\n\r\n\r\n**COME FILL OUT HIRE PAPERWORK AND INTERVIEW THIS FRIDAY AND SATURDAY OCTOBER 27TH and 28TH!!**\r\nWE ARE HIRING FRIDAY FROM 5:30PM-7PM AND SATURDAY FROM 3PM-4:30PM\r\nCOME MEET US AT 828 SOUTH CENTRAL AVENUE #7 MEDFORD OREGON 97501 \r\n\r\n\r\n\r\nWhat you will need to fill out hire paperwork: \r\nMust have taken OLCC test http://www.oregon.gov/olcc/marijuana/Pages/mjworkerpermit.aspx\r\nBring a copy of the certified OLCC processing email stating a reference number\r\nA pen\r\nReadiness to interview and work \r\n\r\n\r\n\r\n\r\nCan you do outdoor labor?\r\nThen farm work is for you!\r\n\r\nWant to learn how to be a skilled trimmer?\r\nWe can help you learn how to trim.\r\nYou may be better at it than you think!\r\n\r\nWe work with multiple farms throughout Jackson and Josephine Counties, most often times, simultaneously. This gives you a selection of positions, and locations, to select from. \r\n\r\nPositions available: \r\nImmediate openings for Trim work and Farm work/Harvest\r\nAdditionally, we are staffing now for our Williams area\r\n\r\nIf you dont have your OLCC permit but would like to so you can join our team please follow the link below;\r\nClick on the link below to get certified!! \r\n\r\nhttp://www.oregon.gov/olcc/marijuana/Pages/mjworkerpermit.aspx\r\n\r\n\r\nRequirements:\r\n\r\nMust be 21\r\n\r\n• Must have taken and passed OLCC test and submitted your permit application (Please see link above to go through that quick and easy process)\r\n• Must be punctual\r\n• Must have a strong work ethic\r\n• Must have a positive attitude\r\n• Must work well in a team environment\r\n\r\n\r\nPhysical requirements:\r\n\r\n•Must be able to trim -OR- do farm labor for 8+hours\r\n• Must be able to sit, stand, and lift for long periods of time \r\n\r\n\r\nPosition description for trim work: \r\n\r\nIf you're new to the industry DON'T WORRY!! WE WILL TRAIN YOU!!\r\n\r\n• Trim staff will be responsible for big leafing and dry trimming plants\r\n• Responsible for moving/ hanging of plants, collecting waste plant matter, and properly disposing of dirt\r\n• Separate and organize trimmed product into specific containers for bud, trim, stems, fan etc.\r\n• Weigh and record information regarding trimmed plant material \r\n• Responsible for following operational and company guidelines \r\n• Ability to listen and communicate with other trim staff and management \r\n• Work in a quick and efficient manner while still being able to meet quality standards\r\n• Maintain a clean and organized work environment\r\n• Develop basic knowledge of strain characteristics and main problems with plants during harvest process\r\n• Responsible for end of clean up of trim room, break room, and bathrooms and grow tables\r\n• Abide by scheduling policies, show up on time for scheduled shifts, and request time off in accordance with company policy\r\n\r\nPLUSES:\r\nWe do car pool to farms, but it is a plus if you have transportation (especially if you're willing and able to share in car pooling) \r\nSome experience in the cannabis industry is a plus as well.\r\n\r\n\r\nEmployees are paid weekly\r\n\r\n\r\nAs trim or farm staff, you will be directed to client locations and work to harvest their crop. This is a team environment so cooperation and friendliness are key. You will see various techniques and trim styles because we customize our services to each clients individual needs.\r\nAgain, WE WILL TRAIN YOU!\r\n\r\nMobile Cannabis Solutions\r\n541-326-1643 between 9:00 A.M. - 5:00 P.M. 7 days a week\r\n\r\nNOW HIRING FARM AND TRIM CREWS","job_accommodations":"true","job_location":"Williams Oregon","job_type":"Full-time","job_application":"Meet us to fill out hire paperwork","job_compensation":"$14 a hour for Farm Labor. $127 a pound for dry trim","date":"2017-10-26T20:57:50.318Z"},{"_id":"53d267f0-bb2d-11e7-b26f-fbe946111632","company_name":"RELEAF SOCIETY","company_email":"careers@releafsociety.com","company_website":"www.releafsociety.com","job_title":"Trim team specialist","job_category":"Harvest","job_description":"Releaf Society is looking to add to their wonderful team of trim and harvest crew specialists.  If you have previous trim and harvesting experience, and possess your marijuana work permit through Oregon.gov, please send us your resume and cover letter.  Releaf Society serves, Southern Oregon, Eugene, Corvallis, Salem, PDX and surrounding areas, Bend and much more.  We look forward to speaking with you.","job_accommodations":"false","job_location":"State of Oregon","job_type":"Part-time","job_application":"Please send Resume to Careers@Releafsociety.com if it does not have your cannabis trim and harvest experience on it, please attach a cover letter with details.","job_compensation":"$15-$20/hr, or by the pound payments","date":"2017-10-27T15:41:41.617Z","timestamp":1509118901}]