{"_id":"264385f0-a857-11e7-8704-5b582ac668d2","name":"Azucena Bracamontes","location":"Portland Oregon","skillLevel":"Entry","references":"true","accommodations":"true","workType":"Part-time","coverLetter":"Susie Bracamontes\r\n2658 N Kilpatrick st\r\nPortland OR 97217\r\nPhone: (503) 957-9809\r\nEmail: azucenabracamontes@yahoo.com\r\n \r\nObjective:\r\n​Taking the next step in my career in this industry will utilize my exceptional customer relation skills, coupled with my experience in human relations.\r\nSummary of Qualifications:\r\n• Strong work ethic through past experience and increasing responsibility at La Superior, Seven Rivers, and Jewelry\r\n• Trained in various aspects of Microsoft Office, Windows, and various scheduling and POS systems\r\n• Increased reading, writing, cash handling, and problem solving skills through various positions\r\n\r\n Work Experience: KFC\r\nWork position: supervisor\r\nThe one MLK \r\nJun 1 2016 to October\r\n\r\nWork Experience: conifer house 145 NE conifer Boulevard Corvallis OR 9733\r\nCaregiver /Floor aid \r\nMay 8 2014 to August 8 2014 \r\nSales Associate​​​​December 2013 - January 2014​​​Portland, OR\r\nJewelry; Tony\r\n• Increased ability to communicate with clients, before and after the sale\r\n• Computer-literate performer with extensive software proficiency covering wide variety of applications.\r\n• Performed top level selling skills to promote and increase revenue\r\nCashier/Bartender​​​January 2013 – July 2013​​​Portland, OR\r\n​Seven Rivers BBQ; Seven\r\n• Increased readiness, organization, enthusiasm, accuracy, and innovation\r\n• Learned versatility and conscientious behavior from clients\r\n• Quickly have grasped and done the work assigned, requesting assistance as needed\r\n \r\nCashier/Cook​​​​July 2008 – December 2012​​​Portland, OR\r\n​La Superior; Nicole Martinez\r\n• Performed critical thinking in forms of client’s best interest\r\n• Increased active listening, so I can provide the right solution at every opportunity","contact":"Azucenabracamontes@yahoo.com","date":"2017-10-03T16:23:11.884Z"}