{"_id":"008826f0-b04e-11e7-a288-11368df4174b","name":"Erik Anderson","location":"Portland, Oregon","skillLevel":"Senior","certification":"true","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"Erik Anderson\r\n\r\nerik.blindnil@gmail.com\r\n\r\n\r\n\r\nTo whom it may concern\r\n\r\nI’ve been a cannabis trimmer for ten years.   I started trimming my friends’ medical grows prior to recreational legalization and have worked for a friend’s recreational grow for the last year.  I have an OLCC marijuana workers permit.\r\n\r\nI have experience stalk trimming fresh cut colas, fine trimming fan and sugar leaves and cutting out peteals.  With this method, I have mostly hung the colas to cure, then de-stem the flowers as the colas approach the grower’s desired level of moisture content.  I then de-stem the flowers and clean up any sugar leaves from the flowers.  All trim is kept for processing.  I have used this method mainly in smaller grow operations.\r\n\r\nI also have experience dry trimming.  This usually entails cutting down plants and cutting/stripping fan leaves and leaving the flowers on the stem for curing.  After the flowers are cured, the flowers are de-stemmed and then fine trimmed.  I have used this trimming method for larger commercial grows.\r\n\r\nI have used various trimming machines as well, most notably the Triminator.  I have only used this at larger commercial grows.  Medical (prior to rule changes)  and smaller grow operations tend not to use them in my experience and those growers fear the machines adversely affect the final product.  At larger grows, it isn’t economically viable to hand trim everything start to finish, especially due to the flooded market here in Oregon.\r\n\r\nI know that different strains, growth methods and mediums can produce varying degrees of flower structure.  Some strains grow very dense flowers (gorilla glue #4 is a good example) and some are less dense (high CBD strains such as cannatonic for instance).  Knowing how to handle the differences between different strains/growing techniques is very important for the quality of the final product and efficacy for the grower themselves.  I hold myself to high standards in this regard.  \r\n\r\nI am also cognizant of not cross contaminating grow sites.  Powdery mildew, mites, potential hermaphroditing and pollen contamination are all important  to avoid so I always change clothing between sites.\r\n\r\nI have the ability to trim dry flower that has been de-stemmed at a rate of 1.5lbs/8 hour period give or take a few ounces depending on the density of the flower.  I stay on task and only stop to stretch or use the restroom.","contact":"erik.blindnil@gmail.com","date":"2017-10-13T19:37:52.499Z"}