{"_id":"ebf25010-a960-11e7-9a7d-c99de06bb99b","name":"Zephaniah Marion","location":"Pasadena, CA","skillLevel":"Senior","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"Dear Hiring Manager of Trimmerwork,   \r\n\r\n\r\nMy name is Zephaniah Marion...A little about me…\r\n\r\nI am 29 yrs. old, a native of Pennsylvania, and now a resident of Los Angeles. I came to California to be apart of this industry. I’ve been in this business around 10 years because Cannabis is my number one love. Growing, Trimming, extracting … all of it! \r\n\r\nHere’s what I offer your company: \r\n\r\nI have 10 years trimming experience in all strains. I have experience in both wet and dry trimming. I can trim two pounds a day with two sets of Fiskars, a glass of rubbing alcohol aka scissor soak and have two pounds of product trimmed and ready per day.\r\n\r\nI can work local i.e. Los Angeles county area without accommodations. If at a remote location I would need food and shelter or I can provide tent.  \r\n\r\nIn addition, I also offer 10 years of solid grow experience and 2 years of study at NPK University. I have grown and cultivated dank weed, monster grows and have done extractions of all kind. I’ve done indoor grows (scrog, sog) and outdoor grow (monster, guerilla) as well.\r\n\r\n I happily offer your company my knowledge of the following: trimming, drying, and curing. I also gladly offer my knowledge of keif, oil, dab, and rosin extraction. I also have considerable experience cooking edibles, pressing hash etc.) \r\n\r\nI just completed a job at 710 Gas Station Dispensary here in Los Angeles where I performed the following: Dry ice Kief extraction, grow room electrical, master grower cultivation assistance and farm labor.\r\n\r\nThank you for your time. I would love to be a part of your company and contribute to what I believe is the number one product that has arrived on the market. I am a fast learner, have a reliable vehicle, and ready to work long hours. I can start work ASAP. I have attached my resume bellow.\r\n\r\nThank You,\r\n\r\nZephaniah Marion \r\n431 N Wilson Ave Pasadena, CA 91106 \r\n213.804.8444 \r\nZmarion@yahoo.com www.facebook.com/ Zephaniahmarion\r\n\r\nZEPHANIAH W. MARION\r\n431 N. Wilson Ave #5\r\nPasadena, CA 91106\r\nZmarion@yahoo.com\r\n213.804.8444\r\nwww.facebook.com/ZephaniahMarion\r\nEDUCATION\r\nWallenpaupack High School, Pennsylvania, 2007. NPK University, Online Gardening University 2015-2017.\r\n \r\nOBJECTIVE\r\nTo grow as well as cultivate dynamic strains utilizing my experience in cultivating/extracting/manufacturing to reach and expand your consumer base.\r\n \r\nSKILLS\r\nGROWING: Advanced organic soil cultivator and cannabis strain creator:\r\n• Cannabis hybrid creator and cloner.\r\n• Seedling, Vegetation, and Flower cultivator.\r\n• Drying, Curing, and Trimming Specialist.\r\n• Soil Mycelium Specialist.\r\n• Topping\r\n• Caging\r\n• Pruning\r\n• Indoor Lighting knowledge\r\nEXTRACTION: Advanced Cannabis Extraction knowledge:\r\n• Everclear RSO Oil Extraction.\r\n• Dry Ice Kief Extraction and Press.\r\n• Ice Water Bubble Hash/Kief and Press.\r\n• Butane Dabs\r\n• Heat Rosin Extraction\r\n• Cannabis Edibles: Canna-Butter, RSO Black/Coconut Oil, Canna-milk, Canna-Flour, Canna- Chocolate-Canna Juice.  \r\n \r\nOTHER: Bobcat, Skid Steer, Wheel Loader, Scissor Lift, Box Truck, and Auto Driver. Stone Thermalist/Stone Cutting Specialist, Lifeguard-CPR and Defibulator Certified (2002-2004), Traveling CXO. House Flipping Business Owner\r\n \r\n \r\nPROFESSIONAL EXPERIENCE\r\n \r\nCannabis Grow Specialist/Extractor: Owner/ Producer. 2010- Present.\r\n*Specialties: Outdoor Caging and Indoor Scrog Cultivation. Soil Mycelium Specialist.\r\n \r\nHouse Flipper/Owner: Marion Investments. 2012-2014. Locate housing properties for potential investment opportunities, Legal and realtor inspections, employee hires. Painting, plumbing, and construction.\r\n \r\nExterminator: A3 Superior Pest Control, Pennsylvania. 2010-2012. Served three states NY, NJ, PA for pest control. Responsible for driving, loading 200-pound heaters and cables into customers homes. Implementation of process from start to finish.\r\n \r\nLaborer: Home Depot, Maine. 2009. Responsible for tearing down and rebuilding in store garden structures (50ftx20ft) and driving the scissor lift on location.\r\n \r\nResident Technician: St. Joseph’s Center, Scranton, PA. 2009-2011. Responsible for patient care. Duties included: Feeding, G-Tube Feedings, O2 tanks, rehabilitation.\r\n \r\nSports Palace Attendant: Ceaser’s Cove Haven, Lake Ariel, PA. 2004-2009. Responsible for maintenance of tennis, bocce, ice-skating, and pool hall areas. Grass cutting, leaf blowing, pool cleaning, house keeping, and heavy lifting of materials as needed. Snowmobile and waterski instructor.\r\n \r\n \r\n \r\nReferences:\r\n \r\nElle Alexander: Television Casting Director. Los Angeles, CA. 917.215.8280\r\nAimee Skelton: Manager of Ceaser’s Cove Haven. Lake Ariel, PA. 570.407.8551\r\nMarie Woody: Head of Administration at St. Josephs. Scranton, PA. 570.342.8379","contact":"Zmarion@yahoo.com","date":"2017-10-05T00:05:40.189Z"}