{"_id":"37284f40-ac71-11e7-a70c-e7da05d06b40","name":"zephaniah marion","location":"Pasadena","skillLevel":"Senior","certification":"true","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"I am looking to relocate ASAP and buy a house in cash for a fast closing near my new job Dear Hiring Manager, \r\n\r\n\r\nMy name is Zephaniah Marion...A little about me… I am 29 yrs. old, a native of Pennsylvania, and now a resident of Los Angeles. I came to California to be apart of this industry.\r\n\r\nI’ve been in this business around 10 years because Cannabis is my number one love. Growing, Trimming, extracting … all of it!\r\n\r\nHere’s what I offer your company:\r\n\r\n10 years of solid grow experience and 2 years of study at NPK University. I have grown and cultivated dank weed, monster grows and have done extractions of all kind. I’ve done indoor grows (scrog, sog) and outdoor grow (monster, guerilla) as well. I happily offer your company my knowledge of the following: trimming, drying, and curing. I also gladly offer my knowledge of keif, oil, dab, and rosin extraction. I also have considerable experience cooking edibles, pressing hash etc.)\r\n\r\nI just completed a job at 710 Gas Station Dispensary here in Los Angeles where I performed the following: Dry ice Kief extraction, grow room electrical, master grower cultivation assistance and farm labor.\r\n\r\nThank you for your time. I would love to be a part of your company and contribute to what I believe is the number one product that has arrived on the market. I am a fast learner, have a reliable vehicle, and ready to work long hours. I can start work ASAP. I have attached my resume.\r\n\r\n\r\nThank You,\r\n\r\n\r\nZephaniah Marion\r\n431 N Wilson Ave\r\nPasadena, CA 91106\r\n213.804.8444\r\nZmarion@yahoo.com\r\nwww.facebook.com/Zephaniahmarion  OBJECTIVE\r\nTo\tgrow\tas\twell\tas\tcultivate\tdynamic\tstrains\tutilizing\tmy\texperience\tin\t\r\ncultivating/extracting/manufacturing\tto\treach\tand\texpand\tyour\tconsumer\tbase.\r\nSKILLS\r\nGROWING:\tAdvanced\torganic\tsoil\tcultivator\tand\tcannabis\tstrain\tcreator:\r\n• Cannabis\thybrid\tcreator and\tcloner.\r\n• Seedling,\tVegetation,\tand\tFlower\tcultivator.\r\n• Drying,\tCuring, and\tTrimming\tSpecialist.\t\r\n• Soil\tMycelium\tSpecialist.\t\r\n• Topping\r\n• Caging\r\n• Pruning\r\n• Indoor\tLighting\tknowledge\r\nEXTRACTION: Advanced\tCannabis\tExtraction\tknowledge:\r\n• Everclear\tRSO\tOil\tExtraction.\r\n• Dry\tIce\tKief\tExtraction\tand\tPress.\r\n• Ice\tWater\tBubble\tHash/Kief\tand\tPress.\r\n• Butane\tDabs\r\n• Heat\tRosin\tExtraction\r\n• Cannabis\tEdibles:\tCanna-Butter,\tRSO\tBlack/Coconut\tOil,\tCanna-milk,\tCanna-Flour,\t\r\nCanna- Chocolate-Canna\tJuice.\t\t\r\nOTHER: Bobcat,\tSkid\tSteer,\tWheel\tLoader,\tScissor\tLift,\tBox\tTruck,\tand\tAuto Driver. Stone\t\r\nThermalist/Stone\tCutting\tSpecialist,\tLifeguard-CPR\tand\tDefibulator\tCertified (2002-2004),\r\nTraveling\tCXO. House\tFlipping Business\tOwner","contact":"zmarion@yahoo.com","date":"2017-10-08T21:39:51.882Z"}