{"_id":"04cd9b10-ad28-11e7-ba60-73e6ff6c9850","name":"Kaige Lawrence","location":"Los Angeles, CA","skillLevel":"Mid","certification":"false","references":"false","accommodations":"false","workType":"Full-time","coverLetter":"Hey!\r\n\r\nMy name is Kaige Lawrence and I am very interested in the job opening I saw online. I graduated as a student athlete from the University of Arizona where the use of cannabis was obviously prohibited. After seeing the effectiveness of CBD on my autistic brother, I decided I wanted a career in the cannabis industry. \r\n\r\nI currently am a Manager for Fresh Flowers Collective in Los Angeles. With the help of an additional manager, we manage the daily operations of the shop. We make sure all inventory is fully tracked and supplied, create monthly schedules for the 10+ employees that we have, and come up with effective marketing strategies to increase foot traffic. I also helped create SOPs for a few of the different processes that we have including, Budtending and Sales, Patient Intake, Vendor Intake, Security Protocols, and Inventory management. Cannabis is an extreme passion of mine and I am looking to make a career out of it. \r\n\r\nIf you take a look at my resume you will also see that I was previously an Operations Supervisor for Damco Distribution. I managed up to 75 people for customers like, Wal-Mart, Best Buy, Nestle Waters of America, and Home Depot. I was responsible for the safety of the shift as a whole and making sure that we hit our production goals set by the facility director.\r\n\r\nWhile I was attending Community College, I was also a manager for a local delivery service called Fast Greens. I had a very close relationship with the owner and I gained more and more responsibilities as time went on. I started off by making sure the recommendations were valid and by the time I was leaving to college I was holding interviews with potential employees. \r\n\r\nMy true passion is with growing. When I saw the night and day difference in my brother's behavior, I started researching cannabis and how the plant grows. When I discovered the endless possibilities of breeding cannabis, I decided to start growing. I have been doing so for a little more than 3.5 years now. I am constantly trying to improve yield and phenohunt for the best strains. I have studied and read many articles and books on growing but I still have a lot to learn.\r\n\r\nIf offered a position, I have no issues with scheduling and can work anytime. I have attached my resume below but please feel free to call me anytime at (760) 953-3290. Thank you for your time and consideration! \r\n\r\n- Kaige Lawrence","contact":"kaige99@live.com","date":"2017-10-09T19:28:25.299Z"}