{"_id":"de0b9960-a858-11e7-8704-5b582ac668d2","name":"Julian Jennings","location":"Portland, Or.","skillLevel":"Mid","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"To whom it may concern,\r\nI’m applying to your Dispensary because I not only want to get more experience in the cannabis industry, but because I want to work a job I have a passion in. I feel I would be a great addition to your company because I already have some experience trimming as well as making oils.\t\t\t\r\nNow as for some of my experience in this industry, I have done some trimming/making oil as well as up keeping plants here and there for friends and family. Now although I don’t have any experience as a bud-tender  I feel I have more knowledge about the plant then just the casual user so I am confident I will be able to help your customer with whatever they need and why. Whether it’s smoking and eating edibles for the casual enthusiasts or to help someone with a medical issue. For example, if someone tends to be out and about a lot and wants to stay productive I would personally point them in the direction of a sativa or sativa-dom hybrid. Or maybe it’s a medical issue? Maybe someone finds they dip in and out of depression because of a medical issue or do to the season change. In either case I would recommend a good sativa. (I.e. Hippie Crippler/Sour Diesel/Cinex/Agent Orange etc…). And sometimes a customer may not even like smoking or getting high, in which case I would recommend some CBD oil for a vape pen or maybe even some CBD capsules/edibles that are 100% CBD with no THC for zero psychoactive effects. \r\nIn Conclusion, I feel I would be a great addition to the team because this is a job I genuinely have a passion for and really want to soak up as much knowledge about! I’ll be one of your hardest workers, most knowledgeable as well as outgoing and friendly with customers and team mates! I hope I fit what you are looking for!","contact":"Julianjamal94@gmail.com","date":"2017-10-03T16:35:29.709Z"}