{"_id":"60bbb370-aced-11e7-a70c-e7da05d06b40","name":"Douglas Conran","location":"Brooklyn, NY","skillLevel":"Entry","certification":"false","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"I am extremely interested in applying for one of the Trimming positions, as advertised on Craigslist. At this moment I live in Brooklyn, NY and will be moving to Los Angeles within a month or two, or as soon as i can secure a job. I am currently employed by SNL Construction LLC, a construction company that builds storage buildings, as an assistant superintendent. Before this job three years ago, I worked in a homemade wine center as a winemaker. I believe my skills that I’ve gained at these jobs will make me an ideal candidate for one of your positions you’re seeking to fill. \r\nAs an Assistant Superintendent, I have developed stronger leadership and communication skills. I understand the large importance of deadlines and following the plans/instructions, especially when dealing with local laws and codes. I also understand the how important a goal oriented team really is when working together. Record keeping and organization skills are necessary as many logs are needed to be kept up on a daily basis. Quality control in all building aspects must be kept up to par too. \r\nWhile working in the winery, there was one main rule that had to be followed; Cleanliness is key. If the supplies weren’t sanitized completely there would run a risk of poor wine quality or a lower yield. I understand how important it is to have all materials cleaned and fully sanitized before continuing with the process, as it is a vital step\r\nBoth of these jobs also fed into my love for hands on work. I feel that I thrive at whatever job I do when I’m physically able to make it or watch it grow. I am more than confident that I can be a major part of your team at your company. Any kind of work that is hands on, I do extremely well with. I would be extremely stoked to learn so much about a growing industry that I’m so interested in. A position in this field would truly support my passion for hands-on type of work. I certainly look forward to hearing from you. \r\nThankyou for your time\r\nDouglas Conran","contact":"douglasmconran@gmail.com","date":"2017-10-09T12:28:39.241Z"}