{"_id":"db33f440-ad7a-11e7-ba60-73e6ff6c9850","name":"jeff creeden","location":"Los Angeles, C.A.","skillLevel":"Senior","certification":"true","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"My extensive experience working in the medical marijuana industry began over a decade ago as a designated cannabis caregiver and grower for patients in Colorado. I've continuously remained employed within the industry since then, gaining familiarity in a wide variety of roles and responsibilities common to a dispensary's day-to-day operations. I possess not only sales, clerical, and administrative experience in a dispensary setting but also insight and advanced knowledge of the cannabis plant and genetics accumulated over ten years of refining growing methods, researching new techniques, and continuously learning through trial and error in the process of commercially cultivating cannabis plants in mid to large-scale growing gardens & warehouses.\r\n \r\n I have served a variety of leadership and management roles in the fast-paced start-up environment of dispensaries that demanded accountability and proactive behavior. I have experience in recruiting, training, and supervising new employees on bud tending procedures, cashier operations, customer service protocols, safety standards, and our organization's mission & policies. Through collaborative team work and a proactive, organized approach, I've learned how to develop and manage an ambitious and energetic sales team that can efficiently meet sales quotas while prioritizing excellence in customer service and patient satisfaction through creative problem solving methods that best serve our customers. My experience has taught me the importance of establishing professional working relationships with patients.  I understand the value in delivering genuine and passionate customer service, both in terms of generating profit and also in establishing a strong brand image and favorable reputation propagated by satisfied customers.\r\n \r\nI consider myself a highly-receptive and adaptable individual familiar with the accountability and reliability expected from me by my employers. I am well researched in new growing techniques and possess insight to expand knowledge in determining appropriate nutrients for individual strains, high yield recipes, analyze controlled stress environments with variable ent lighting systems and set ups. I possess vast comprehensive knowledge of various strains, their effects and of the various types of medicinal administration methods. \r\n \r\nThe Cannabis industry has been a life-long passion for me, and I've made a living over the past decade employed within the industry while simultaneously gaining some degree of mastery in nearly every role within a dispensary's operational and growing staff. For all these reasons, I seek your active consideration of my application for a full-time position and look forward to hearing from you in the near future. Thank you again for your time and consideration.\r\n\r\nSincerely, \r\nJeffrey C Creeden","contact":"baker.jeffrey@hotmail.com","date":"2017-10-10T05:21:23.743Z"}