{"_id":"2e162950-aae0-11e7-aa19-e5ac3cfee067","name":"William Edward Duran","location":"Los Angeles CA","skillLevel":"Mid","certification":"false","references":"false","accommodations":"false","workType":"Full-time","coverLetter":"William Edward Duran\r\n409 Burchett St., Glendale, CA. 91203\r\n\r\nTel: 818-319-2240 | Email: edwardduran816@gmail.com\r\n\r\n\r\n\r\nGreetings!\r\nmy name is Edward, and I'm seeking work in the cannabis production industry .\r\nI'm a multi-generational Southern Californian, one who's family hearkens back to a time when the SFV was all citrus orchards… and to that, \"agriculture is in the blood\" as they say. I with my families help started growing an assortment of fruit bearing trees, vegetables/ fruit, and herb crops at age 8. My horticultural experience stems from practical, logical, and deductive processes in various grow applications.\r\n\r\n\r\nCANNABIS AN AGRICULTURAL CROP … My Experience:\r\n\r\n* Experienced seed viability selection for sexing to germination.\r\n\r\n* Knowledgeable in various strains that include Land-race, Sativa, Indica, and Ruderalis; as well as many well known hybridized strains in use today for medicinal and recreational applications.\r\n\r\n* Grow medium of choice is an organic soil and non soil base.\r\n\r\n* Knowledgeable in the practical application of macro and micro nutrients, building up of soil flora as well as detection and treatment of deficiencies\r\n\r\n* Grow areas - indoor, outdoor, and small frame green house production.\r\n\r\n* Lighting methods and light control of cannabis vegetative and floral growth stages.\r\n\r\n* Control of thermal signatures based on production cycle.\r\n\r\n* Flushing techniques, final cultivation, trimming, dry rooms, and basic cure processes.\r\n\r\n\r\nOther Experience:\r\n\r\n* Mac and PC based platforms proficiency - operating systems and various applications.\r\n\r\n* Recording Media Expertise: Music Production -Sound Editorial -Video Editorial - Motion and Still Photography -and more.\r\n\r\n* Carpentry skills wood working and finish work.\r\n\r\n* Electrical Wiring - Low Voltage and High Voltage for residential or basic multi phase electrical.\r\n\r\n* Sales Experience -various retail and phone sales.\r\n\r\n* Applications: Photoshop, Adobe Premiere, FCP, Logic Pro, Pro Tools, Nuendo, MS OFFICE, and many many more.\r\n\r\nThank You... for your time in reading through my application.\r\n\r\nPlease feel free to contact me with any questions at all @ 818-770-1568.\r\n\r\n\r\n\r\nSincerely,\r\n\r\nWilliam Edward Duran","contact":"Please contact me by phone: 818-770-1568 or by email: edwardduran816@gmail.com","date":"2017-10-06T21:49:08.388Z"}