{"_id":"f569a6d0-b72e-11e7-9114-b9cdf193a899","name":"Bonnie Nichols","location":"Cave Junction Or","skillLevel":"Entry","certification":"false","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"Hello my name is Bonnie Nichols. I was trying to reply to your ad in Craigslist. Regarding Trim work position. That your company currently has an opening in. I myself have never grown marijuana but I have been around other people who have ,and I have helped them when it came to the trim part. \r\nThat meaning with the scissors sitting and cutting round basically the shake to create the bud itself. I am very trainable. And I have my own truck. So no issues with transportation here. To be honest with you. I honestly would rather not work in the actual Garden or really with the hanging drying business, but I also need work. Now if this is a sit and trim job I'm your person.\r\n I live in Cave Junction Oregon with my husband. I'm 39 years old I do not work right now at all. I have no children just animals. So basically I have very open availability. I am looking to try to start a new career. \r\nI'm a really likeable person. I've worked a few customer service style positions before. I would love to be given this opportunity to at least try this career path out and see if it works. \r\nOh and another thing is I have not currently been working for the last 3 years. I moved out of state with my husband to further his career for the past four years and just moved back this past June. But I'm motivated can be skillful very trainable and will smile everyday...\r\nI am ready to  hit the work field again 100% and give it my all. So like I said I hope you give me an opportunity for an interview. Hope to meet you soon, and have a very nice day! \r\n My information for reaching me is of course my email nbonnie2@gmail.com but to be honest I'm terrible with checking my own emails lol. The best way is by telephone and my telephone number is out of state it is area code 702-475-0905 and as a secondary number just in case I have area code 541-660-3876 thank you for your time.\r\nBonnie Nichols","contact":"nbonnie2@gmail.com","date":"2017-10-22T13:43:17.787Z"}