{"_id":"045e1db0-a8c5-11e7-9a7d-c99de06bb99b","name":"Jeremy Smith","location":"San Fernando Valley, CA","skillLevel":"Senior","references":"true","accommodations":"true","workType":"Part-time","coverLetter":"I really want love to grow. It is a passion of mine. I do that on my own now. I just love being around cannabis in general. I have been trimming for 5 plus years now. \r\nJEREMY MICHAEL SMITH \r\n18730 NAPA ST. ● NORTHRIDGE, CA 91324\r\nPhone: 818-292-3739 ● E-Mail:  jsmit88@yahoo.com    \r\nObjective\r\nMy goal is to obtain a challenging and rewarding position in which I can enhance my skills by; expeditiously learning an organizations policies and procedures in order to amplify department production utilizing \"outside the box thinking\" as well as all company resources.\r\nSkills\r\nComputer Operation (PC & MAC) \r\nIndispensable Knowledge of Medical Cannabis \r\n Extensive Knowledge of Macro/Micro Nutrients & Trace Elements\r\nSoil Microbiology \r\nRoot Inoculation\r\nCO2 Feeding  \r\nCross Brand and/or Nutrient Mixing w/o Lock Out/Drop Out\r\nExperience with Powder & Liquid Fertilizers \r\nExtensive Foilar Sprays for Various Applications \r\nLight Spectrum & Recipe Expert \r\nHorticulture Specialist (LED, Quantum Boards, COB, ChilledLed HID, HPS, MH Organic Soil Micro-biology)\r\n55 wpm Typing Speed\r\nInternet Research\r\nPlanning and Scheduling\r\nExperience\r\nThe Clinik - Indoor Master Grower 03/14 - 05/17\r\nManaged a medium-scale warehouse with various grow and supplemental lights.\r\nPerformed all the tasks in grow rooms including: cloning, transplanting, feeding plants, defoliation, super cropping, topping, flushing, foliar and preventative sprays, trimming, packaging, waste disposal and inventory management.\r\nDeveloped, maintained, and implemented grow warehouse protocols and nutrient regiment per in-house protocol.\r\nManaged grow warehouse working crew of up to 20 employees/volunteers.\r\nManaged medicinal marijuana plants, giving each individual plant the attention it needs one at a time.\r\nManaged medicinal plant scheduling and organization to precisely project all garden needs on a daily, weekly, and monthly basis to keep garden green clean and over-all overhead low.\r\nCataloged and analyzed each individual strain from clone to flower to harvesting.\r\nCloned and managed vegetation with at least a 90% success rate.\r\nExecuted preventative maintenance and elimination/reduction of all types of mold, powdery mildew, spider mites, root aphids, fungus gnats, etc.\r\nMaintained a clean and organized work environment.\r\nMastery of Soil growing methods including micro-nutrients, beneficial bacteria/fungi, trace elements, flavor/aroma additives and nutrient implementation.\r\nExpert knowledge environmental manipulation for CO2 feeding through stomata.\r\nExpert knowledge of plant diseases, insects and fungi, as well as plant treatment options\r\nWell researched in new techniques and insight to expand knowledge in nutrient of individual strains, high yield recipes, controlled stress environments to different lighting systems/set ups and light spectrum recipes.\r\n\r\nThe Clinik - Budtender/Assistant Manager - Front Desk   11/12 – 02/14\r\nAnswered phones and greeting patients.\r\nAddressed the concerns of current and future patients, both in person and over telephone. (Via email when appropriate)\r\nAccepted, signs and logs packages from UPS, FedEx; and other parcel services. \r\nInspected the dispensary on a daily basis.\r\nHandled logins and log-outs reports.\r\nGenerated maintenance work orders as well as its follow throughs.\r\nReviewed new patient sign-up paperwork prior to entry.\r\nSat in on interviews with prospective budtenders .\r\nPosted adds for budtenders.  \r\nScheduled and handled emergency and non-emergency maintenance. \r\nMonitored property surveillance as requested. \r\nCreated/obtained warning signs and placed them on property accordingly. \r\nSuggested particular strains to patients per medical need. \r\nProvided a wide range of administrative and direct patient support services to the office staff and owners of dispensary. \r\nPerformed other tasks as maybe required by the position and/or directed by the Manager.\r\nReferences & Education \r\nHigh School Graduate 2006\r\nReferences available upon request.","contact":"jsmit88@Yahoo.com","date":"2017-10-04T05:29:39.664Z"}