{"_id":"61cc76e0-aa1e-11e7-aa22-3549a2bf08d6","name":"Farah Shaltaf","location":"Portland, Oregon","skillLevel":"Mid","certification":"true","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"Hello and good evening to whom this may concern,\r\n\r\nMy name is Farah Shaltaf and I am interested in joining your respectable establishment. I believe I am an excellent candidate to work with your company as I have experience in the cannabis industry, social media, retail, excellent customer service, administrative work, team leading, training, hiring, group and teamwork, and multitasking.\r\n\r\nFor the past three months, I have been working in a dispensary where I educated myself in the cannabis industry with regards to strains, products, inventory, METRC, and a BIOtrack POS system. I have been handling a high volume of customers while simultaneously exchanging exceptional customer service skills and helping customers choose the best product for them. On a daily basis, I have been keeping up-to-date with news, articles, and information regarding new products and regulation changes. I have been handling products safely and in a clean manner during operating and opening/closing hours.\r\n\r\nFor the past three years, I have experienced working in the food industry, with a high volume of multi- tasking, organization, creativity, and working under pressure. I handled food preparation and design, social media, advertising strategies, handling the register, and inventory. This job has given me the opportunity to learn how to work under pressure at a high speed, to maintain a positive attitude, to be accurate and efficient, and to pay attention to detail. I have had the opportunity to build excellent customer-relations skills as well.\r\n\r\nFor four months, my experience in promoting and marketing has given me the chance to excel at sales, build customer-salesperson relationships, train and teach employees, work under high amount of pressure, and meet goals daily.\r\n\r\nIn my one-year experience in retail as a Sales Lead at Ann Taylor and Sales Associate at American Eagle, New York, I worked on improving my sales, team leading, organization, time-management, and customer service skills. I always welcome any new occupation/industry to increase my knowledge and education.\r\n\r\nIn my two years experience as an Assistant Producer in New TV, Lebanon, I worked in a high-pressured, fast- paced national television station where I interacted with national celebrities, program hosts, producers, cast, and crew. I worked in pre-production, production, and post-production of a social issues program. I improved my administrative, multitasking, customer service, research, and organizational skills where I followed up with all necessary steps for successful shows.\r\n\r\nI hope you give me the chance to prove I will be an important addition to your respectable establishment. I let my hard work speak for itself, as I believe in giving my all in any job or position. I am a fast-learner and am capable of adapting myself to any environment.\r\n\r\nIf interested, please do contact me at (347) 822-5737. I look forward to hearing from you. Thank you for your time and consideration.","contact":"Please contact me at (347)822-5737","date":"2017-10-05T22:41:52.859Z"}