{"_id":"308146f0-a961-11e7-9a7d-c99de06bb99b","name":"Zephaniah Marion","location":"Pasadena CA","skillLevel":"Senior","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"ZEPHANIAH W. MARION\r\n431 N. Wilson Ave #5\r\nPasadena, CA 91106\r\nZmarion@yahoo.com\r\n213.804.8444\r\nwww.facebook.com/ZephaniahMarion\r\nEDUCATION\r\nWallenpaupack High School, Pennsylvania, 2007. NPK University, Online Gardening University 2015-2017.\r\n \r\nOBJECTIVE\r\nTo grow as well as cultivate dynamic strains utilizing my experience in cultivating/extracting/manufacturing to reach and expand your consumer base.\r\n \r\nSKILLS\r\nGROWING: Advanced organic soil cultivator and cannabis strain creator:\r\n• Cannabis hybrid creator and cloner.\r\n• Seedling, Vegetation, and Flower cultivator.\r\n• Drying, Curing, and Trimming Specialist.\r\n• Soil Mycelium Specialist.\r\n• Topping\r\n• Caging\r\n• Pruning\r\n• Indoor Lighting knowledge\r\nEXTRACTION: Advanced Cannabis Extraction knowledge:\r\n• Everclear RSO Oil Extraction.\r\n• Dry Ice Kief Extraction and Press.\r\n• Ice Water Bubble Hash/Kief and Press.\r\n• Butane Dabs\r\n• Heat Rosin Extraction\r\n• Cannabis Edibles: Canna-Butter, RSO Black/Coconut Oil, Canna-milk, Canna-Flour, Canna- Chocolate-Canna Juice.  \r\n \r\nOTHER: Bobcat, Skid Steer, Wheel Loader, Scissor Lift, Box Truck, and Auto Driver. Stone Thermalist/Stone Cutting Specialist, Lifeguard-CPR and Defibulator Certified (2002-2004), Traveling CXO. House Flipping Business Owner\r\n \r\n \r\n     PROFESSIONAL EXPERIENCE\r\n \r\nCannabis Grow Specialist/Extractor: Owner/ Producer. 2010- Present.\r\n*Specialties: Outdoor Caging and Indoor Scrog Cultivation. Soil Mycelium Specialist.\r\n \r\nHouse Flipper/Owner: Marion Investments. 2012-2014. Locate housing properties for potential investment opportunities, Legal and realtor inspections, employee hires. Painting, plumbing, and construction.\r\n \r\nExterminator: A3 Superior Pest Control, Pennsylvania. 2010-2012. Served three states NY, NJ, PA for pest control. Responsible for driving, loading 200-pound heaters and cables into customers homes. Implementation of process from start to finish.\r\n \r\nLaborer: Home Depot, Maine. 2009. Responsible for tearing down and rebuilding in store garden structures (50ftx20ft) and driving the scissor lift on location.\r\n \r\nResident Technician: St. Joseph’s Center, Scranton, PA. 2009-2011. Responsible for patient care. Duties included: Feeding, G-Tube Feedings, O2 tanks, rehabilitation.\r\n \r\nSports Palace Attendant: Ceaser’s Cove Haven, Lake Ariel, PA. 2004-2009. Responsible for maintenance of tennis, bocce, ice-skating, and pool hall areas. Grass cutting, leaf blowing, pool cleaning, house keeping, and heavy lifting of materials as needed. Snowmobile and waterski instructor.","contact":"Zmarion@yahoo.com","date":"2017-10-05T00:07:35.207Z"}