{"_id":"3f62a6a0-a97f-11e7-aa22-3549a2bf08d6","name":"Derrick Gilchrist","location":"Vancouver WA","skillLevel":"Senior","references":"true","accommodations":"false","workType":"Part-time","coverLetter":"I have a OLCC workers permit and am currently working at stated company's as a trimmer of dried cured cannabis, cultivation of all stages of cannabis growth and use of RAW joint rolling machine for orders and product packaging. With ever changing industries such as this we must always look to further our skills and knowledge. With that I feel very confident in identifying various forms of ailments in the cannabis plant. On average a day of trimming will exceed 1,000 grams. For contact reference contact Brian +1 (503) 828-8566 or Sam +1 (503) 490-6366\r\n\r\n\r\n\r\nDerrick Gilchrist\r\n501 E. 13th. St. Apt# 55\r\nVancouver, W.A. 98660\r\n360-980-5892\r\nderrickgilchrist72@yahoo.com\r\n \r\n\r\nWY East Gardens \r\n2026 NE Columbia Blvd\r\nPortland OR 97211\r\nPosition; Trim lead\r\n7/2017-current\r\n\r\nDevils-Lettuce LLC.\r\n14879 NE Campaign Way \r\nPortland OR 97230\r\nPosition: Cultivation, processing, packaging\r\n11/2016-current\r\nPrevious medical grow \r\n01/2013-recreational inception\r\n\r\nShilo Inn 11707 NE Air-Port Way, Potland OR\r\nPosition: Banquet Cook 02/25/2014-04/2015\r\n\r\nCourtyard by Marriot 1231 N. Anchor Way Portland OR\r\nPosition: Line Cook  05/2013-02/2014\r\n\r\n\r\n Black-Angus Restraunt 415 E. 13Th St, Vancouver, W.A.                                                                                                Position:Kitchen-Utility  03/2012-05/2013  \r\n\r\n \r\nExperience:   C-tech                                                                                                                                                       4275 Pacific Rim Blvd. Camas W.A. 98607\r\n                        A.P.W Assembler       03/2009 to 06/2009\r\n\r\n    Cleaned parts, using cleaning solution, air hose and cloth.\r\n \r\n    Inspected units to detect malfunctions and adjusted, repaired and replaced component parts to ensure conformance to specifications.\r\n     \r\n    Positioned, aligned and adjusted work pieces and electrical parts to facilitate wiring and assembly.\r\n     \r\n    Read and interpreted schematic drawings, diagrams, blueprints, specifications, work orders and reports to determine materials requirements and assembly instructions.\r\n \r\n    Tested wiring installations, assemblies and circuits for resistance factors and operational defects and recorded results.\r\n     \r\n    Drilled and tapped holes in specified locations to mount control units and to provide openings for elements, wiring and instruments.\r\n     \r\n    Assisted and conferred with supervisor and engineer to plan and review work activities and to resolve production problems.\r\n \r\n                                                                                                                      \r\n  Home Town Buffet 7809-B N.E. Vancouver plaza Dr. Vancouver W.A. 98661\r\n                                                         line-Cook  11/2006 to 4/2008\r\n\r\n    Observed and tested foods to determine if they had been cooked sufficiently, using methods such as tasting, smelling, and piercing them with utensils.\r\n \r\n    Baked breads, rolls, cakes, and pastries.\r\n \r\n    Inspected food preparation and serving areas to ensure observance of safe, sanitary food-handling practices.\r\n \r\n    Seasoned and cooked food according to recipes and personal judgment and experience.\r\n \r\n    Weighed, measured, and mixed ingredients according to recipes and personal judgment, using various kitchen utensils and equipment.\r\n     \r\n    Washed, peeled, cut, and seeded fruits and vegetables to prepare them for consumption.\r\n \r\n    Estimated expected food consumption, then requisitioned and purchased supplies, and procured food from storage.\r\n \r\n                                                                                                                        \r\nJoe's Crab Shack    101 SE Columbia Blvd. Vancouver W.A. 98661\r\n                                    Broiler Cook    04/2004 to 12/2004\r\n\r\n    Substituted for and assisted other cooks during emergencies and rush periods.\r\n \r\n    Regulated temperature of ovens, broilers, grills, and roasters.\r\n \r\n    Baked, roasted, broiled, and steamed meats, fish, vegetables, and other foods.\r\n \r\n    Estimated expected food consumption, then requisitioned and purchased supplies, and procured food from storage.\r\n \r\n    Trained new  team members in proper function of positions.\r\n \r\nEducation: Clark College    1933 Fort Vancouver Way Vancouver W.A. 98663\r\n                                                GED                     2003\r\n\r\n                   Clark College      1933 Fort Vancouver Way Vancouver W.A. 98663\r\n                                                  A. A\r\nGerry Soto-(360) 910-1568\r\n\r\nShawn Olson-(503) 737-4010\r\n\r\nKaty Weaver-(541) 272-7147\r\n\r\nimage1.jpeg","contact":"derrickgilchrist72@yahoo.com","date":"2017-10-05T03:42:45.185Z"}