{"_id":"b4a5b670-b0f3-11e7-badf-f3eff1f658c7","name":"charles prink","location":"Los Angeles, ca","skillLevel":"Entry","certification":"true","references":"true","accommodations":"true","workType":"Full-time","coverLetter":"Charles G Prink\r\n\r\n\r\n3430 ½ council street\r\nLos Angeles, CA 90004\r\n(360) 831-7222\r\nPrinkCharlie@Gmail.com\r\nEXPERIENCE\r\nVigor/Cascade general shipyard, Portland,OR - Carpenter/Scaffolding apprentice  \r\n12/2016 to 9/2017\r\nSet up and take down of Scaffolding and using power tools working at heights of up to 180ft\r\nJack in the box,  Vancouver, Wa —crew member/Team Leader\r\n2016 to 12/2016\r\nGrill cook, food prep, cashier, worked drive-thru, customer service, general store maintenance and more.\r\nU.S. Construction, Inc,  Brush Prairie, WA - Packer/ Entry level builder               02/2016 to 07/2016\r\nGather materials for workers to handle on job sites and Keep job sites clean pack panels out for the walls help build forms and walls Hold plumb bobs, sighting rods, and other equipment, to aid in establishing reference points and lines using and reading a tape measure and Assist in the layout of foundation and much more.\r\nJack in the box,  Vancouver, Wa — Team Leader\r\n2013 - 2014\r\n\r\nGrill cook, food prep, cashier, worked drive-thru, customer service, general store maintenance ,Inventory, stocked and did morning truck, made schedules and traveled to other store locations to help with displays.\r\nSubway, Portland, OR — Sandwich Artist\r\n2012 - 2013\r\n\r\nAssisted subway customers with orders prepared food for customers to their specifications operated cash registers and completed other jobs assigned by the subway manager\r\nSubway, Beaverton, OR — Sandwich Artist/Assistant Manager\r\n2012 - 2013\r\n\r\nAssisted subway customers with orders prepared food for customers to their specifications operated cash registers and completed other jobs assigned by the subway manager and Took care of freight orders and did inventory checks and balance the safe.\r\nJack in the box,Vancouver, WA — Team Leader/Manager\r\n2011 - 2012\r\n\r\nGrill cook, food prep, cashier, worked drive-thru, customer service, general store maintenance ,Inventory, stocked and did morning truck, made schedules and traveled to other store locations to help with displays.\r\nRuby Tuesday, Vancouver, WA — Dishwasher/Prep cook\r\n2009 - 2011\r\n\r\nWashed dishes prepared food clean entire kitchen nightly including deep cleaning floors did early morning truck twice a week and performed inventory.\r\n\r\nObjective\r\nMy objective is to become associated with a company where I can utilize my skills and gain further experience while enhancing the company's productivity and reputation.\r\nSkills\r\n\r\n\r\nI'm a fast learner I make sure I get things right the first time I'm  good with people I'm a hard worker and I love to learn new things and new ways to do my jobs","contact":"prinkcharlie@gmail.com","date":"2017-10-14T15:24:01.575Z"}