{"_id":"e2882620-a92f-11e7-9a7d-c99de06bb99b","name":"Armando Rubio","location":"Corona California","skillLevel":"Entry","references":"true","accommodations":"false","workType":"Full-time","coverLetter":"Armando Rubio\r\n\r\n2155 Highpointe Drive Unit 110 Corona,CA 92879\r\n\r\narmandorubio991@gmail.com\r\n\r\n(515)290-9867\r\n\r\n\r\n\r\nHighly innovative, creative and self-motivated individual with a background in performing fabrication work. Well versed using a variety of manual and semi-automatic tools. Quick learner and able to follow directions well. Looking for growing opportunities.\r\n\r\n\r\n\r\nExperience\r\n\r\nConstruction/ Green Houses\r\n\r\nConleys Greenhouse Remanufacturing\r\n\r\n12/2016-07/2017\r\n\r\n*Clean and prepare construction sites to eliminate possible hazards. \r\n\r\n*Read plans, instructions, or specifications to define work activities.\r\n\r\n *Control traffic passing near, in, or around work zones. Signal equipment operators to facilitate alignment, movement, or adjustment of machinery, equipment, or materials. \r\n\r\n*Position, join, align, or seal structural components, including but not limited to prefabricated steel and aluminum. \r\n\r\nMeasure, mark, or record openings or distances to layout areas where construction work will be performed. \r\n\r\n *Load, unload, or identify building materials, machinery, or tools. Store all tools and materials in designated location, according to project plans or specifications. \r\n\r\n*Erect or dismantle scaffolding, shoring, braces, traffic barricades, ramps, or other temporary structures. \r\n\r\n*Operate cord and cordless drills, impact and chop saw for aluminum and steel. \r\n\r\n*Install fixtures, outlets, terminal board's, switches and wall boxes using hand tools. \r\n\r\n*Operate scissor lift and fork lift.\r\n\r\n\r\nWelder/Diesel Mechanic\r\n\r\nWestern Truck Exchange\r\n\r\n06/2009 - 03/2016\r\n\r\n*Assisted in various task, cleaned and maintained work areas to ensure proper functioning and safe working conditions. \r\n\r\n*Adjusted valves, gauges and flames on equipment and handled compressed gas and oxygen cylinders to be used during welding,also assisted in laying out,positioning and fitting various parts for welding.(MIG & Arc)\r\n\r\n*Well knowledge in building and repairing stake beds,van body,flat beds and lift gates. \r\n\r\n*Also installed pto and pump system;replacement, hydraulic and electrical troubleshooting,and replacing electrical and hydraulic components.\r\n\r\n* Very skillfull in installing, maintaining and repairing of motors,generators,transformers,gear box,and circuit breakers. General electrical maintaince and repairing.\r\n\r\n*Inspect brake system, steering mechanism,transmission,engines,and other parts of vehicle. Do routine maintenance,such as changing oil,checking batteries, and lubricating equipment and parts.\r\n\r\n*Experience in breaking down old seats, and washing parts;carpet,oil stains.\r\n\r\n*Maintenance and repair of electrical components in cabs or electrical compartments and perform maintenance for miscellaneous equipment using blueprints, schematics, and location circuit plans. \r\n\r\n*Well skilled in tearing down and building car components,working with simple and complex tools. \r\n\r\n*Loading and unloading the delivery truck. Driving the delivery truck to customers to make deliveries. Demonstrating excellent customer service. \r\n\r\n*Check vehicles to ensure that mechanical, safety, and emergency equipment is in good working order. Maintain logs of working hours and of vehicle service and repair status, following applicable state and federal regulations. \r\n\r\n*Obtain receipts or signatures for delivered products and collect payment services when required. \r\n\r\n*Check all load-related documentation to ensure that it is complete and accurate. \r\n\r\n*Maneuver trucks into loading or unloading position, and checking that vehicle and loading equipment are properly positioned. Secure cargo for transportation, using chains, binders, tarps, ratchets. Read bill of lading to determine assignment details. \r\n\r\n*Report vehicle defects, accidents, traffic violations, or damages to the vehicles. \r\n\r\n*Report damages to products to supervisor in charge. Turn in proper documentation to its designated office daily. \r\n\r\n*Maintain a clean environment in the inside and outside of the truck. \r\n\r\n*Conduct Pre-Trip inspection of truck and trailer.\r\n\r\n*Test drive vehicle to ensure that they run smoothly\r\n\r\nParts Specialist\r\n\r\nO'reilly Auto Parts\r\n\r\n03/2014 - 12/2014\r\n\r\n*Greet customers on sales floor, directs them to product or to parts specialist. \r\n*Keep the front area stocked and fronted, stock merchandise according to planograms or displays, and complete sales preparation. \r\n*Provide retail and professional installer customers with a high level of customer service.\r\n\r\n\r\n\r\nDental Assistant\r\n\r\nSt. Anthony's Medical Center\r\n\r\n03/2008 - 06/2009\r\n\r\n*Prepare treatment room for patient by following prescribed procedures and protocols.\r\n\r\n* Prepare patient for dental treatment by welcoming, comforting, seating, and draping patient.\r\n\r\n *Provide information to patients and employees by answering questions and requests.\r\n\r\n*Take dental X-rays(Digital & panoramic)\r\n\r\n*Perform coronal polish\r\n\r\nEducation\r\n\r\nGeneral Education\r\n\r\nLos Angeles Trade Technical College\r\n\r\n06/2011 - 01/2012\r\n\r\nProfessional delivery of the most current industry relevant training, including sustainable construction techniques and other green technologies.\r\n\r\n\r\n\r\nDental Assistant\r\n\r\nUEI\r\n\r\n04/2007 - 03/2008\r\n\r\nDental specialties including Orthodontics, Pedodontics, Prosthodontics, Oral surgery, and Endodontics,Preventative Dentistry,Radiography,CPR certification\r\n\r\n\r\n\r\nHigh School\r\n\r\nJohn C. Fremont High School\r\n\r\nYear Graduated:2007\r\n\r\n\r\n\r\nOther\r\n\r\nRead, write, and understand English and Spanish","contact":"armandorubio991@gmail.com","date":"2017-10-04T18:14:39.151Z"}